{"B-Well Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/b-well-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/b-well-kush/8181/rbhv7moh4ssv6hqctozh.jpg?t=3b18e3c714a726c6eb7408ec59ae13871066339c7c8771922b65876d46932897", "name": "B-Well Kush", "description": "B-Well Kush is a rare indica dominant hybrid strain created through crossing the infamous OG Kush X Pure Kush X Bubba Kush strains. This bud took home 1st Place for Best Indica at the 2012 THC Classic and 2nd Place in 2013. Once you experience its relaxing full-bodied effects and super high 25% average THC level, you'll soon see why. The B-Well Kush high comes on pretty quickly after your first exhale, lifting your mind and leaving you in a state of happy focus. You'll feel an increase in creativity and motivation in this state, with a tendency towards being sociable with anyone and everyone around you. Almost as quickly as this lift starts, it will be stolen away, replaced with a sleepy sense of relaxation and couch-lock. Your body will fall deeper and deeper into sedation, eventually pulling your mind with it into a long peaceful sleep. Thanks to these powerful effects, B-Well Kush is often chosen to treat conditions such as chronic stress or anxiety, depression, mood swings, chronic pain, and fatigue. This bud has a classic spicy herbal citrus flavor and a woody aroma to match. B-Well Kush bud have small dusty green nugs with furry orange hairs and a light frosted coating of tiny milky white crystal trichomes.", "effects": ["Creative", "Focus", "Happy", "Sleepy", "Sociable", "Uplifting"], "aromas": ["Earthy", "Herbal", "Lemon", "Sweet", "Woody"], "flavors": ["Citrus", "Herbal", "Pine", "Spicy"], "relieves": ["Citrus", "Herbal", "Pine", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "B29": {"url": "https://www.allbud.com/marijuana-strains/hybrid/b29", "img": "https://media.allbud.com/resized/350x242/media/images/strain/b29/yKNRhggz/green-crackpng.jpg?t=9d0546a9612de2432f4aa980456c18398b67e1c2e36e8c6e885dfa7a3bbb2725", "name": "B29", "description": "B29 is an evenly balanced hybrid strain (50% indica/50% sativa) created through a cross of the classic Green Crack X Holy Grail Kush strains. Perfect for any hybrid lover, B29 packs a long-lasting high that hits both mind and body with a high level of potency thanks to its super high THC level, which typically bottoms out at about 20% on average. That being said, B29 is not to be underestimated – it can totally knock out even the most experienced of users if they don't mind their dosage. The high starts with a subtle build, sneaking up on the back of the mind before launching through it with a lifted energy and euphoria. As your mind soars higher and higher, a sense of unfocused happiness will wash over you, leaving you dazed and floating through happy visions as your body begins to settle into a deeply relaxing physical stone. With these effects and its high THC level, B29 is said to be perfect for treating migraines or headaches, depression, chronic fatigue, nausea, and chronic stress. This bud has a sweet and sour skunky pine flavor with a heavily dank and pungent aroma to match. B29 buds have elongated super dense olive green nugs with dark amber hairs and a coating of tiny clear crystal trichomes.", "effects": ["Cerebral", "Energizing", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Dank", "Earthy", "Pungent", "Skunky", "Spicy"], "flavors": ["Herbal", "Pine", "Skunky", "Sweet", "Woody"], "relieves": ["Herbal", "Pine", "Skunky", "Sweet", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BABY JESUS OG": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/baby-jesus-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/baby-jesus-og/7852/uwzjejoli8mmziw8qodd.jpg?t=11e72ad23b164298a1d063277ebd9b3a880c98d9085490fb925877eaa6928e61", "name": "BABY JESUS OG", "description": "Baby Jesus OG is a super rare sativa dominant hybrid strain that is said to be a cut of the classic Jesus OG, a Jack's Cleaner X Hell's OG X Space Queen cross. This bud brings on the classic Jesus OG effects but to a slightly lesser level, with a lower THC level that tops out at about 20% on average. Even with the slight decrease in THC level, Baby Jesus OG brings on the energizing lifted effects of its parent, infusing the user with long-lasting energy perfect for a wake-and-bake or an afternoon pick-me-up. You'll feel the energizing effects almost as soon as you exhale, accompanied by a rush of euphoria and focus that fills your mind with creative thought and motivation. As your focus and mental capacity grows, your body will start to relax, erasing any aches and pains without weighing you down in the slightest. These effects can quickly become overwhelming for those who suffer from anxiety or paranoia, so user beware! Thanks to its high THC level and these daytime effects, Baby Jesus OG is said to be perfect for treating chronic fatigue, depression, bipolarity, and migraines or headaches. Baby Jesus OG has a sweet lemony pine flavor and an aroma to match that is slightly spicy and pungent. Baby Jesus OG buds have tiny grape-shaped olive green nugs that are completely coated in tiny dusty white crystal trichomes.", "effects": ["Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Lemon", "Pine", "Sweet", "Woody"], "flavors": ["Berry", "Lemon", "Sweet", "Tangy"], "relieves": ["Berry", "Lemon", "Sweet", "Tangy"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Baby Kay": {"url": "https://www.allbud.com/marijuana-strains/hybrid/baby-kay", "img": "https://media.allbud.com/resized/350x242/media/feature/strain/baby-kay.jpg?t=d341752f6077fd545af4d67a2a4d2f78c6183ea37bbef26d6fb95b3d77712f67", "name": "Baby Kay", "description": "Baby Kay is a super rare evenly balanced hybrid strain (50% indica/50% sativa) created with unknown parentage due to a high level of breeder secrecy about its background. Even with the lack of information about its background, this bud is highly sought after for its super relaxing effects that are perfect for killing any stresses or anxieties that are plaguing your mind. The Baby Kay high starts with a rush of cerebral effects that seem to trickle in before suddenly slamming into your brain. You’ll feel totally lifted and euphoric with a hint of focus and motivation. An influx of creative energy comes next, squashing any remaining negative or racing thoughts. As your mind starts to fade into oblivion, your body will begin to drift away into a state of complete relaxation and calm. You won’t feel sedated in this state, rather you’ll be completely at ease. Thanks to these totally relaxing effects and is moderate 9-14% average THC level, Baby Kay is often recommended for all levels of users suffering from conditions such as chronic stress or anxiety, depression, insomnia, and chronic pain. This bud has a sweet herbal flavor to it with a hint of woodiness upon exhale. The aroma is very earthy and flowery with a rich herbal overtone and a touch of woods. Baby Kay buds have heavy spade-shaped neon green nugs with bright orange hairs and a coating of amber crystal trichomes.", "effects": ["Relaxing", "Uplifting"], "aromas": ["Earthy", "Floral", "Skunky", "Spicy"], "flavors": ["Herbal", "Sweet"], "relieves": ["Herbal", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Baby Stewie": {"url": "https://www.allbud.com/marijuana-strains/hybrid/baby-stewie", "img": "https://media.allbud.com/resized/350x242/media/images/strain/baby-stewie/tHq8dmLI/15186807306791631291339jpg.jpg?t=cf18b19eb46ea9dad29afabae41260254e32f3ef593d42faaad2cfd5239dccf9", "name": "Baby Stewie", "description": "Baby Stewie is an evenly balanced hybrid (50% indica/50% sativa) strain created through a special cross of the infamous OG Kush X Blue Dream. Although this bud has many siblings per say, Baby Stewie is definitely one bud that you should try at least once in your life. The high is very well balanced and uplifting in nature with full-bodied effects that leave you feeling relaxed and completely at ease. It starts with an uplifted mood boost that leaves you feeling happy with a sense of hazy introspection that numbs your mind but still leaves you functional if need be. A body buzz comes next, washing over you with relaxing lazy waves that leave you feeling completely at ease although not weighed down in the slightest. Because of these effects and its insanely powerful 24-26% average THC level, Baby Stewie is a great choice for the experienced patient suffering from conditions such as chronic pain, muscle spasms, depression, and chronic stress or anxiety. This bud has a sweet berry kush aroma with hints of grassy herbs and spices. The flavor is of sweet blueberries with a hint of creamy vanilla and an overtone of fresh herbs and kush. Baby Stewie buds have lumpy long pepper-shaped bright green nugs with surprisingly vibrant blue undertones, clear crystal trichomes, and random clear hairs spattered throughout.", "effects": ["Body High", "Cerebral", "Relaxing", "Uplifting"], "aromas": ["Berry", "Earthy", "Grassy", "Herbal", "Kush", "Spicy"], "flavors": ["Berry", "Blueberry", "Herbal", "Spicy"], "relieves": ["Berry", "Blueberry", "Herbal", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BackBeat OG": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/backbeat-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/backbeat-og/P7K5S72n/15-cjpg.jpg?t=802618b91a3889407b8634434ccf3c69a688c668a0fec8870c7dfbbcf07481b8", "name": "BackBeat OG", "description": "BackBeat OG, also known as “Backbeat” or “Back Beat OG,” is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the potent Starfighter X Chuckles OG strains. This bud is perfect for when you want your body to relax but still want your mind to stay sharp, with full-bodied effects that will lift the spirits and erase aches and pains in no time flat. The high starts with a slow build of effects, starting with a light tingle in the spine and the limbs that soon spreads throughout the rest of your body in warming waves. Your body will soon begin to settle into a deeply relaxed state that's slightly sedative without causing too much couchlock. As your physical form settles, your mind will begin to lift into a high-flying state of pure happiness that's accompanied by a light boost in energy and creativity. In combination with its super high 25-30% average THC level, these effects make BackBeat OG perfect for treating those suffering from conditions such as depression, chronic fatigue, nausea or appetite loss, cramps or muscle spasms and chronic stress. This bud has a lightly spicy citrusy diesel flavor. The aroma is of pungent earth and diesel with a sharp kick of sour citrus and peppery spices. BackBeat OG buds have small rounded minty green nugs with olive undertones, dark orange hairs and a coating of frosty clear crystal trichomes.", "effects": ["Body High", "Cerebral", "Creative", "Energizing", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Citrus", "Diesel", "Earthy", "Pungent", "Sour", "Spicy"], "flavors": ["Citrus", "Diesel", "Herbal", "Sour", "Spicy"], "relieves": ["Citrus", "Diesel", "Herbal", "Sour", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Badazz Cheese": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/badazz-cheese", "img": "https://media.allbud.com/resized/350x242/media/images/strain/badazz-cheese/iVz9JxXi/big-buddha-cheese-2jpg.jpg?t=816e129a0d333d2871715b96f6471b3915540bee2dfcb2fee6341a296724c17f", "name": "Badazz Cheese", "description": "Badazz Cheese is a rare heavily indica dominant hybrid strain (90% indica/10% sativa) created through crossing the iconic Badazz OG Kush X Big Buddha Cheese strains. If you're a fan of a deliciously cheesy flavor, look no further – Badazz Cheese has everything that you need and so much more. This tasty lady packs a sweet and spicy herbal cheese flavor into each and every toke, with a light mouthful of pine upon exhale, too. The aroma is very similar, with an earthy spicy overtone that's very herbal and kushy. The Badazz Cheese high comes creeping in a few minutes after your first toke, sneaking into your brain before spreading throughout the rest of your body. You'll feel euphoric and lifted mentally while your body fades away into a deep relaxation and sense of calm that lasts for hours and hours on end before taking a sedative and sleepy turn. Thanks to these effects and its high 19-20% average THC level, Badazz Cheese is often chosen to treat those suffering from conditions such as insomnia, chronic pain, inflammation, cramps or muscle spasms and appetite loss or nausea. This bud has small conical fluffy bright neon green nugs with thin orange hairs and a coating of tiny frosty white crystal trichomes.", "effects": ["Body High", "Euphoria", "Happy", "Relaxing"], "aromas": ["Earthy", "Herbal", "Pine", "Spicy", "Woody"], "flavors": ["Herbal", "Spicy", "Woody"], "relieves": ["Herbal", "Spicy", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bad Boy": {"url": "https://www.allbud.com/marijuana-strains/hybrid/bad-boy", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bad-boy/5851/rqgq4jcssctje5dj8nng.jpg?t=4917e22904d37b73551f0b2dec36f9c247f71ae0713492a2d3b481dcb2b0cdaa", "name": "Bad Boy", "description": "Bad Boy is an evenly balanced hybrid (50% indica/50% sativa) strain created through crossing the infamous Gorilla Glue X Mt. Rainier strains. With a name like Bad Boy, you know this bud's going be good. Bad Boy is one bud that has an infamous high for all the right reasons – just a few hits of this troublemaker and you'll find yourself aroused beyond all reason with a heavy dose of energy to back it up. The high starts with a hyper-aware mood boost that leaves you energetic and happy with a building sense of motivation. As this head high builds, a tingly body buzz will wash over you, leaving you completely aroused with a slight pang of hunger. In combination with its high 20-21% average THC level, these effects give Bad Boy an edge in treating conditions such as chronic fatigue, depression, chronic pain, and stress. Bad Boy buds have long pepper-shaped forest green nugs with gold hairs and a light spattering of chunky gold crystal trichomes. The flavor is super spicy and pungent with a chocolate diesel overtone accented by sweet earth and kush. The aroma is very potent with a pungent spicy earth overtone accented by chemicals and diesel and topped with a heavy dose of sharp citrus.", "effects": ["Aroused", "Body High", "Hungry"], "aromas": ["Chemical", "Chocolate", "Citrus", "Diesel", "Earthy", "Pungent"], "flavors": ["Chocolate", "Citrus", "Spicy"], "relieves": ["Chocolate", "Citrus", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Baglung Nepalese": {"url": "https://www.allbud.com/marijuana-strains/sativa/baglung-nepalese", "img": "https://media.allbud.com/resized/350x242/media/images/strain/baglung-nepalese/sSHV6NAI/27jpg.jpg?t=ee37027438846b7eff7f2f13f753fb2a22693e1a2aa440fb5c55cb8caff6c42c", "name": "Baglung Nepalese", "description": "Baglung Nepalese is a 100% pure sativa strain that is a landrace native to the Baglung Nepali regions. Perfect for any lover of high-flying sativas, Baglung Nepalese packs a lifted and euphoric high that will fill the body with energy while helping to relax the mind. It starts almost as soon as you exhale, beginning with a happy boost of the spirits. You’ll feel any bad moods or racing thoughts get washed away almost immediately, replaced with a sense of tranquil happiness and ease. This is accompanied by an energizing physical high that fills your limbs with happy energy that gets you up and moving, no matter how lazy you feel. In combination with its moderate 12-14% average THC level, these effects give Baglung Nepalese an edge in treating conditions such as chronic fatigue, depression, chronic stress or anxiety and headaches or migraines. This bud has a sweet and fruity bubblegum flavor with a sugary strawberry candy exhale. The aroma is very similar, with a fruity overtone that’s accented by sweet and sour candy and berries. Baglung Nepalese buds have fluffy rounded emerald green nugs with pink and purple undertones, vivid pinkish-orange hairs and a coating of pink-tinted white crystal trichomes.", "effects": ["Euphoria", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Berry", "Fruity", "Spicy"], "flavors": ["Berry", "Candy", "Fruity", "Strawberry", "Sweet"], "relieves": ["Berry", "Candy", "Fruity", "Strawberry", "Sweet"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bahia Black Head": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bahia-black-head", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bahia-black-head/3384/edmpczpp0z9gdt5u3aif.jpg?t=6a22123f0d02349d632341a325af6ebcbf0f4dbd6192002905a4b45aee963c01", "name": "Bahia Black Head", "description": "Bahia Black Head is an indica dominant hybrid (70% indica/30% sativa) strain created as a potent cross between the relatively unknown Pure Brazil X KC 606 strains. This dank bud boasts a moderate THC level that ranges from 14-17% and a myriad of both indica and sativa effects. Users describe the Bahia Black Head high as having an immediate uplifting cerebral head high that leaves you euphoric with a sensation that you are floating on air. This is accompanied by a heavy case of the giggles and very social tendencies. The cerebral high fades into a long-lasting body high that leaves you utterly relaxed and completely couch-locked with an overpowering sense of sedation and a slight case of the munchies. Due to these potent effects, Bahia Black Head is said to be an ideal strain for treating patients suffering from conditions such as chronic stress or anxiety, mild to moderate cases of depression, and pain due to injury or illness. This bud has an overpoweringly strong aroma of harsh pungent hash and a strong hashy taste with a hint of earth. Bahia Black Head buds have medium-sized dense spade-shaped dark olive green nugs with dark purple undertones and hairs and a frosty layer of crystal white trichomes.", "effects": ["Cerebral", "Euphoria", "Giggly"], "aromas": ["Hash", "Pungent"], "flavors": ["Hash", "Spicy"], "relieves": ["Hash", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Baker's Delight": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bakers-delight", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bakers-delight/HPZHocmn/bakers-delightjpg.jpg?t=06f971219aac3ad584ceb90d594510bb72ea6b3ffe7cbed72d83935c04fd0beb", "name": "Baker's Delight", "description": "Baker's Delight is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the delicious The Cookies X Sorbet strains. This delicious indica is ideal for any patient who's after a super warming and relaxing high that will help them kick back and get to sleep, almost like a weighted blanket. The high comes on with a slowly building effect, creeping into your body with light tingly and warming waves that wash away any aches or pains, leaving you feeling physically relaxed and calmed from head to toe. As your body settles into this state of tranquility, your mind will sharpen, filling you with a sense of lifted focus and a touch of mental energy. Given these effects and its super high 20-21% average THC level, Baker's Delight is often chosen to treat those suffering from conditions such as depression, chronic stress or anxiety, ADD or ADHD, chronic fatigue and chronic pain. This bud has a mouthwatering sweet and fruity creamy candy flavor with hints of ripe berries and lemon upon exhale. The aroma is very similar, with a sour citrus overtone that's accented by lightly sweet fruits and herbs. Baker's Delight buds have fat and airy rounded blue-green nugs with purple undertones, orange hairs and a coating of matching chunky purple-white crystal trichomes.", "effects": ["Calming", "Focus", "Happy", "Relaxing", "Uplifting"], "aromas": ["Blueberry", "Citrus", "Lemon", "Orange", "Sour"], "flavors": ["Candy", "Citrus", "Creamy", "Fruity", "Sour", "Sweet"], "relieves": ["Candy", "Citrus", "Creamy", "Fruity", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Balance": {"url": "https://www.allbud.com/marijuana-strains/hybrid/balance", "img": "https://media.allbud.com/resized/350x242/media/images/strain/balance/gFRfUfyW/90jpg.jpg?t=6ddb00efbae7b1b75bc50ef4661d28919198c151f23264c92d9571ceb9567463", "name": "Balance", "description": "Balance is an evenly balanced hybrid strain (50% indica/50% sativa) created through an unknown combination of hybrid strains. Named for its super well-balanced high, Balance brings on potent medicinal effects that hit both mind and body and then linger for hours on end. You'll feel lifted with a sense of happiness and calm that permeates your entire being, leaving no additional room for negative thoughts or aches and pains. Your mind will feel lifted while your body relaxes into a state of pure physical relaxation and calm. These effects can turn sleepy at times, so mind your dosage if you have things to get done. In combination with its low 6-7% THC level and super high 15-16% average CBD level, these effects make Balance perfect for treating those suffering from conditions such as inflammation, spasticity, chronic pain, inflammation and chronic stress or PTSD. Balance has a sour citrusy lemon flavor with a lightly earthy exhale. The aroma is of earthy herbs and sour citrus with a spicy touch to it. Balance buds have grape-shaped bright neon green nugs with lots of thin orange hairs and a coating of frosty tiny golden amber crystal trichomes.", "effects": ["Body High", "Calming", "Happy", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Sour", "Spicy"], "flavors": ["Citrus", "Lemon", "Sour", "Spicy"], "relieves": ["Citrus", "Lemon", "Sour", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bali Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bali-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bali-kush/lpYs84fl/bali-kushjpg.jpg?t=e3296a87b89e8d2c3ffb4d3bb92c71fa789a3398812cd57951df4131723ae17c", "name": "Bali Kush", "description": "Bali Kush is a rare indica dominant hybrid strain (70% indica/30% sativa) created through crossing the infamous Black Afghani X Bubba Kush strains. Looking for a vacation from life's daily stresses? You've found it with Bali Kush. This bud packs a super relaxing high that will take you on a calming journey from uplifting start to sedative finish. The high starts with a lifted feeling that fills your mind with an almost giddy, unfocused euphoria, easing away any negative feelings almost instantly. You'll feel a relaxing body high wash over you next, lulling you into a state of physical calm without causing couch lock. This quickly turns sedative, leaving you dozing off into a long and peaceful sleep. With these effects and its high 18-22% average THC level, Bali Kush is said to be perfect for treating conditions such as insomnia, appetite loss, depression, chronic stress, and chronic fatigue. This bud has faded olive green nugs with deep purple undertones, bright amber hairs, and a coating of matching crystal trichomes. As you pull apart each sparkling nugget, aromas of fresh sweet pine and spicy earth are released. The flavor follows the same profile, with a heavily sweet overtone that lingers long after your final toke.", "effects": ["Euphoria", "Happy", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Earthy", "Herbal", "Pine", "Spicy", "Woody"], "flavors": ["Herbal", "Pine", "Spicy", "Sweet", "Woody"], "relieves": ["Herbal", "Pine", "Spicy", "Sweet", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Berry Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-berry-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-berry-kush/7889/lfnyn2gvq6dl0bpsemfl.jpg?t=5a6289a39a505136abcb9189c9cc203c7affc29729df01bb97570e19dbb49634", "name": "Banana Berry Kush", "description": "Banana Berry Kush is an indica dominant hybrid strain created through crossing the delicious White Berry X Banana Kush strains. This rare bud has an addictive sweet banana berry flavor and effects that are perfect for any kush lover. The smell of Banana Berry Kush is much like its flavor, although it does have a super pungent kushy skunk overtone that can fill a room with its potent stench. Almost as soon as you exhale, a sense of hazy euphoria will launch your mind into complete happiness, immediately erasing any negative or racing thoughts and leaving you in a state of blissful spaciness. As your mind lifts higher and higher, a moderate body high will slowly wash over you, lulling you into a state of complete relaxation with a touch of couch-lock. These effects are long-lasting and slightly sedative in nature, which can cause some users to fall asleep. In combination with its high 18-19% average THC level, these effects give Banana Berry Kush an edge in treating conditions such as chronic pain, depression, insomnia, and chronic fatigue. Banana Berry Kush buds have fluffy dusty green round nugs with long thin dark orange hairs and a coating of sweet sticky resin.", "effects": ["Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Earthy", "Kush", "Skunky"], "flavors": ["Berry", "Sweet"], "relieves": ["Berry", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Bread": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-bread", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-bread/NFAzC58m/44-cjpg.jpg?t=7ee1a9cff6ced11366a88dd5f45560dce1e27f30a400a392e93c22acddd8bf3d", "name": "Banana Bread", "description": "Banana Bread is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the delicious Purple Kush X Vietnamese Black strains. Named for its super delicious flavor, Banana Bread brings on a taste that is notably like its name – a fresh batch of nutty banana bread! The aroma follows the same profile, although with a notable hint of berry and herbs to it, too. The Banana Bread high is just as delicious as the flavor, with long-lasting effects that are warming and tingly in nature, perfect for killing any physical aches or pains. You'll feel a lifted sense settle in a few minutes after your final toke, filling you with a happy euphoria and easing away negative or racing thoughts. As your mind settles, a light tingle will begin to wash over your physical form, lulling you into an arousing state of pure bliss and calm. In combination with its high 19-23% average THC level, these effects make Banana Bread perfect for treating conditions such as chronic pain, inflammation, depression, chronic stress or anxiety and chronic fatigue. This bud has thick spade-shaped bright neon green nugs with purple leaves, amber undertones and a thick frosty coating of tiny white crystal trichomes.", "effects": ["Aroused", "Body High", "Calming", "Relaxing", "Sociable", "Tingly", "Uplifting"], "aromas": ["Berry", "Earthy", "Fruity", "Herbal", "Spicy"], "flavors": ["Berry", "Fruity", "Nutty", "Sweet"], "relieves": ["Berry", "Fruity", "Nutty", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Bubba Gum": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-bubba-gum", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-bubba-gum/7871/jeulmursv28oy0pzh81h.jpg?t=f7c2e675b56681e433ec998fa5d49f73a413414cabf93cc48c54d3e6491d27ae", "name": "Banana Bubba Gum", "description": "Banana Bubba Gum is a rare indica dominant hybrid strain created through crossing the delicious Banana Kush with the potent Bubba Gum. This hard to find bud brings on the delicious flavors and potent effects, packing a 19-29% average THC level into each tasty little nug. Each delicious inhale brings flavors of sweet bubblegum and fruity kush that linger on you tongue long after you finish toking. The mellow aroma is very fruity and floral in nature, with a light touch of fresh sweet bubblegum that can be detected as the nugs are burned. Almost as soon as you exhale, your mind will be lifted into a state of pure euphoria that erases any negative or racing thoughts and leaves you feeling completely blissful. As these effects grow, you'll be infused with a sense of creativity and focus that won't leave you feeling anxious. Thanks to these relaxing effects and its high THC level, Banana Bubba Gum is said to be perfect for treating insomnia, depression, and chronic stress or anxiety. This bud has round forest green nugs with dark amber hairs and a frosty thick coating of tiny white crystal trichomes.", "effects": ["Creative", "Euphoria", "Happy", "Relaxing"], "aromas": ["Bubble Gum", "Floral", "Fruity"], "flavors": ["Berry", "Bubble Gum", "Sweet"], "relieves": ["Berry", "Bubble Gum", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Cheese": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-cheese", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-cheese/zDJW2OS7/91ccf791-1f0b-4d1c-936a-291ea892114fjpe.jpg?t=fff2006c5608cde69c647b9fd40108fcba88c3ab61e572eaa5ace2dc9eff4ae0", "name": "Banana Cheese", "description": "Banana Cheese is a slightly indica dominant hybrid strain (55% indica/45% sativa) created through crossing the delicious Banana Kush X Cheese strains. When it comes to truly unique flavors, Banana Cheese totally takes the cake. This bad boy brings on tastes of sweet bananas and herbal cheese with a sour and spicy overtone that lingers on the tip of the tongue. The aroma is earthy and pungent with a spicy cheese overtone that intensifies the more that you toke. The Banana Cheese high is certainly as unique as its flavor, with effects that hit both mind and body with a high level of potency and hang on for hours on end. It starts in the head with a potent cerebral melt, filling you with an unfocused stress-free happiness and easing away any negative or racing thoughts. A super strong and incredibly relaxing body high accompanies this cerebral melt, keeping you sedated and couch-locked for hours on end. With these effects and its moderate 13-16% average THC level, Banana Cheese is said to be perfect for treating those suffering from conditions such as mood swings or depression, chronic stress, insomnia and chronic pain. This bud has dense grape-shaped minty green nugs with thick orange hairs and a coating of frosty tiny golden amber crystal trichomes.", "effects": ["Body High", "Cerebral", "Relaxing", "Sleepy"], "aromas": ["Cheese", "Fruity", "Herbal", "Pungent", "Sour", "Spicy"], "flavors": ["Fruity", "Sweet"], "relieves": ["Fruity", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Clips": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-clips", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-clips/ne8952B0/c-14jpg.jpg?t=2197748db49859e2c3ebb98b9e25d904cf37436c1756ef318b597872a132bd20", "name": "Banana Clips", "description": "Banana Clips is an indica dominant hybrid strain (80% indica/20% sativa) created through crossing the classic Strawberry Banana X Grizzly Purple Kush strains. Known for its super delicious flavor and high level of potency, Banana Clips is the perfect bud for any indica lover who appreciates a great taste, too. Like its name suggests, Banana Clips has a sweet banana flavor with accents of fruity bubblegum and flowery spices. The aroma is just as delicious, although with a notable hashy pepper overtone that sweetens the more that you toke. The Banana Clips high isn't quite as bright as the flavor, with relaxing effects that are best-suited for a lazy night spent at home when you don't have much of anything else to do. You'll feel a euphoric boost accented by touches of creativity and a tingly feeling that leaves you feeling giddy and giggly. As your mind lifts to new heights of hazy happiness, a relaxing body high will wash over you, lulling you into a hungry and couch-locked state for hours on end. With these effects and its super high 21% + average THC level, Banana Clips is often said to be perfect for treating conditions such as chronic pain, muscle spasms or cramps, insomnia, chronic stress and depression. This bud has fluffy rounded forest green nugs with sparse thin orange hairs and a coating of frosty tiny milky white crystal trichomes.", "effects": ["Body High", "Cerebral", "Creative", "Giggly", "Hungry", "Tingly"], "aromas": ["Bubble Gum", "Earthy", "Flowery", "Fruity", "Sweet"], "flavors": ["Bubble Gum", "Fruity", "Grape", "Spicy", "Sweet"], "relieves": ["Bubble Gum", "Fruity", "Grape", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Cream": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-cream", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-cream/hSllXWPa/20181229_121021jpg.jpg?t=7e4fbb443db840561c4f943947e6f204ed3205f56729f5ec99db1ffc66630785", "name": "Banana Cream", "description": "Banana Cream is an indica dominant hybrid strain created through crossing the insanely delicious Banana OG X Cookies and Cream strains. This bud is infamous among users for its insanely delicious flavor – it actually tastes like a banana cream pie! The aroma is just as intoxicating, with hints of sweet earth accented by fresh bananas and cream. The high comes on with a creeping effect a few minutes after you toke, filling you with a lifted sense of euphoria that leaves you tingly and giggly. As these effects grow, you'll start to feel a building sense of relaxation that fills both mind and body, lulling you into a slightly sedative state that won't weigh you down if you decide to get up and get moving. These effects in combination with its THC level that is said to be moderately high give Banana Cream an edge in treating conditions such as chronic pain, depression, muscle spasms or tremors, fatigue, and insomnia, among many other conditions. Banana Cream buds have piecey flat neon green nugs with gold undertones and matching crystal trichomes. Each nug is dotted with dark orange hairs coated in sweet sticky resin.", "effects": ["Body High", "Happy", "Relaxing", "Sociable"], "aromas": ["Earthy", "Nutty", "Sweet"], "flavors": ["Creamy", "Fruity", "Sweet"], "relieves": ["Creamy", "Fruity", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Cream Cake": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-cream-cake", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Banana Cream Cake", "description": "Banana Cream Cake is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the potent Banana Kush X Cheese Cake strains. Named for its super delicious flavor, Banana Cream Cake packs everything any indica lover dreams of and more into each tasty little toke. Like its name suggests, Banana Cream Cake has a super sweet and doughy creamy banana flavor with a lovely sugary exhale. The aroma is very similar, although it does have a touch of spicy earthiness to it, too, that's released as the nugs are burned away. The Banana Cream Cake high hits you almost as soon as you exhale, working its way immediately into your brain with lightning-fast energy and creativity. This quickly turns heady, leaving you hazy, unfocused and pretty happy about it. You'll find yourself fading in and out of giggly episodes, laughing at anything and everything around you. This is accompanied by a lightly stoney body high that keeps your physical form totally relaxed. Combined with its high 21-22% average THC level and 0-1% CBD level, these effects make Banana Cream Cake a great choice for treating chronic pain, depression, nausea or appetite loss, chronic stress or anxiety and chronic fatigue. This bud has thick grape-shaped minty green nugs with sparse thin orange hairs and a coating of tiny, amber-tinted white crystal trichomes.", "effects": ["Energizing", "Giggly", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Creamy", "Earthy", "Spicy", "Sweet"], "flavors": ["Creamy", "Fruity", "Sugary", "Sweet"], "relieves": ["Creamy", "Fruity", "Sugary", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Crush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-crush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-crush/hcdqa87q/03e65408-e095-449e-af3c-f5225188ff10jpe.jpg?t=f8f86e8b1f06e1e20755fc2aa1ddd0cc4e33e9c6e8d4d54fd145f15c4e178845", "name": "Banana Crush", "description": "Banana Crush is a rare slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the infamous Banana Kush X Orange Crush strains. Looking for the ultimate fruity banana flavor? You've totally found it with Banana Crush. This delicious bud packs a super tasty sweet fruity banana flavor with a slightly sour citrusy exhale. The aroma follows the same profile, with a lightly earthy overtone that's accented by sweet tropical fruits and spices. The Banana Crush high is just as delicious as the flavor, with well-balanced and long-lasting effects that are perfect for a lazy night in when you want to eventually get to sleep. You'll feel lifted at the onset of the high with a sense of euphoria and creativity washing over you. A relaxing body high comes next, creeping over you in warming waves with a light tingly effect that quickly turns sedative. Thanks to these effects and its high 22% average THC level, Banana Crush is said to be perfect for treating those suffering from conditions such as chronic pain, Bipolar Disorder, depression, headaches or migraines, insomnia, and chronic stress or PTSD. This bud has tight dense grape-shaped dark olive green nugs with lots of thin amber hairs and a frosty coating of tiny amber crystal trichomes.", "effects": ["Body High", "Creative", "Euphoria", "Happy", "Relaxing", "Sleepy"], "aromas": ["Citrus", "Earthy", "Herbal", "Sour", "Sweet", "Tropical"], "flavors": ["Citrus", "Fruity", "Sour", "Sweet", "Tropical"], "relieves": ["Citrus", "Fruity", "Sour", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Daddy": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-daddy", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-daddy/SvEyt19f/100-cjpg.jpg?t=34d65228aedb89a759cf0065c2804afe4db9194d5992d833bcdc7e39738dcbf3", "name": "Banana Daddy", "description": "Banana Daddy is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the infamous Granddaddy Purple X Banana Hammock strains. Best known for its notable banana flavor and super giddy high, Banana Daddy will have you head over heels after just one toke. Like its name suggests, Banana Daddy packs a sweet banana berry flavor that's accented by a touch of spicy bubblegum and diesel. The aroma takes a heavier turn, with deep diesel and sweet fruity berries all wrapped up with a spicy overtone. The Banana Daddy high hits you almost as soon as you exhale, smacking immediately between the eyes and knocking away any negative or racing thoughts. You'll feel giggly and lifted, unable to focus on much of anything but still able to carry on extended conversations with those around you with ease. With these effects and its super high 25-30% average THC level and 1-3% CBD level, Banana Daddy is often chosen to treat those suffering from conditions such as chronic stress, appetite loss or nausea, chronic fatigue, insomnia and chronic pain. This bud has oversized chunky purplish spade-shaped nugs with dark purple undertones, matching leaves and a coating of purple-tinted white crystal trichomes.", "effects": ["Body High", "Giggly", "Relaxing", "Sleepy", "Sociable", "Uplifting"], "aromas": ["Diesel", "Earthy", "Fruity", "Grape", "Spicy", "Sweet"], "flavors": ["Berry", "Flowery", "Fruity", "Grape", "Sweet"], "relieves": ["Berry", "Flowery", "Fruity", "Grape", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Fig": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-fig", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-fig/28nTLnH8/43jpg.jpg?t=bf89a1fa8d2fe1362614fed10cf0ecfbf69e8c03025b952ca0c082e3ebeb8c3d", "name": "Banana Fig", "description": "Banana Fig is an indica dominant hybrid strain created through crossing the delicious Purple Fig X Banana Split strains. Named for its parentage and its super delicious flavor, Banana Fig is perfect for any indica lover. In fact, it took home the award for Best Indica at the High Times Cannabis Cup in 2017. This bud has a super sweet banana and fig flavor with light touches of sour lemon upon exhale. The aroma is of earthy pine with a sour citrus overtone that's accented by a notable kick of sweet banana. The Banana Fig is just as delicious, with relaxing and lifting effects that boos the spirits while filling you with a sense of comfy happiness. You'll feel a calm wash over your entire being from head to toe, easing aches and pains will gently pushing away negative or racing thoughts. Combined with its super high 22-23% average THC level, Banana Fig is often chosen to treat conditions such as appetite loss or nausea, depression, chronic stress or anxiety, PTSD and chronic pain. This bud has oversized fluffy hand-shaped dusty green nugs with deep purple undertones, thin orange hairs and a coating of sandy amber crystal trichomes.", "effects": ["Calming", "Hungry", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Earthy", "Fruity", "Pine", "Sweet"], "flavors": ["Citrus", "Fruity", "Lemon", "Sour", "Sweet"], "relieves": ["Citrus", "Fruity", "Lemon", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Fire Cookies": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-fire-cookies", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-fire-cookies/c43sjU5g/banana-fire-cookiesjpeg.jpg?t=2ba7d0ae731ce05cf76847cc74ae99e0d111724e0ff2e77ff87233af54a118ee", "name": "Banana Fire Cookies", "description": "Banana Fire Cookies is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic Banana Fire OG Kush X Fire Cookies strains. This celebrity child boasts a super heavy high that will have your mind feeling boosted and your body feeling rested in no time at all. You'll feel the cerebral effects hit you first as you're filled with a lifted sense of happy sociability and creativity. You'll find that conversations come easily in this state as you are filled with euphoric thought and artistic inspiration. A soothing body high accompanies this heady state, helping your physical form to stay anchored and relaxed. Thanks to these effects and its super high 20-25% average THC level, Banana Fire Cookies is often chosen to treat those suffering from conditions such as chronic pain, appetite loss or nausea, chronic stress or anxiety and cramps or muscle spasms. This bud has a sweet and fruity banana candy flavor with a nutty cookie exhale. The aroma is very similar, with a heavily banana overtone accented by sweet fruity cherries and a hint of nutty earthiness. Banana Fire Cookies buds have small rounded forest green nugs with thin orange hairs and tiny white crystal trichomes dripping with sweet sticky resin.", "effects": ["Calming", "Creative", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Earthy", "Nutty", "Sour", "Sweet", "Tree Fruit"], "flavors": ["Candy", "Cherry", "Fruity", "Sweet", "Tree Fruit"], "relieves": ["Candy", "Cherry", "Fruity", "Sweet", "Tree Fruit"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Fire OG": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-fire-og", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Banana Fire OG", "description": "Banana Fire OG, also known as “Banana Fire” or “Banana Fire OG Kush,” is a slightly indica dominant hybrid strain (65% indica/35% sativa) created through crossing the classic Banana OG X Fire OG BX2 strains. The perfect soothing indica, Banana Fire OG brings on effects that will burn away any aches or pains and leave you fully relaxed from head to toe. The high is definitely a creeper, sneaking up on you about 5-10 minutes after you exhale, lifting your mind and filling you with a sense of pure happiness and ease. Your mind will settle into a lightly unfocused state of calm that is free of any racing thoughts or negative emotions. A relaxing body high comes next, creeping up on you and leaving you feeling fully couch-locked and ready to really relax and get to sleep. In combination with its high 15-23% average THC level, these effects make Banana Fire OG perfect for treating chronic pain, insomnia, depression or mood swings and chronic stress. Banana Fire OG has a spicy and sour sugary citrus candy flavor that tingles on the tongue and opens the sinuses. The aroma is of earthy tropical fruits with a super sour effect that intensifies as the nugs are burned away. Banana Fire OG buds have fat dense popcorn-shaped emerald green nugs with blue undertones, reddish-orange hairs and a coating of tiny frosty white crystal trichomes.", "effects": ["Euphoria", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Fruity", "Sweet", "Tropical"], "flavors": ["Citrus", "Sour", "Sugary", "Sweet", "Tropical"], "relieves": ["Citrus", "Sour", "Sugary", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Frost Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-frost", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-frost/5852/rpzy0skmgaazxzwmmkvc.jpg?t=58cbde2bfc793b736533fb0224a31d114b5e64d9898f5106cf627e862bf566da", "name": "Banana Frost Kush", "description": "Banana Frost Kush is a mellow indica-dominant hybrid (75% indica/25% sativa) that boasts a THC level ranging from 12-15% on average. This dank bud has unknown genetics, as its breeders mysteriously keep it a secret. However, many cannabis critics believe that it is a phenotype of the infamous Banana OG Kush strain and, perhaps, a little mix of the popular Jack Frost strain. Banana Frost Kush has a slight pleasant banana aroma and flavor that is often compared to smoking a dried sugar coated banana peel. When smoking this bud, patients describe the high as a mellow introspective one that gives you a full-body stoned feeling and intense couch lock. This stoned feeling is often accompanied by a mellow buzz, typical of a sativa and sativa-dominant hybrid strain. The high is very potent, lasting 2-3 hours on average, and is very balanced, making it ideal for steady pain relief. Because of this, Banana Frost Kush is often used to treat chronic pain and muscle spasms, as it relaxes the entire body. This bud has fluffy, light minty green nugs that are very dense and completely frosted in glittering white crystals and dripping in sweet, syrupy resin.", "effects": ["Body High", "Relaxing", "Sleepy"], "aromas": ["Banana", "Fruity", "Sweet"], "flavors": ["Fruity", "Nutty", "Sugary", "Sweet"], "relieves": ["Fruity", "Nutty", "Sugary", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana God": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-god", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-god/E4Lns3uy/banana-godjpg.jpg?t=41fa8d95897cb7f03866bcc01e83d8b7b47819f411fa33091cfc668815117654", "name": "Banana God", "description": "Banana God is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the delicious Banana Kush X God's Gift strains. If you're a fan of either of its parent strains, Banana God is going to be right up your alley. This bud packs a super delicious banana flavor with a long-lasting high that will leave you totally kicked back and at ease for hours on end. You'll feel a light lift at the onset of the high as well as an influx of sociability that has you chatting with anyone and everyone around you. As your mind lifts, your body will settle into a deep physical relaxation that won't cause sedation, but rather will leave you totally calm. With these effects and its high 17-23% average THC level, Banana God is often chosen to treat those suffering from conditions such as mood swings, chronic stress, depression, chronic fatigue, ADD or ADHD, and chronic pain. Banana God buds have a sweet tropical pineapple flavor with a hint of sour citrus and fresh banana. The aroma is very herbal and tropical with a banana citrus overtone that's accented by earthy pine and spices. Banana God buds have piecey rounded light green nugs with thin long orange hairs and a coating of frosty tiny bright white crystal trichomes.", "effects": ["Creative", "Focus", "Relaxing", "Sociable"], "aromas": ["Citrus", "Herbal", "Pine", "Sour", "Sweet", "Tropical"], "flavors": ["Citrus", "Pine", "Sour", "Sweet", "Tropical"], "relieves": ["Citrus", "Pine", "Sour", "Sweet", "Tropical"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Hammock": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-hammock", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-hammock/4FbVumzb/15886303668364942753844647178931jpg.jpg?t=0ad92e937171feae32b2733f26c78e638e92e6641ba0fe3376bedba01783d2d3", "name": "Banana Hammock", "description": "Banana Hammock, also known as “Banana Hammock R1,” is a rare indica dominant hybrid strain created through crossing the infamous Grape God X Mandarin Sunset strains. Funny name aside, Banana Hammock is a patient favorite thanks to its super delicious flavor and happy effects. This bud has as sweet and sugary honey taste with accents of tropical fruits and sour lime. The aroma is just as delightful, following the same profile with added touches of fresh earth. The Banana Hammock settles in soon after your final toke, hitting the mind first before spreading its tingly sense of calm throughout the body. You'll feel lifted and relaxed with a sense of euphoria that immediately erases any negative or racing thoughts. A soothing body high comes next, settling you into a state of pure physical calm and ease. With these effects and its super high 22-27% average THC level, Banana Hammock is often recommended for experienced patients suffering from conditions such as insomnia, chronic stress or anxiety and depression or mood swings. This bud has super thick elongated pepper-shaped deep olive green nugs with rich purple undertones, bright orange hairs and a coating of thick and chunky frosty white crystal trichomes.", "effects": ["Body High", "Calming", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Diesel", "Earthy", "Fruity", "Sour"], "flavors": ["Grape", "Honey", "Sugary", "Sweet", "Tropical"], "relieves": ["Grape", "Honey", "Sugary", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Haze": {"url": "https://www.allbud.com/marijuana-strains/sativa/banana-haze", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-haze/KKKisqJL/16547172227817693144674987391558jpg.jpg?t=efca6ccffe16bc0d1d68150b51bee6d20da1563d3836fad4da4de8f03ed47972", "name": "Banana Haze", "description": "Banana Haze is a rare 100% pure sativa strain created through crossing the infamous Super Silver Haze X Banana strains. This delicious celebrity child packs a mouthwatering flavor and a super hazy high into each and every toke, making it perfect for any sativa lover who appreciates a good haze. The high starts with a subtle lift in the back of the mind, filling you with a sense of happiness and ease that immediately ushers out any negative or racing thoughts. A subtle tingle comes next, filling the back of your head before spreading its reach throughout your entire body, leaving you feeling amped up and energized although totally relaxed physically. With these full-bodied effects and its high 20-22% average THC level, Banana Haze is said to be the perfect choice for treating those with inflammation, chronic pain, gastrointestinal disorders, and appetite loss. This bud has a super sweet and fruity flavor with a touch of haze and an overpowering mouthful of banana. The aroma is of earthy bananas and spicy haze with a light pungency to it, too. Banana Haze buds have small and dense cone-shaped bright neon green nugs with sparse orange hairs and a thick coating of frosty bright white crystal trichomes.", "effects": ["Body High", "Energizing", "Hungry", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Earthy", "Fruity", "Herbal", "Spicy", "Sweet"], "flavors": ["Fruity", "Herbal", "Spicy", "Sweet"], "relieves": ["Fruity", "Herbal", "Spicy", "Sweet"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Kola": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/banana-kola", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-kola/7Z95B8An/banana-kolajpg.jpg?t=6dc209666a7091b22d59d0b74672d9a9f166ef07dddc6335d78bdc7555c82e7d", "name": "Banana Kola", "description": "Banana Kola is a super rare sativa dominant hybrid strain created through a powerful cross of (Kandahar Province Landrace Afghani X Takhar Province Landrace Afghani) X Cherry Kola. When it comes to delicious banana flavors, nothing beats Banana Kola. This bud has a mouthwatering taste of rich bananas and sweet cherries with a fruity spicy overtone that has a touch of herbs upon exhale. The aroma is of fresh fruity earth and spices with a notable punch of ripe banana and berries. The Banana Kola high is just as delicious as the flavor, with lifted and clear-headed effects that are perfect for those days when you need a little extra oomph to get you up off the couch and fully moving. You'll feel lifted with a sense of clarity and euphoria that doesn't cause anxiety or paranoia in the slightest. Thanks to these effects and its high 22-23% average THC level, Banana Kola is often chosen to treat those suffering from conditions such as depression, chronic stress, migraines or headaches, chronic fatigue, and mood swings. This bud has super sticky dense and lumpy popcorn-shaped forest green nugs with bright yellow-green undertones, vibrant orange hairs, and a coating of sparkling golden crystal trichomes.", "effects": ["Cerebral", "Euphoria", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Cherry", "Earthy", "Fruity", "Herbal", "Pungent"], "flavors": ["Cherry", "Fruity", "Herbal", "Spicy", "Sweet"], "relieves": ["Cherry", "Fruity", "Herbal", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana MAC": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-mac", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-mac/l0Jc8EOk/20211116_202812jpg.jpg?t=07a6e2fd647bdde40ceba191e9f0fe28734c0918b1b90792f0a0862f4a910039", "name": "Banana MAC", "description": "Banana MAC, also known as “BananaMiracle Alien Cookies,” is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the delicious Banana Kush X Miracle Alien Cookies (MAC) strains. When it comes to flavor, this bud's name says it all. Banana MAC packs a sweet nutty banana cookie flavor with a rich tropical nutty exhale. The aroma is just as delicious, with a sweet banana overtone that's accented by nutty herbs and spices. The Banana MAC high isn't quite as bright as the flavor, with relaxing effects that are best suited for an evening spent at home rather than out and about. You'll feel the high build slowly, filling you with a growing happiness that slowly pushes out any negative or racing thoughts with ease. As your mind reaches new heights of happy creativity, a sense of calm will spread throughout your physical form, anchoring you to the couch and leaving you fully immovable for hours on end. With these long-lasting effects and its high 22-26% average THC level, Banana MAC is often chosen to treat those suffering from conditions such as insomnia, mood swings, depression, chronic stress, nausea or appetite loss and chronic pain. This bud has spade-shaped long blueish-green nugs with dark leaves, yellow-orange hairs and a coating of frosty tiny golden amber crystal trichomes.", "effects": ["Calming", "Happy", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Nutty", "Pineapple", "Sour", "Tropical"], "flavors": ["Citrus", "Fruity", "Pineapple", "Sour", "Sweet", "Tropical"], "relieves": ["Citrus", "Fruity", "Pineapple", "Sour", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Milkshake OG": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-milkshake-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-milkshake-og/Pi9G8LG5/strawbeey-diseljpeg.jpg?t=90232283dd28b5375f8a3ad90ef088df2535a7f4e31532e94e3e9450798aad66", "name": "Banana Milkshake OG", "description": "Banana Milkshake OG, also known as “Banana Milkshake OG Kush,” is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the delicious [(Banana OG X Cherry Pie) X Strawberry Diesel] X Predator OG strains. When it comes to the flavor of this lovely lady, the name says it all. Banana Milkshake OG packs a sweet and fruity banana berry flavor with a creamy vanilla cherry exhale. The aroma is very similar, with an intoxicating creamy banana overtone accented by fresh berries, earthy woods and sugary vanilla. The Banana Milkshake OG high is one for the ages, with a unique combination of energizing cerebral effects and sedative physical effects. Your mind will feel activated from start to finish with this bud, filled with a sense of creative energy and focus that gets your mental gears turning in no time at all. While your mind clears, your body will settle into a heavy and hazy state of sedation that's filled with deep relaxation and an eventual case of couchlock. Thanks to these effects and its high 20% + average THC level, Banana Milkshake OG is often chosen to treat those patients who are suffering from conditions such as chronic pain, inflammation, depression or mood swings and chronic stress. This bud has dense and tight spade-shaped olive green nugs with deep purple undertones, dark orange hairs and tiny amber crystal trichomes.", "effects": ["Body High", "Calming", "Creative", "Energizing", "Giggly", "Happy", "Relaxing", "Uplifting"], "aromas": ["Cherry", "Creamy", "Earthy", "Pine", "Strawberry", "Sweet", "Vanilla", "Woody"], "flavors": ["Berry", "Cherry", "Creamy", "Fruity", "Sweet", "Vanilla", "Woody"], "relieves": ["Berry", "Cherry", "Creamy", "Fruity", "Sweet", "Vanilla", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Mochi": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-mochi", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-mochi/tAol7TLj/92-cjpg.jpg?t=f829611e5b9ace6ab4c77e2a9d344afa2b3286f0791ebe93eb8311ffbf5ab23c", "name": "Banana Mochi", "description": "Banana Mochi is a rare slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the delicious Banana Kush X Mochi strains. Love a great banana flavor in your buds? This strain is made for you - Banana Mochi packs a super sweet and slightly nutty banana flavor with hints of berries to it, too. The aroma is just as delicious, with a slightly sour earthy effect that's released as the nugs are broken apart and burned away. The Banana Mochi high has a creeping effect, slowly building before taking you by surprise. You'll feel a light tingle in the back of the head and neck that soon spreads throughout the rest of your mind, leaving you feeling undeniably euphoric with a high-flying effect. You'll feel an influx of creativity come next, lending itself well to conversation with those around you. A deeply relaxing physical high comes next, dropping you into a state of pure sedation that can leave you dozing before you know it. With these effects and its super high 22%+ average THC level, Banana Mochi is often chosen to treat conditions such as chronic pain, depression, insomnia, chronic stress and nausea or appetite loss. Banana Mochi buds have fat small rounded forest green nugs with yellow-orange hairs and a coating of tiny blue-green white tinted crystal trichomes.", "effects": ["Creative", "Euphoria", "Hungry", "Relaxing", "Sleepy", "Tingly"], "aromas": ["Berry", "Earthy", "Nutty", "Sour", "Spicy", "Sweet"], "flavors": ["Berry", "Fruity", "Nutty", "Sweet"], "relieves": ["Berry", "Fruity", "Nutty", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Pie": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-pie", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-pie/CWg6bJL1/15601447422712074678312798285641jpg.jpg?t=5424895b2828f92e87c4e31b9e145a0b55bf4a806f6fed96a58b95fa1b3c57f0", "name": "Banana Pie", "description": "Banana Pie is a rare indica dominant hybrid strain (75% indica/25% sativa) created through crossing the classic Banana Kush X Cherry Pie strains. When it comes to the flavor department, this bud takes the cake (or pie). Banana Pie packs a sweet cherry berry flavor with hints of fresh bananas and nuttiness upon exhale. The aroma is much like a spicy banana muffin, with hints of pungent earth and spices as the nugs are burned. The Banana Pie high is very lifted and relaxing in nature, perfect for those nights when you just want to kick back with friends and not have a care in the world. The high starts with a euphoric lift that fills your mind with a sense of happiness and an eagerness to engage in conversation with those around you. You'll feel totally relaxed throughout the duration of the high and slightly giggly at times. With these effects and its high 14-26% average THC level, Banana Pie is said to be perfect for treating conditions such as depression, chronic stress, migraines or headaches, chronic fatigue, and nausea or appetite loss. This bud has fluffy airy bright neon green nugs with dark amber hairs and coating of frosty golden amber crystal trichomes.", "effects": ["Euphoria", "Giggly", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Berry", "Earthy", "Fruity", "Herbal", "Pungent", "Spicy"], "flavors": ["Berry", "Cherry", "Fruity", "Herbal", "Spicy", "Sweet"], "relieves": ["Berry", "Cherry", "Fruity", "Herbal", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Pineapple Express": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-pineapple-express", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-pineapple-express/Mnq34cec/20190409_124231jpg.jpg?t=319cf9d72b1dbbd36080969257e4ed5549cd1271ba20ca0b46c0439ae845d4e4", "name": "Banana Pineapple Express", "description": "Banana Pineapple Express is a rare evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic Banana OG X Pineapple Express strains. When it comes to the flavor department, this bud has it all – rich tropical fruits, sweet bananas and berries, heavy pungent pine, you name it. The aroma follows a pungent earthy overtone, with fresh spicy berries and sweet herbs and tropical fruits dancing through it. The Banana Pineapple Express high is just as addictive as this flavor, with long-lasting cerebral effects that are perfect for when you need a little lift but don't have too much to get done. You'll feel lifted with an influx of creativity throughout the duration of the high, giving you the edge that you need to knock out any artistic undertakings. This is accompanied by a deeply relaxing body high that won't cause sedation but rather will keep you physically pain-free as your mind expands. Thanks to these effects and its high 22-26% average THC level, Banana Pineapple Express is said to be perfect for treating conditions such as depression, appetite loss, arthritis, and muscle spasms or cramps. This bud has oversized airy bright neon green nugs with yellow amber hairs and a coating of golden amber crystal trichomes.", "effects": ["Body High", "Cerebral", "Creative", "Relaxing", "Uplifting"], "aromas": ["Berry", "Blueberry", "Earthy", "Herbal", "Pungent", "Spicy", "Sweet"], "flavors": ["Berry", "Fruity", "Herbal", "Pine", "Sweet"], "relieves": ["Berry", "Fruity", "Herbal", "Pine", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Purp": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-purp", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-purp/xO6ygssW/16213590717324897400743364959491jpg.jpg?t=95969845044d76adde921036f5b8ddd9cbc4c4d8c9c10a99204582a2faf94550", "name": "Banana Purp", "description": "Banana Purp is a rare indica dominant hybrid created through a cross of the delicious Banana Kush X Granddaddy Purple strains. This bud brings on the delicious purple flavors and effects, blending them with kush and a touch of banana for a truly delicious high. Banana Purp has a fresh spicy kush taste with hints of grape and berry. The aroma is very dank and earthy with a musky grape overtone accented by sweet banana and other tree fruits. Like its Granddaddy Purple parent, Banana Purp has dark forest green nugs with rich purple undertones and a coating of frosty whit crystal trichomes that look slightly lavender in the right light. The Banana Purp high is very relaxing and lifted in nature, filling both mind and body with happy effects. You'll feel a euphoric onset a few minutes after toking that creeps up and takes hold, launching your mind into hazy spacey bliss. As this effect builds, a slightly sedative sleepy effect will wash over your body, lulling you into a slightly couch-locked state that's totally relaxing. Thanks to these effects and its moderate THC level, Banana Purp is said to be perfect for trating conditions such as chronic pain, depression, chronic stress or anxiety, and muscle spasms or inflammation.", "effects": ["Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Dank", "Earthy"], "flavors": ["Fruity", "Spicy", "Sweet"], "relieves": ["Fruity", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Split": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/banana-split", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-split/nPJ44tcj/20201006_215242jpg.jpg?t=950ef7006a324d5306615f4618436c133074b7d1b992a8a5bc93c75791ffadbf", "name": "Banana Split", "description": "Banana Split is a slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the infamous Tangie X Banana Sherbet strains. If you're after an insanely delicious flavor and a long-lasting high, you've found it with Banana Split. This lovely lady packs a super delicious sweet fruity cherries and cream flavor into each and every high-powered toke. The aroma follows the same profile, with a lightly tropical overtone that's accented by sour citrus and heavy cream. The Banana Split high is just as delectable as the flavor, with effects that are perfect for a lazy day when you need to get up and moving but don't have much of anything to really accomplish. It starts with a subtle lift, boosting your mood and leaving you feeling totally euphoric with a sense of cerebral energy and motivation. This is accompanied by a deeply relaxing body high that fills your entire being with a sense of calm without causing sedation or sleepiness in the slightest. Thanks to these effects and its high 22-25% average THC level, Banana Split is said to be perfect for treating conditions such as chronic stress, depression, chronic pain, inflammation, and chronic fatigue. This bud has oversized grape-shaped olive green nugs with bright yellow-orange hairs and a coating of amber crystal trichomes.", "effects": ["Energizing", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Cherry", "Earthy", "Lemon", "Sour", "Spicy", "Tropical"], "flavors": ["Citrus", "Creamy", "Fruity", "Sour", "Sweet", "Tropical"], "relieves": ["Citrus", "Creamy", "Fruity", "Sour", "Sweet", "Tropical"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Split Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-split-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-split-kush/MKRrV8se/20180101_143202jpg.jpg?t=fe0d0916f52b0428a25c8ecf799b865d655fa1e155f5923aad914b69cf093012", "name": "Banana Split Kush", "description": "Banana Split Kush is an indica dominant hybrid strain created through crossing the classic OG Kush with the delicious Banana strain. With a super heavy average THC level that typically hits about 25% and sedative full-bodied effects, Banana Split Kush is one tasty treat that is sure to please any indica lover. The Banana Split Kush high comes on quickly with a building sense of relaxation. You'll feel it first in the back of your neck and head before it spreads throughout the rest of your body in warming waves. This state quickly becomes sedative and soon drops you into a state of sleepy couch-lock. Hunger often comes soon after, so make sure you have some snacks within reach! Thanks to these effects and its powerful THC level, Banana Split Kush is said to be perfect for treating conditions such as chronic pain, appetite loss, insomnia, and depression. Banana Split Kush buds have a sweet flavor of bananas and kush with an aroma of pungent fruit accented by a super dank effect that's released as the nugs are burned. Banana Split Kush buds have leafy dusty green nugs with clear hairs and a coating of tiny clear crystal trichomes.", "effects": ["Hungry", "Relaxing", "Sleepy"], "aromas": ["Dank", "Fruity", "Pungent"], "flavors": ["Fruity", "Herbal", "Sweet"], "relieves": ["Fruity", "Herbal", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Tangie": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-tangie", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-tangie/5RQSFzPL/banana-tangiejpg.jpg?t=ed564ad0217e27cd36b34264e6e09c5432801f1aa2acba8d06e77b570e1ec4f9", "name": "Banana Tangie", "description": "Banana Tangie, also known as “Banangie,” si a rare slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the infamous Banana Kush X Tangie strains. This bud packs an insanely mouthwatering flavor, with tastes of rich banana and fresh sharp citrus that fill your lungs with each inhale. The aroma is earthy and tropical with a sour lemony effect that's accented by fresh banana and dank. The Banana Tangie high is just as delicious as the flavor, with lifting effects that are perfect for a lazy day spent doing not much of anything at all. The high comes on with a rushing effect that builds in the back of your head, pushing out any negative or racing thoughts and replacing them with pure happiness and motivation. You'll feel a light increase in energy that soon turns relaxing, leaving you physically at ease and slightly couch-locked at times. With these potent effects and its high 22% average THC level, Banana Tangie is often chosen to treat conditions such as chronic fatigue, depression, migraines or headaches, and chronic stress. This bud has fluffy grape-shaped forest green nugs with thin twisty orange hairs and a coating of golden amber crystal trichomes.", "effects": ["Cerebral", "Energizing", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Pungent", "Sour"], "flavors": ["Citrus", "Fruity", "Skunky", "Sweet"], "relieves": ["Citrus", "Fruity", "Skunky", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Treat": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/banana-treat", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-treat/5853/ijrqfqgkjxsj9sc6ozga.jpg?t=63d303580e0846e07bc491c7b05f9ff5a308bda0dfe1e5346132fea623d90b42", "name": "Banana Treat", "description": "Banana Treat is an extremely rare sativa dominant hybrid strain created through crossing the infamous Banana Kush X Dutch Treat strains. If you love a sweet flavored bud and even sweeter head-heavy effects, Banana Treat is one anytime-of-the-day dessert you won't want to skimp on! Banana Treat is said to have a sweet fruity flavor accented by rich caramel and fresh banana with just a touch of earth. The aroma is very earthy with a hint of sweet kush and fruits with just a drizzle of candy and caramel. Banana Treat buds have long bright neon green nugs with fiery orange hairs and a coating of chunky oversized golden-hued crystal trichomes. The Banana Treat high is just as amazing as its taste with uplifted and energetic effects that are perfect for fueling your daytime adventures and giving a happy mood boost on a day you're feeling down. The high starts with a euphoric lift that leaves you feeling motivated and uplifted with a slight influx of energy. These effects won't overwhelm you but will rather leave you feeling calm and completely at ease, ready for anything that comes your way. With these effects and its high 16-18% average THC level, Banana Treat is said to be ideal for treating conditions such as fatigue, depression, irritability, and migraines or headaches.", "effects": ["Body High", "Cerebral", "Motivation", "Uplifting"], "aromas": ["Banana", "Earthy", "Kush", "Pungent", "Sweet"], "flavors": ["Caramel", "Citrus", "Fruity", "Sweet"], "relieves": ["Caramel", "Citrus", "Fruity", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana WiFi": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-wifi", "img": "https://media.allbud.com/resized/350x242/media/feature/strain/banana-wifi.jpg?t=4987912948ec6a36dfcf776b5e85688a3c3ccf1ccfeef00f15eaa37959e4ac25", "name": "Banana WiFi", "description": "Banana WiFi, also known as “WiFi Banana,” is a slightly indica dominant cross of the insanely powerful White Fire OG X Banana Kush strains. This dank bud flawlessly fuses the effects of both of its parent strains for a body heavy high that will leave you craving more. The high hits you first with a creeping heaviness that's not too debilitating, but rather will leave you completely relaxed and at ease. This slight body stone is accompanied by a building sense of happiness that calms the mind and erases any racing thoughts. These effects make Banana WiFi ideal for treating patients suffering from conditions such as chronic pain, depression, muscle spasms, and stress. Although the THC and CBD levels of this bud are largely unknown due to its rarity, it is thought to be decently potent because of its strong parentage. This bud has a flavor of freshly picked earthy bananas and an aroma of earthy woody bananas and dank kush. Banana WiFi buds have small round popcorn shaped light minty green nugs with a thick layer of thin golden hairs and thick chunky gold trichomes. These nugs are slightly sticky when pulled apart, dripping with syrupy resin.", "effects": ["Happy", "Relaxing", "Uplifting"], "aromas": ["Banana", "Dank", "Earthy", "Fruity", "Kush", "Sweet", "Woody"], "flavors": ["Pine", "Sweet", "Tropical"], "relieves": ["Pine", "Sweet", "Tropical"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bandit Breath": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bandit-breath", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bandit-breath/FAcBgfeh/15834245265979158916238390048900jpg.jpg?t=e75cab6ca7949cdd9bb5d745c26bbd3393dfcc2f1d3c79588d636e0624d36fd9", "name": "Bandit Breath", "description": "Bandit Breath is a rare indica dominant hybrid strain (70% indica/30% sativa) created through a cross of the powerful Stardawg X OG Kush Breath strains. When it comes to heavy flavors, Bandit Breath takes the win. This bud has a super skunky and nutty chemical flavor with a sweet pungent exhale that lingers long after you finish toking. The aroma follows the same profile, although with a spicy and sour herbal effect that's amplified as the nugs are burned. The Bandit Breath high rushes into your mind mere minutes after your final toke, stealing away any negative or racing thoughts and replacing the with lifted euphoria. While your mind is stolen away, you'll start to feel a slightly giggly effect settle in, with stoney unfocused bliss throughout. Your body will be fully relaxed for the duration of this high, which can leave you feeling sedated and pretty sleepy at times. With these effects and its high 27-28% average THC level, Bandit Breath is perfect for treating conditions such as chronic pain, depression, chronic stress or anxiety, nausea, and mood swings. This bud has popcorn-shaped olive green nugs with dark orange hairs and a thick frosty coating of chunky bright white crystal trichomes.", "effects": ["Energizing", "Euphoria", "Giggly", "Relaxing", "Sleepy"], "aromas": ["Chemical", "Earthy", "Herbal", "Pungent", "Skunky", "Sour"], "flavors": ["Chemical", "Herbal", "Skunky", "Sweet"], "relieves": ["Chemical", "Herbal", "Skunky", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bangi": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/bangi", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bangi/kEwBbvsF/bangijpg.jpg?t=a55d87b4feb50af21b4bad5fef67237d9f32e0de44b8e74ae855772e8aaf939c", "name": "Bangi", "description": "Bangi, also known as “Bangi Haze,” is a sativa dominant hybrid strain (70% sativa/30% indica) created through crossing the infamous Congo X Nepalese strains. This bud is a combination of two classic strains, bringing a head-heavy high that's perfect for getting lifted before you drop off into a deep and peaceful sleep. You'll feel a light lift at the onset of the high, filling you with a sense of euphoria and creative energy that lends itself well to mental tasks. A relaxing body high comes next, washing over you in warming waves and lulling you into a state of pure blissful sedation and long-lasting sleepiness. With these well-rounded and potent effects and its high 15-20% average THC level, Bangi is said to be perfect for treating those suffering from conditions such as multiple sclerosis, chronic fatigue, depression, anorexia or appetite loss, chronic pain and chronic stress. Bangi has a classic lemon and anise flavor with a lightly hashy skunky exhale. The aroma takes a pungent and fruity turn, with hash and dank earth complemented by spicy berries and herbs. This bud has compact bright neon green fluffy nugs with thick orange hairs and a coating of thick and frosty purple-tinted crystal trichomes.", "effects": ["Creative", "Energizing", "Euphoria", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Lemon", "Pungent", "Skunky", "Sour"], "flavors": ["Berry", "Fruity", "Lemon", "Skunky", "Sour"], "relieves": ["Berry", "Fruity", "Lemon", "Skunky", "Sour"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banner's Revenge": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/banners-revenge", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banners-revenge/fNs3QvMU/c-15jpg.jpg?t=6d7db59835708c42b0a2dd5081c0926fe8b8db2ada37da74f1967ab408af7329", "name": "Banner's Revenge", "description": "Banner's Revenge, also known as “Bruce Banner's Revenge,” is a slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the classic Bruce Banner X Grimace OG strains. Get ready for Banner to truly have his revenge with this bud – with its super high potency level and potent full-bodied effects, Banner's Revenge will definitely knock you flat out. The high starts with a creeping effect, slipping into both mind and body before launching you into a state of pure lifted euphoria. A tingly body high will settle into your physical form, filling you with a deep sense of relaxation and a touch of couchlock without any sedation. A cerebral creativity will take hold of your mind at the same time, filling you with a sense of mental energy and motivation. Thanks to these effects and its super high 16-28% average THC level, Banner's Revenge is often chosen to treat conditions such as appetite loss or nausea, chronic stress, depression, chronic fatigue, Gastrointestinal Disorders, headaches or migraines and mood swings. This bud has a sweet and spicy herbal berry flavor with a notable hint of strawberries and diesel. The aroma is very similar, with a fruity pungent overtone that intensifies the more that you toke. Banner's Revenge buds have heavy flat bright neon green nugs with lots of thin orange hairs and a thick frosty coating of tiny amber crystal trichomes.", "effects": ["Body High", "Cerebral", "Creative", "Euphoria"], "aromas": ["Berry", "Diesel", "Earthy", "Fruity", "Grape", "Pungent"], "flavors": ["Berry", "Diesel", "Herbal", "Spicy", "Strawberry", "Sweet"], "relieves": ["Berry", "Diesel", "Herbal", "Spicy", "Strawberry", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BaOx": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/baox", "img": "https://media.allbud.com/resized/350x242/media/images/strain/baox/MpvHX5Kf/baoxjpeg.jpg?t=03139d05b2cd51c17ff431975f42ac1b13ed48273cbd9bbca04b0cda5180f037", "name": "BaOx", "description": "BaOx, pronounced like “bay-ox,” is a sativa dominant hybrid strain (70% sativa/30% indica) created through a combination of other unknown hybrid strains. A soothing sativa with lifted effects that will have both mind and body buzzing, BaOx is one bud you'll want to add to your daily rotation. The high starts almost as soon as you exhale, filling your mind with an instant sense of relief. You'll be free of any racing or negative thoughts as your brain expands into happy creativity. You'll be sociable and outgoing, easily carrying on conversations with those around you. A sense of physical calm accompanies this heady lift, helping your body to feel fully relaxed without affecting your energy level in the slightest. Combined with its super low 0-1% THC level and high 9-14% CBD level, these soothing effects make BaOx a great medicinal choice for treating a variety of conditions including chronic stress or anxiety, PTSD, depression or mood swings and bipolar disorder. BaOx has a sweet and fruity blueberry berry flavor with a lightly kushy exhale. The aroma is of fresh blueberries, spicy skunk and earthy herbs. BaOx buds have long pepper-shaped emerald green nugs with thin orange hairs and a coating of frosty white crystal trichomes.", "effects": ["Calming", "Creative", "Euphoria", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Blueberry", "Earthy", "Fruity", "Kush", "Skunky", "Sugary", "Sweet"], "flavors": ["Berry", "Blueberry", "Fruity", "Herbal", "Spicy", "Sweet"], "relieves": ["Berry", "Blueberry", "Fruity", "Herbal", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Barak": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/barak", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Barak", "description": "Barak is an indica dominant hybrid strain (70% indica/30% sativa) created through an unknown combination of other indica dominant hybrids. Named for the infamous Alexander Barak, this bud brings on a lifting and stimulating high that will have you feeling totally relaxed and pain-free in no time at all. It starts with a tingle in the back of the head and neck that slowly works its way through your mental and physical beings, erasing any negative thoughts or aches and pains, replacing them with a sense of calm and ease. This can quickly turn sleepy, leaving you dozing off and on as you start to come down. Thanks to these effects and its high 18-20% average THC level, Barak is said to be perfect for treating conditions such as chronic stress, insomnia, chronic pain, inflammation and appetite loss or nausea. This bud has a spicy herbal coffee flavor with a lightly woody exhale. The aroma is very similar, with a heavily spicy overtone that can turn pungent at times as the nugs are broken apart and burned away. Barak buds have oversized airy bright neon green spade-shaped nugs with thin light amber hairs and a coating of tiny minty white crystal trichomes.", "effects": ["Body High", "Calming", "Relaxing", "Sleepy", "Tingly"], "aromas": ["Coffee", "Earthy", "Spicy", "Woody"], "flavors": ["Coffee", "Herbal", "Spicy", "Woody"], "relieves": ["Coffee", "Herbal", "Spicy", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Barba Piss Cat": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/barba-piss-cat", "img": "https://media.allbud.com/resized/350x242/media/images/strain/barba-piss-cat/eMNBgw0S/barba-piss-catjpeg.jpg?t=bbf6006bc14bda163b99dd85b92cd3b7ea08d5b6320924292abee52072ad6869", "name": "Barba Piss Cat", "description": "Barba Piss Cat is an indica dominant hybrid strain (70% indica/30% sativa) created through an unknown combination of other hybrid strains, although it is known to be related to the classic Cat Piss strain. Don't let its name scare you away – the taste of Barba Piss Cat is actually pretty delicious. It has a sweet and fruity grape berry flavor with a sour and citrusy exhale. On the other hand, the aroma is heavy and chemical with grape-scented ammonia and pungent dank. The Barba Piss Cat high will hit you a few minutes after your final exhale, filling your brain with an almost instant sense of rushing energy. You'll feel your mind activated with happy sociability and a giggly sense that will have you laughing at anything and everything around you. This boosted state will soon turn heady, leaving you feeling calm from head to toe and pretty unfocused, although super happy, too. Thanks to these effects and its high 17-23% average THC level, Barba Piss Cat is often chosen to treat those patients suffering from conditions such as chronic fatigue, depression, chronic stress and headaches or migraines. This bud has fluffy spade-shaped minty green nugs with amber undertones, thin orange hairs and chunky golden-amber crystal trichomes.", "effects": ["Calming", "Energizing", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Berry", "Dank", "Earthy", "Fruity", "Pungent", "Skunky"], "flavors": ["Berry", "Citrus", "Fruity", "Grape", "Skunky", "Sour"], "relieves": ["Berry", "Citrus", "Fruity", "Grape", "Skunky", "Sour"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bart Simpson OG": {"url": "https://www.allbud.com/marijuana-strains/hybrid/bart-simpson-og", "img": "https://media.allbud.com/resized/350x242/media/feature/strain/bart-simpson-og.jpg?t=200221c9d977ca1d6b9c63ed2342302fe0caf194a1e68ef9a92f01e13bc6fbb9", "name": "Bart Simpson OG", "description": "Bart Simpson OG causes a strong buzz that takes over your entire system right after you smoke it. It has a rocky appearance, being a deep green color with hues of brown here and there. The buds of Bart Simpson OG are quite big in size and feel sticky to touch. It has a high THC level that is around 23.6 percent. Its aroma and appearance are quite similar to that of the popular Afghan Goo. It has a rich aroma that is full of earthy flavors. Its taste is quite strong and moist, and its smoke gets straight to your head. The taste is similar to that of hash as well and feels spicy in places. Its aftertaste is quite earthy as well. Bart Simpson OG has psychoactive effects on your body and strongly affects your system. It makes you feel drowsy soon after you smoke it and puts you to a deep sleep as well. It is often reported to cause couch-lock, which is its side effect. This strain is mainly employed for treating neuropathic pain and other pains that are mild to chronic in nature. It can also treat migraines, tumors and nausea.", "effects": ["Body High"], "aromas": ["Earthy", "Hash"], "flavors": ["Hash", "Spicy"], "relieves": ["Hash", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Battle Star": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/battle-star", "img": "https://media.allbud.com/resized/350x242/media/images/strain/battle-star/J6VqQPCQ/18-cjpg.jpg?t=d39513746f5ea5fa96f3c617de6fcdcb08c0f79499729ebe7bbdedd397abd635", "name": "Battle Star", "description": "Battle Star, also known as “Battlestar,” is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the potent Starkiller X Starfighter strains. This celebrity child is the perfect bud for any indica lover who wants a little power behind their medicine. The high comes on fast and hard with a heavy heady effect, launching you into a dreamy and unfocused state of pure relaxation and ease. You'll be flying in and out of creative visions as your mind fades further and further away, leaving you pretty out of touch with reality but totally okay with it. This can quickly turn psychedelic, so beware if you tend to suffer from any sort of anxiety. In combination with its super high 20-28% average THC level, these effects make Battle Star perfect for treating conditions such as insomnia, chronic stress, depression, mood swings and chronic pain. This bud has a spicy sour flavor with hints of licorice and anise. The aroma follows the same profile, although with a right earthy diesel overtone, too. Battle Star buds have fat rounded bright neon green nugs with orange hairs, dark amber undertones and a coating of frosty chunky golden amber crystal trichomes.", "effects": ["Cerebral", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Diesel", "Earthy", "Herbal", "Pungent", "Sour"], "flavors": ["Herbal", "Sour", "Spicy"], "relieves": ["Herbal", "Sour", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bayou": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bayou", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bayou/d43t1sb0/67b201fd-160c-498d-b458-36312cb3b010jpe.jpg?t=1962da5be204c4ac68c2ee03f67ee9a4715c57bb95ae1853778da513b1a1c34c", "name": "Bayou", "description": "Bayou is a rare slightly indica dominant hybrid strain (60% indica/40% sativa) created as a phenotype of the infamous Purple Kush. Ready to take a trip down to the bayou? This insanely gorgeous bud is ready to help get you there with just one toke. Bayou packs a calming, full-bodied high that is perfect for giving you a slight boost when you're feeling down or need a little something to aid in social situations and conversations. The high starts in the head with a subtle lift, filling you with a sense of euphoria and giving you the social energy that you need to jump into conversations with anyone and everyone around you. You'll feel a light sense of calm in your physical form, keeping you anchored as your mind flies through easy conversation and giddy happiness. With these effects and its mellow 1-9% average THC level, Bayou is often said to be perfect for treating those suffering from depression, chronic stress or anxiety, PTSD and chronic fatigue. This bud has a light spicy woody flavor with a hint of rich sweet berries upon exhale. The aroma is of earthy herbs and spices with a lightly ripe berry overtone that sweetens as the nugs are burned. Bayou buds have small and piecey flat forest green nugs with bright orange hairs and a coating of clear crystal trichomes.", "effects": ["Calming", "Relaxing", "Sociable"], "aromas": ["Berry", "Earthy", "Fruity", "Herbal", "Spicy"], "flavors": ["Berry", "Fruity", "Pine", "Spicy", "Woody"], "relieves": ["Berry", "Fruity", "Pine", "Spicy", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bazooka Joe": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bazooka-joe", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bazooka-joe/2174/okotdq0hzkulqgifjwvu.jpg?t=5e53d50c8d8a2f9b6daa659fab69dd04b7b84f83423a864679e511699035769d", "name": "Bazooka Joe", "description": "If this strain brings to mind the popular, rock-hard gum, it's not accident, as Bazooka Joe the marijuana smells and tastes distinctly of bubblegum. There are also sweet candy notes in both the flavor and aroma. The effects are modest, as this strain has THC levels between 13% and 15% in some tests. What it lacks in THC, it definitely doesn't make up for in CBD: That chemical has a concentration of less than 1%, making Bazooka Joe a less-than-ideal choice for seizure disorders. But it's a good choice for novices and patients who haven't toked in a while; the high is easy and fun. This is a sativa-dominant hybrid with a sativa/indica ratio of at least 30:70. That means an energized, euphoric head high with a mood boost and increased sociability. It can be used to treat depression, anxiety, headaches, and insomnia, an effect of the limited indica genes. Bazooka Joe is very popular among those who have tried it, but it isn't widely available. It may show up on medical markets in the American West, but beyond that it's scarce.", "effects": ["Cerebral", "Euphoria", "Happy"], "aromas": ["Bubble Gum", "Candy", "Sweet"], "flavors": ["Bubble Gum", "Candy"], "relieves": ["Bubble Gum", "Candy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BB-8": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bb-8", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bb-8/eqp6gUsj/chem-breathjpg.jpg?t=61ce5dde463f62a4e851124a5613677ab352e04b1cb3d8b93949bb1256a9c5ca", "name": "BB-8", "description": "BB-8, also known as “BB8,” is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the delicious Boo Berry X Chem Breath strains. A great tasting indica with a super stoney high, BB-8 is the perfect choice for any lazy evening spent at home. You'll feel the effects wash over you, lifting your mind into a giddy cerebral state that's unfocused and insanely euphoric. You'll find yourself falling in and out of fits of the giggles, laughing at anything and everything around you. As your mind settles into this stoney state, a relaxing body high will take down your body, leaving you feeling a bit couch-locked and pretty immovable, although not entirely sedated. With these effects and its high 17-18% average THC level and 0-1% CBD level, BB-8 is often chosen to treat a variety of conditions including mood swings or depression, chronic stress and headaches or migraines. This bud has a sweet and fruity berry cherry flavor with a light touch of sour citrusy lemons and herbs. The aroma is very similar, with a sweet and sour citrusy lemon taste accented by fruity berries and a punch of spicy chemicals. BB-8 buds have dense and small grape-shaped dark olive green nugs with deep purple undertones, pinkish-orange hairs and a coating of tiny, pink-white crystal trichomes.", "effects": ["Body High", "Cerebral", "Giggly", "Happy", "Relaxing", "Uplifting"], "aromas": ["Berry", "Blueberry", "Chemical", "Citrus", "Sour", "Spicy"], "flavors": ["Berry", "Blueberry", "Cherry", "Citrus", "Fruity", "Sour", "Sweet"], "relieves": ["Berry", "Blueberry", "Cherry", "Citrus", "Fruity", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BBC": {"url": "https://www.allbud.com/marijuana-strains/hybrid/bbc", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bbc/7846/zxvgrr0fqlmoeqjjkx1v.jpg?t=4671f7ff56fec6bdcc0a4a5dfde31a2b581eecbbbbb9aed4a20fc5f9386def9f", "name": "BBC", "description": "BBC, also known more commonly as “Big Buddha Cheese,” is an evenly balanced hybrid (50% indica/50% sativa) strain created as a descendant of the classic Cheese strain by the infamous breeder, Big Buddha. This award-winning strain has been recognized by breeders and users alike for its powerful effects and insanely delicious cheesy flavor that will leave your mouth watering and your head spinning. Each smooth inhale brings on flavors of rich creamy cheese with a sweet skunky exhale that lingers long after you toke. The smell is very much the same, although slightly more pungent, with a creamy cheesy overtone that's accented by fresh skunky florals and rich earth. The BBC high comes soon after your first exhale, hitting your mind first with a euphoric lift that launches your mood and your mind into the clouds. As your head soars through intense happiness, your body will follow suit, feeling an increase in energy and motivation. You'll slowly become giggly and spacey in this state before dropping into an intense case of the munchies. Thanks to these effects and its moderately high 13-18% average THC level, BBC is often chosen to treat chronic pain, nausea or anorexia, and depression. BBC buds have chunky oversized dusty green nugs with rich amber hairs and a coating of tiny amber crystal trichomes.", "effects": ["Energizing", "Euphoria", "Giggly", "Happy", "Hungry"], "aromas": ["Cheese", "Earthy", "Floral", "Spicy", "Sweet"], "flavors": ["Cheesy", "Creamy", "Skunky", "Sweet"], "relieves": ["Cheesy", "Creamy", "Skunky", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BBJ": {"url": "https://www.allbud.com/marijuana-strains/hybrid/bbj", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bbj/KO97vgfX/dj-short-blueberryjpg.jpg?t=7b56ac9edace1e6d6681a111c687cff2df01d6d0c42fec3cba2d9db952608c61", "name": "BBJ", "description": "BBJ, also known as “Berry Berry Jack” or “Jack Berry,” is an evenly balanced hybrid (50% indica/50% sativa) strain created through crossing the delicious DJ Short Blueberry with the infamous Jack Herer strain. This bud brings on an insanely tasty flavor and mixes it with high-powered effects, making for one all around perfect bud that's great for any hybrid lover. BBJ has a sweet lemony berry flavor with a hint of fresh pine on each citrusy exhale. The smell is very earthy and sweet with a fruity berry overtone that pays tribute to its DJ Short Blueberry parent. BBJ bud shave long tapered minty green nugs with bluish leaves, bright orange hairs, and a coating of clear amber crystal trichome that look almost blue in the right light. The BBJ high takes on effects of both of its parents, blending together lifted cerebral effects and relaxing body effects for one delicious full-bodied high. You'll feel a happy lift at the onset, infusing your mind with a sense of focus and creativity, fueled by overall happiness and bliss. As these effects grow, a mellow body high will start to build, washing over you and dropping you into happy relaxation. Thanks to these effects and its moderate 12-16% average THC level, BBJ is often chosen to treat conditions such as chronic anxiety or stress, depression, fatigue, and chronic pain.", "effects": ["Body High", "Creative", "Euphoria", "Focus", "Happy"], "aromas": ["Berry", "Earthy", "Fruity", "Sweet"], "flavors": ["Fruity", "Lemon", "Pine", "Sweet"], "relieves": ["Fruity", "Lemon", "Pine", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BB King": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bb-king", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bb-king/5009/ydbc5ed64mwocoeq1oyb.jpg?t=2f5b9f28c310a6761b193b4e218397de8334f70a72023968bde5fe71edc2e17e", "name": "BB King", "description": "BB King is an indica dominant hybrid (75% indica/25% sativa) strain created as a potent cross between the delicious Blackberry Kush X Space Monster strains. This dank bud boasts a moderate THC level that ranges from 14-16% on average and a myriad of both indica and sativa effects. Users describe the BB King high as one that has a slowly building onset of a sleepy yet euphoric head high accompanied by an intense body relaxation. You'll feel completely sedated and at ease yet still blissfully happy. This feeling is accompanied by an overwhelming sense of the munchies, so be sure to have snacks on hand! Due to these potent effects, BB King is said to be an ideal strain for treating patients suffering from conditions such as appetite loss, depression, chronic pain due to injury or illness, and chronic stress. BB King buds have an aroma of sweet berry diesel and a harsh yet sweet chemical blueberry taste with a hint of earthy upon exhale. These buds have large, bulky and dense light minty green nugs with a spattering of bright fiery orange hair. These nugs are frosty with a fine layer of crystal white trichomes and sticky with sweet resin.", "effects": ["Creative", "Euphoria", "Happy", "Relaxing", "Sleepy"], "aromas": ["Diesel", "Sweet"], "flavors": ["Berry", "Blueberry", "Chemical", "Citrus", "Diesel", "Sweet"], "relieves": ["Berry", "Blueberry", "Chemical", "Citrus", "Diesel", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BC Blueberry": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bc-blueberry", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bc-blueberry/5010/kqptjdalswqgfsxaqwui.jpg?t=6f61843999336824de23828916c9ca7d9dda8026cecbfea20f8654ffc10f9b94", "name": "BC Blueberry", "description": "BC Blueberry is an indica dominant hybrid (80% indica/20% sativa) strain created as a powerful descendant of the infamous Blueberry strain. This dank bud boasts a moderate THC level that ranges from 16-23% on average and a well-balanced combination of both indica and sativa effects. BC Blueberry was a 2nd place winner for Private Growers at the Cannabis Cup during the 2011 Treat Yourself Medical Cup in Toronto. Users describe the BC Blueberry high as one that is mellow yet intoxicating, leaving you with a mild body buzz and significant mind relief. This is accompanied by a feeling of relaxation without the couch-lock or sedation typical of an indica strain. You'll be awake and at ease with a feeling of overall relaxation and lack of any pain whatsoever. Due to these potent effects, BC Blueberry is said to be an ideal strain for treating patients suffering from conditions such as chronic pain, insomnia, mild cases of depression, and muscle spasms. BC Blueberry buds have a delicious aroma of sweet blueberry with a taste of smooth blueberry spice that sweetens upon exhale. These buds have small to medium-sized popcorn-shaped dark olive green nugs with rich blue and purple undertones and spattering of dark purple hairs and sugary white trichomes.", "effects": ["Body High"], "aromas": ["Blueberry", "Sweet"], "flavors": ["Sweet", "Vanilla"], "relieves": ["Sweet", "Vanilla"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BC Coastal Haze": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/bc-coastal-haze", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bc-coastal-haze/kwlzKc0p/hazejpg.jpg?t=2d43087b5f26f4f531d9d0f6236ea64f39e3883d0d7b9d62ab8345a5d6b05c05", "name": "BC Coastal Haze", "description": "BC Coastal Haze is a slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the classic OG Haze X Mighty Mike strains. Beloved for its super well-balanced high, BC Coastal Haze is a great choice for any hybrid lover who appreciates a slight sativa lean in their medicine. The high starts in the brain with a boost of cerebral effects that launch you into a mental state of pure energy and euphoria. You’ll be happy and focused with a creative sense that gets your mental juices flowing and makes conversations come easily. However, this cerebral state will soon take a heady turn, dropping you into a stoney happiness that’s unfocused and super giggly. Combined with its high 20-24% average THC level, these effects make BC Coastal Haze a great choice for treating conditions such as chronic pain, depression, chronic stress, headaches or migraines and chronic fatigue. This bud has a sweet and fruity hazy earthy flavor with hints of flowery woods upon exhale. The aroma is pleasantly sweet and earthy with a fruity flowery overtone accented by woody pine and spicy haze. BC Coastal Haze buds have long and dense fluffy emerald green nugs with bright purple undertones, thick orange hairs and a coating of frosty, chunky white crystal trichomes.", "effects": ["Cerebral", "Creative", "Energizing", "Giggly", "Happy", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Flowery", "Fruity", "Haze", "Spicy", "Sweet"], "flavors": ["Flowery", "Fruity", "Herbal", "Spicy", "Sweet"], "relieves": ["Flowery", "Fruity", "Herbal", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BC King Haze": {"url": "https://www.allbud.com/marijuana-strains/hybrid/bc-king-haze", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bc-king-haze/twwIntX8/bc-sjpg.jpg?t=d51613baf7b87cb3032f8e83d3215958b071ca7d538b75528975257e4c57a16b", "name": "BC King Haze", "description": "BC King Haze is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the powerful King X BC Coastal Haze strains. If you're a fan of super hazy and stoney hybrid highs, BC King Haze is totally the bud for you. This bud packs a head-spinning stone that will have you totally out of touch for hours and hours on end. It begins with a creeping effect, sneaking up on you with a slow build that suddenly launches your brain into pure oblivion. You'll feel uplifted and insanely euphoric with a heady and unfocused sense that can be sedative at times. A relaxing body high accompanies this super stoney head high, keeping your body anchored as your mind fades further and further away. In combination with its high 15-23% average THC level and 0-1% CBD level, these heady effects make BC King Haze a great choice for treating conditions such as headaches or migraines, depression, chronic stress or anxiety and chronic fatigue. This bud has a spicy and woody peppery pine flavor with a lightly flowery and earthy exhale. The aroma is much like walking through a pine forest right after the rain, but with a touch of black pepper to it, too. BC King Haze buds have fat oversized pepper-shaped olive green nugs with thick amber hairs and a coating of tiny amber crystal trichomes.", "effects": ["Cerebral", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Flowery", "Herbal", "Spicy"], "flavors": ["Flowery", "Herbal", "Peppery", "Pine", "Spicy", "Woody"], "relieves": ["Flowery", "Herbal", "Peppery", "Pine", "Spicy", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BC Mango": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bc-mango", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bc-mango/j6TJZ9oD/bc-mangojpeg.jpg?t=ebbf1e75b095f76c6f3a9cedfa3d9b7a389a614f76570a1630011a9fbd3b7411", "name": "BC Mango", "description": "BC Mango is an indica dominant hybrid strain (80% indica/20% sativa) created through crossing the delicious KC Mango X Mango strains. Famous for its delicious flavor and stimulating high, BC Mango is a great choice for any indica lover. Like its name suggests, BC Mango has a sweet and fruity tropical mango flavor with a lightly sour and citrusy exhale. The aroma is very similar, with a sour mango overtone accented by sweet tropical fruits and a touch of spicy herbs. The BC Mango high isn't quite as vibrant, with effects that serve to numb and soothe rather than boost. You'll feel lifted from start to finish with this bud, free of any negative moods or racing thoughts to speak of. A light physical tingle will accompany this cerebral boost, helping your physical form to settle down into deep relaxation without affecting your mental energy level. With these soothing effects and its high 20-26% average THC level, BC Mango is often chosen to treat experienced patients suffering from conditions such as chronic stress, depression, appetite loss or nausea, chronic pain and headaches or migraines. This bud has oversized conical blue-green nugs with golden undertones, thin long orange hairs and a coating of chunky bright white crystal trichomes.", "effects": ["Cerebral", "Euphoria", "Hungry", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Mango", "Sour", "Spicy", "Tropical"], "flavors": ["Citrus", "Fruity", "Mango", "Sour", "Sweet", "Tropical"], "relieves": ["Citrus", "Fruity", "Mango", "Sour", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BC Mtn. Pinewarp": {"url": "https://www.allbud.com/marijuana-strains/hybrid/bc-mtn-pinewarp", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bc-mtn-pinewarp/3cZErZwj/8370d6b7-49e0-4861-bd82-fc893e8b85f5jpe.jpg?t=a9e73bdba3cb5a41d8cc26abb9e204f87c5c9d6ebd16b23fd1319a625c89877f", "name": "BC Mtn. Pinewarp", "description": "BC Mtn Pinewarp is an evenly balanced hybrid (50% indica/50% sativa) strain created through crossing the rare Texada Timewarp X Purple Pineberry strains. The result is one gorgeous bud with a classic pine smell and time-bending effects. BC Mtn Pinewarp buds have large leafy rich forest green nugs that are coated in long thin amber hairs and a frosty thick layer of tiny amber colored crystal trichomes. As each frosty nug is broken apart, sweet earthy pine aromas are released with a touch of floral earthiness. The flavor takes on a sweet dank effect with hints of berry on each smooth exhale. The high comes soon after you first toke, filling you with a lifted sense of happiness that permeates mind and body. As your mood soars to new heights, your body will drop into a tingly state that's both relaxing and energizing, leaving you ready to get up and moving and completely pain free from top to bottom. As these effects grow, so will your sense of focus, which can be too much for some users. Although the THC level of BC Mtn Pinewarp is unknown, these effects make it a perfect choice for treating common conditions such as depression, stress, chronic pain, and mood swings.", "effects": ["Body High", "Happy", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Fruity", "Pine", "Woody"], "flavors": ["Berry", "Dank", "Pine", "Sweet"], "relieves": ["Berry", "Dank", "Pine", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BCN Diesel": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/bcn-diesel", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bcn-diesel/GfnoAXRg/bcn-dieseljpg.jpg?t=2b45215d7f51ac302b54db5411e4071b71febea3a8ca3fe91dd71f25e47c42b0", "name": "BCN Diesel", "description": "BCN Diesel, also known as “BCN Diesel CBD,” is a rare sativa dominant hybrid strain created through crossing the infamous NYC Diesel with the potent Black Domina. This bud packs a highly medicinal high thanks to a potent 6-10% CBD level and moderate 12-18% THC level. That being said, the BCN Diesel high is incredibly relaxing in nature and ideal for treating a wide variety of conditions. The high hits you with an almost immediate cerebral rush that fills you with a sense of focus and a light increase in clarity. As your happiness builds, you'll start to settle into a happy relaxation that is often accompanied by a light touch of the munchies. Thanks to these effects and its high CBD level, BCN Diesel is the perfect choice for treating conditions such as appetite loss or anorexia, migraines or headaches, depression, and chronic pain. This bud has a sour citrusy flavor with hints of diesel and earth. The aroma is very pungent and spicy with a citrus overtone that's herbal yet sweet in nature. BCN Diesel buds have dense bullet-shaped olive green nugs with long red orange hairs and a spattering of bright white chunky crystal trichomes.", "effects": ["Focus", "Happy", "Hungry", "Sleepy"], "aromas": ["Citrus", "Diesel", "Earthy", "Fuel", "Pungent"], "flavors": ["Citrus", "Diesel", "Lemon", "Sour"], "relieves": ["Citrus", "Diesel", "Lemon", "Sour"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BC OG Sour Diesel": {"url": "https://www.allbud.com/marijuana-strains/hybrid/bc-og-sour-diesel", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bc-og-sour-diesel/WK2NbOEF/c-17jpg.jpg?t=5ca681baf586ebcfb94e0f0728d7e480a64ac871b6665d48c09b7857d6d3b5f4", "name": "BC OG Sour Diesel", "description": "BC OG Sour Diesel is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the powerful Sour Diesel X Sour OG strains. This celebrity child is a favorite of breeders and patients alike, with an easy grow and a high level of potency that will lift your spirits and leave you feeling philosophical and thoughtful for hours on end. You'll feel an influx of cerebral energy almost as soon as you exhale, filling your mind with a focused euphoria that is accompanied by a growing creativity. You'll find yourself slipping into happy introspection, thinking deep thoughts and sharing them with those around you easily. With these heady effects and its super high 19-20% average THC level, BC OG Sour Diesel is often said to be perfect for treating conditions such as chronic fatigue, depression, ADD or ADHD, chronic stress, nausea or appetite loss and headaches or migraines. This bud has a spicy and sour citrusy diesel flavor with a heavily pungent and herbal aroma to match. BC OG Sour Diesel buds have small rounded fluffy forest green nugs with golden undertones, orange hairs and a thick frosty coating of tiny golden amber crystal trichomes.", "effects": ["Cerebral", "Creative", "Energizing", "Euphoria", "Focus", "Uplifting"], "aromas": ["Citrus", "Diesel", "Earthy", "Sour", "Spicy"], "flavors": ["Citrus", "Diesel", "Fruity", "Herbal", "Sour", "Spicy"], "relieves": ["Citrus", "Diesel", "Fruity", "Herbal", "Sour", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Beach Party": {"url": "https://www.allbud.com/marijuana-strains/hybrid/beach-party", "img": "https://media.allbud.com/resized/350x242/media/images/strain/beach-party/Loa8Mjsi/kosher-chemjpg.jpg?t=41fb0042c3cb7ac050776fec097fe0cdefbbeda4952cda18505ae013230ec112", "name": "Beach Party", "description": "Beach Party is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the delicious Cindy Punch X Slymer X Kosher Chem strains. A favorite for those who love extracts, Beach Party packs a deliciously bright flavor and motivating high that will get you up and going. This bud has a sour citrusy lime flavor with a punch of spicy black pepper upon exhale. The aroma is like a spicy can of Sprite, with bold lemon-lime blends accented by earthiness and a touch of chemicals. The Beach Party high hits you almost as soon as you exhale, smashing into you square between the eyes with a lifted sense of cerebral motivation and creativity that expands with almost no ceiling. You'll find your mind activated as your artistic abilities expand, which soon turns heady and unfocused, leaving you falling into fits of giggles before you know it. Combined with its high 18-29% average THC level, these effects make Beach Party a great choice for treating those suffering from conditions such as depression or mood swings, chronic stress or anxiety, PTSD and chronic fatigue. This bud has fluffy heart-shaped minty green nugs with thin dark red-orange hairs and a coating of frosty, golden-white crystal trichomes.", "effects": ["Cerebral", "Euphoria", "Giggly", "Happy", "Motivation", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Lemon", "Peppery", "Sour", "Spicy", "Sweet"], "flavors": ["Chemical", "Citrus", "Lemon", "Lime", "Sour", "Spicy"], "relieves": ["Chemical", "Citrus", "Lemon", "Lime", "Sour", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bear Claw": {"url": "https://www.allbud.com/marijuana-strains/hybrid/bear-claw", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Bear Claw", "description": "Bear Claw, also known as “Bearclaw” or “BearClaw,” is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the powerful Bubba Kush X SFV OG Kush strains. Named for its hard-hitting high and delicious flavor, Bear Claw is perfect for any hybrid lover. The Bear Claw high will hit you almost as soon as you exhale, slamming into your mind with a roar of cerebral effects that fill you with mental clarity and focus. You'll be euphoric in this state, easily getting to work on any task at hand before you begin to fade away into heady sedation. A relaxing body high perfectly complements this lifted feeling, eventually dropping you off into deep couchlock and sleep. With these effects and its super high 30-35% average THC level, Bear Claw is often said to be perfect for treating a variety of conditions including chronic pain, depression, chronic fatigue, ADD or ADHD, insomnia and chronic stress. This bud has a sweet and sour lemony citrus flavor with a fruity banana pine exhale. The aroma is very similar, with a sour citrusy chemical overtone that turns heavy and pungent with earthy spices the more that you toke. Bear Claw buds have conical dense emerald-green nugs with minty undertones, thin dark orange hairs and chunky, golden-white crystal trichomes.", "effects": ["Body High", "Cerebral", "Euphoria", "Focus", "Relaxing", "Sleepy"], "aromas": ["Chemical", "Citrus", "Fruity", "Pine", "Pungent", "Sour", "Spicy", "Woody"], "flavors": ["Citrus", "Lemon", "Pine", "Sour", "Sweet", "Tree Fruit", "Woody"], "relieves": ["Citrus", "Lemon", "Pine", "Sour", "Sweet", "Tree Fruit", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Beast Mode Skittles": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/beast-mode-skittles", "img": "https://media.allbud.com/resized/350x242/media/images/strain/beast-mode-skittles/qYsCeGvP/img_20190427_163627jpg.jpg?t=99c39220c2d05161333ee31d95912892561c6bbb5fc25c1d9b9e70d1d12216de", "name": "Beast Mode Skittles", "description": "Beast Mode Skittles is a super rare slightly sativa dominant hybrid strain created as a cross of the classic Beast Mode OG X Skittles strains. This bud is extremely hard to come by outside of the Seattle area and may only exist as a few batches, although some claim to have grown it elsewhere. This bud takes on the mind-numbing effects of its Beast Mode parent and blends them beautifully with the tasty flavor of its Skittles parent for one highly addictive smoke that is sure to please any sativa or hybrid lover. The high comes on fast and hard with an immediate rush of euphoria that slams into your head, immediately destroying any racing or negative thoughts and replacing them with happiness. As your mind soars, your body will fall into a slightly relaxed state that leaves you ravenously hungry. In combination with its THC level that is said to be very high, these effects give Beast Mode Skittles an edge in treating conditions such as headaches or migraines, chronic stress, depression, and chronic pain. Beast Mode Skittles buds are said to have heavy dense little nuggets that are coated in sandy amber crystal trichomes. As each bud is broken apart, sweet fruity flavors accented by rich berries and kush are released. The flavor takes on the same effect, although with a touch of skunk.", "effects": ["Euphoria", "Happy", "Hungry", "Relaxing"], "aromas": ["Berry", "Earthy", "Fruity", "Pine", "Skunky"], "flavors": ["Berry", "Blueberry", "Fruity", "Sweet"], "relieves": ["Berry", "Blueberry", "Fruity", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Beast Quake": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/beast-quake", "img": "https://media.allbud.com/resized/350x242/media/images/strain/beast-quake/8UCLjpBf/cheese-quakejpg.jpg?t=a93ee3342b9a21b783ac925c30384d40984ccee7438e20d66514189ca65f136e", "name": "Beast Quake", "description": "Beast Quake is a rare indica dominant hybrid strain (80% indica/20% sativa) created through crossing the classic Beast Mode X Cheese Quake strains. If you're after a heavy-hitting high and a super unique flavor, you've found it. Beast Quake packs a super high 26-30% average THC level and an addictive flavor that will leave you begging for more. The Beast Quake high has a euphoric onset that quickly shakes its way into your brain, edging out negative or racing thoughts and replacing them with giddy happiness. You'll find yourself falling into fits of giggles as your body settles into a deeply relaxing state that can leave you feeling slightly sedated and couch-locked if you're not careful. Thanks to these heavy effects, Beast Quake is recommended for experienced users suffering from conditions such as chronic pain, mood swings, chronic fatigue, depression, Bipolar Disorder, and chronic stress. This bud has a sweet grape flavor with hints of sour pungent cheese upon exhale. The aroma is earthy and woody with a rich grape overtone that turns pungent and cheesy as the nugs are broken apart and burned. Beast Quake buds have oversized fluffy piecey neon green nugs with dark orange hairs and a coating of sandy golden crystal trichomes.", "effects": ["Body High", "Euphoria", "Giggly", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Pine", "Pungent", "Sour"], "flavors": ["Grape", "Sour", "Sweet"], "relieves": ["Grape", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Beaver Dawg": {"url": "https://www.allbud.com/marijuana-strains/hybrid/beaver-dawg", "img": "https://media.allbud.com/resized/350x242/media/images/strain/beaver-dawg/3231/ctpz7fver2ftvlmvllnw.jpg?t=f04bd160a1c260e9a59a747013107dd01d57de46fc48b4fb6e783d910b387c57", "name": "Beaver Dawg", "description": "Beaver Dawg is a lovely CBD-rich indica allegedly created by cultivators at the University of Oregon (the Beavers) and the University of Washington (the Huskies) – hence the name. Even in those places, though, this is not an easy strain to find. Dispensaries are increasingly selling strains high in CBD, so Beaver Dawg might gradually become more common in coming years. THC levels are low, less than 2% in some tests, while CBD levels top at least 4%, making this strain ideal for treating pediatric epilepsy and some other childhood illnesses. Some sources say Beaver Dawg is sativa-dominant, other that it's indica-dominant. But it delivers a calming, energized body buzz that suggests it's more indica than sativa (exact ratio unknown). This strain can treat seizures, but it's also good for nausea and pain. Of course, it's a bad choice for patients who require a THC high. Beaver Dawg has a fresh, mild, earthy taste and a mild pine smell. Negative effects are likely to include red eyes and cottonmouth. Look exclusively in the Pacific Northwest for this unusual medical strain; it's a local specialty.", "effects": ["Body High", "Energizing", "Happy", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Mellow", "Pine", "Woody"], "flavors": ["Herbal", "Pine", "Woody"], "relieves": ["Herbal", "Pine", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bedford Og": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bedford-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bedford-og/4ICNFa3s/bedford-ogjpg.jpg?t=e5e6d219880b9d931041a05b1a6d21ba97ff0543647422e81902e7f6ce42bb86", "name": "Bedford Og", "description": "Bedford OG is a rare indica dominant hybrid strain (80% indica/20% sativa) created as a phenotype of the infamous OG Kush strain. Although it's not commonly found on your average market, this bud is infamous for how it amplifies the beloved effects of the classic OG Kush. The high has a sleepy lifted effect that's perfect for when you want to kick back after a long and stressful day when sleep just won't come. You'll feel a euphoric onset at the start of the high that erases any negative or racing thoughts and replaces them with a sense of calm. As your mind settles, your body will be washed over with a sense of deep relaxation that settles into your very bones. As you fade away, you'll start to feel incredibly sedated and sleepy, leaving you dozing on and off. Thanks to these effects and its high 20-27% average THC level, Bedford OG is often chosen to treat conditions such as chronic pain, insomnia, depression, muscle spasms, and cramps. This bud has a spicy woody flavor with a hint of sweet citrus upon exhale. The aroma is very earthy and spicy with a woody citrus overtone accented by fresh herbs. Bedford OG buds have small rounded neon green nugs with lots of tapered orange hairs and frosty amber crystal trichomes.", "effects": ["Body High", "Creative", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Pine", "Sour", "Spicy", "Woody"], "flavors": ["Herbal", "Lemon", "Pine", "Spicy"], "relieves": ["Herbal", "Lemon", "Pine", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bedrock": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/bedrock", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bedrock/91DxSzMM/15908008783202750490687072398814jpg.jpg?t=69cf1fcd1c60af77ebe8367157375baeffa6867c635ea66ce5ec0839fd203ae5", "name": "Bedrock", "description": "Bedrock is a sativa dominant hybrid (80% sativa/20% indica) strain with unknown genetics due to a high level of secrecy by its breeders. This rare hybrid strain has an unknown average THC level, although users widely agree that it is moderate in level, indicating that it is likely between 14-18%. With a fruity aroma with a slight hint of mocha and a crisp chocolate fruity taste, Bedrock is ideal for any lover of sweet strains. Users describe the Bedrock high as one with mild stoney effects that are immediately felt behind the eyes and in the temples. This will leave you with red droopy eyes and a spacey cerebral head high. As the high continues, you will be hit with a wave of energy and be stimulated artistically, inspiring you to pursue creative endeavors, although likely not finish them due to your spaciness. Because of these potent effects, Bedrock is an ideal strain for treating patients suffering from conditions such as anxiety, depression, and chronic stress. The Bedrock bud has fluffy popcorn shaped low-density nugs that are dark olive green with purple and amber undertones. These airy nugs are specked with thick fiery orange hairs and a fine layer of milky white crystal trichomes and resin.", "effects": ["Cerebral", "Creative", "Energizing"], "aromas": ["Earthy", "Fruity"], "flavors": ["Fruity"], "relieves": ["Fruity"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bedropuur": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bedropuur", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Bedropuur", "description": "Bedropuur, pronounced “Bedro-Pure,” is a rare indica dominant hybrid strain exclusive to Canada with unknown parentage due to a high level of breeder secrecy about its heritage. Originally designed for women to combat the pains of periods, Bedropuur has quickly become a patient favorite thanks to its super soothing and relaxing physical effects. The high has a subtle build of affects, striking the mind first before spreading throughout the rest of your body. You’ll feel a boost of the spirits infuse you with a giddy sense of happiness that’s slightly tingly and arousing. This quickly spreads throughout your physical form, easing away any aches and pains and leaving you feeling totally relaxed from head to toe. With these effects and its high 20-24% average THC level and 1% CBD level, Bedropuur is often chosen to treat conditions such as insomnia, chronic stress or anxiety, depression, appetite loss or nausea and chronic pain. This bud has a super sour citrusy lemon flavor with a lightly sweet exhale. The aroma takes a spicier turn, with sour herbs and sweet citrus throughout. Bedropuur buds have fluffy forest green nugs with thick orange hairs, golden amber undertones and a coating of frosty tiny matching crystal trichomes.", "effects": ["Calming", "Giggly", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Lemon", "Sour", "Spicy"], "flavors": ["Citrus", "Lemon", "Sour", "Sweet"], "relieves": ["Citrus", "Lemon", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Belfair Bomb": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/belfair-bomb", "img": "https://media.allbud.com/resized/350x242/media/images/strain/belfair-bomb/5854/mghmdkxwng2fdeymicim.jpg?t=4552a647bee73dfbf177fa9e1efce0f0888601cbe59097b7bec0491ff98e26cf", "name": "Belfair Bomb", "description": "Belfair Bomb is a sativa dominant hybrid strain that is thought to be a descendant of the infamous THC Bomb, although its exact parentage is unknown due to breeder secrecy. This bud has an insanely powerful 23% average THC level and a myriad of powerful sativa effects that can leave lesser-experienced users dazed for hours. The high starts with an almost immediate energetic mood boost that leaves you laser focused and motivated to tackle anything at hand with creative inspiration. These feelings will continue to build and build, which can lead to some users becoming anxious or paranoid, so be careful how much you toke. Because of these sativa heavy effects, Belfair Bomb is said to be an ideal choice for treating patients suffering from conditions such as chronic pain, fatigue, chronic stress, and inattentiveness. This bud has a sweet and tangy flavor of lemony earth with a hint of herbs upon exhale that are quite savory. The aroma is incredibly strong, with heavy pungency and zesty lemon scents that can hang around long after you finish toking. This bud has small and dense spade-shaped forest green nugs with fiery orange hairs and a sticky coating of sweet resin.", "effects": ["Cerebral", "Creative", "Happy"], "aromas": ["Diesel", "Earthy", "Pungent", "Spicy"], "flavors": ["Herbal", "Lemon", "Sweet"], "relieves": ["Herbal", "Lemon", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bella Luna": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bella-luna", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bella-luna/oC6OF9id/1jpg.jpg?t=504a0aefb5fef6af4b5fb480a60bfc4885351291be847e65dd7b042bccc92d91", "name": "Bella Luna", "description": "Bella Luna is an indica dominant hybrid strain (70% indica/30% sativa) created as a phenotype of the classic Conspiracy Kush strain. This strain brings on the timeless indica heavy effects, with a high that hits both mind and body with a level of potency that can knock you flat out. You'll feel the cerebral effects first, washing over your brain and lifting you into a state of happy and unfocused euphoria. You'll feel an influx of creativity and sociability that lends itself well to any conversations that you may have at hand. As your mind lifts, your body will begin to settle into a deeply relaxed state that has you pretty couch-locked and immovable before you know it. With these effects and its high 16-18% average THC level, Bella Luna is often chosen to treat conditions such as chronic fatigue, insomnia, depression, chronic stress and mood swings. This bud has a classic sweet and spicy peppery citrus flavor with an exhale that turns sharply sour. The aroma is earthy and pungent with a woody and peppery overtone that turns sour and citrusy as the nugs are burned away. Bella Luna buds have long conical minty green nugs with vivid orange hairs and a coating of tiny frosty amber white crystal trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Sour", "Spicy", "Woody"], "flavors": ["Citrus", "Herbal", "Spicy", "Sweet"], "relieves": ["Citrus", "Herbal", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bella Ortega": {"url": "https://www.allbud.com/marijuana-strains/indica/bella-ortega", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bella-ortega/PfOJBXoL/87jpg.jpg?t=ca52ef4574e4116ce711a51a09ff33d084a9067413429d8f9359938845d36cb6", "name": "Bella Ortega", "description": "Bella Ortega is a 100% pure indica strain created as a phenotype of the classic Ortega strain. This heavy-hitting indica is a favorite of patients and breeders alike thanks to its beautiful appearance, delicious flavor and long-lasting super sedative high. This bud has super fat and dense pepper-shaped dark olive green nugs with long thin orange hairs and a coating of tiny frosty white crystal trichomes that are dripping with sweet sticky resin. As you pull apart each glittering little nugget, aromas of sweet and sour grapefruit are released, with a heavy punch of spicy black pepper and pungent herbs to it, too. The flavor is very similar, with a sweet and fruity taste that turns heavily sour and spicy with black pepper upon exhale. The Bella Ortega isn't quite as eye-opening as the taste, with effects that serve to relax and sedate rather than brighten. You'll feel a substantial boost of the spirits creep up on you and suddenly hit, lifting you into a happy yet drowsy state that has you fully unfocused and out of touch with the world around you. As you settle further and further into happy relaxation, you'll find yourself falling further and further into deep sedation before you finally fall asleep. Thanks to these effects and its high 15-23% average THC level, Bella Ortega is often chosen to treat conditions such as insomnia, depression, appetite loss or nausea and chronic stress.", "effects": ["Happy", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Grapefruit", "Herbal", "Pepper", "Sour", "Spicy"], "flavors": ["Citrus", "Fruity", "Grapefruit", "Peppery", "Sour", "Sweet"], "relieves": ["Citrus", "Fruity", "Grapefruit", "Peppery", "Sour", "Sweet"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Benevolence": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/benevolence", "img": "https://media.allbud.com/resized/350x242/media/images/strain/benevolence/BPkol2JU/benevolencejpeg.jpg?t=78d170f4a42a7bed1248306c280eaa07ba92ea4b933b1de0a24189b06a405865", "name": "Benevolence", "description": "Benevolence is a sativa dominant hybrid strain (70% sativa/30% indica) created through crossing the powerful OG Kush Breath X Mendo Breath F2 strains. Beloved for its tranquil, trance-like high, Benevolence is a great bud to soothe any mental aches or pains. It starts with a slow build of effects, beginning as a subtle cerebral lift, filling your mind with an expansive sense of happiness that wipes out any negative moods or racing thoughts. Instead, they'll be replaced with a heady sense of calm that leaves no space for anything but peace. At the same time, a relaxing physical effect will wash over your body, helping you to settle down and truly feel at ease with the world around you. Thanks to these effects and its high 25-26% average THC level, Benevolence is often chosen to treat those suffering from conditions such as chronic stress or anxiety, chronic pain, mood swings or depression and headaches or migraines. This bud has a sweet and fruity blueberry berry flavor with a lightly woody exhale. The aroma is very much the same, with a woody pine overtone accented by sweet fruity blueberries and fresh flowery earthiness. Benevolence buds have fat grape-shaped forest green nugs with dark blue undertones, thin amber hairs and a coating of tiny, milky white crystal trichomes.", "effects": ["Calming", "Cerebral", "Euphoria", "Happy", "Relaxing"], "aromas": ["Berry", "Blueberry", "Earthy", "Herbal", "Nutty", "Woody"], "flavors": ["Berry", "Blueberry", "Flowery", "Nutty", "Sweet", "Woody"], "relieves": ["Berry", "Blueberry", "Flowery", "Nutty", "Sweet", "Woody"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Ben Franklin OG": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/ben-franklin-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/ben-franklin-og/AOMztWLQ/15690965385688012263116206713003jpg.jpg?t=0b4e0a99b1fe5d38a3a60c35bf475a8de481b92a95289326335296d67aaf9fdb", "name": "Ben Franklin OG", "description": "Ben Franklin OG, also known simply as “Franklin OG” or “The Franklin,” is an indica dominant hybrid strain with unknown genetics due to breeder secrecy and general disagreement about its backstory. Nonetheless, this presidential bud is sought after for its relaxing yet arousing effects that can leave you tingly and active although slightly sedated. The high starts with a warming body buzz and a lifted mood that's accompanied by a sense of subtle energy. This buzz fades into a calm state that's slightly sedated with a pretty heavy sleepy feeling despite an active mind. Because of these effects and its medium THC level, Ben Franklin OG is said to be perfect for treating patients suffering from conditions such as chronic stress, depression, insomnia, appetite loss, and chronic pain. This bud has flat heart-shaped forest green nugs that are completely oversized and covered in thin clear hairs and clear crystal trichomes. The Ben Franklin OG aroma is very pungent and sour yet somehow sweet and fruity with a harsh diesel effect that's released as the nugs are burned. The taste is of sweet fruit with a hint of pungent citrus and berry that stays on your tongue long after you finish smoking.", "effects": ["Aroused", "Body High", "Relaxing", "Sleepy"], "aromas": ["Diesel", "Earthy", "Fruity", "Lemon", "Pungent"], "flavors": ["Citrus", "Sweet"], "relieves": ["Citrus", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Ben N Berries": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/ben-n-berries", "img": "https://media.allbud.com/resized/350x242/media/images/strain/ben-n-berries/xOcKwuJN/ben-n-berriesjpg.jpg?t=7194b727d9458fcbfb01668a35b85177c5d0a26fa54c3966e378198d98840a66", "name": "Ben N Berries", "description": "Ben N Berries, also known as “Ben & Berries” or “Ben and Berries,” is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the delicious Apple Fritter X Reckless Rainbow strains. If you're searching for the ultimate fruity flavor with a soothing physical high, you've found it with Ben N Berries. This bud packs a super sweet and sugary berry bouquet of flavors, with fresh blueberries, spicy apples and hints of flowery herbs. The aroma is very similar, with an earthy flowery overtone accented by sour apples and freshly picked blueberries. The Ben N Berries high is just as delicious, with full-bodied effects that will leave you feeling stimulated and sleepy at the same time. It starts with a tingle in the back of the head and neck that helps to lift your spirits and infuse you with a sense of calm. This tingle will soon work its warming waves throughout your entire body, leaving you feeling fully relaxed from head to toe and almost immediately couch-locked. This combination will turn sedative, so beware if you have things to do other than sleepy! With these effects and its high 20-21% average THC level, Ben N Berries is said to have an edge in treating chronic stress or PTSD, depression, chronic pain, cramps or muscle spasms and insomnia. This bud has dense conical forest green nugs with thin orange hairs and a coating of chunky white crystal trichomes.", "effects": ["Body High", "Calming", "Happy", "Relaxing", "Sleepy", "Tingly", "Uplifting"], "aromas": ["Apple", "Berry", "Blueberry", "Flowery", "Haze", "Sour"], "flavors": ["Apple", "Berry", "Blueberry", "Fruity", "Sour", "Sugary", "Sweet"], "relieves": ["Apple", "Berry", "Blueberry", "Fruity", "Sour", "Sugary", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bentley OG": {"url": "https://www.allbud.com/marijuana-strains/indica/bentley-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bentley-og/5M2nVn4U/16321310792137678560401475229131jpg.jpg?t=2a09643534a7db5a02e9efd83bf8c945fd642b07987eaca48608e284dbdc18f0", "name": "Bentley OG", "description": "Bentley OG is a 100% pure indica strain that was named after the world famous Bentley car. This strain has unknown genetics due to the secrecy of its breeders, although it is widely agreed that it is most likely an OG Kush phenotype. With an intense THC level ranging from 22-24% on average, Bentley OG is definitely a top-shelf bud. Users describe the Bentley OG high as an onset of a strong warming body buzz that leaves you calm, sleepy, and intensely couch-locked. You'll experience an instant body melt into wherever you are sitting followed by an overwhelming feeling of lethargy and an almost immediate fall into a deep and peaceful sleep. Due to these potent indica effects, Bentley OG is an ideal strain for treating patients suffering from conditions such as insomnia, anxiety, and chronic stress. This bud has thick fluffy spade-shaped neon green nugs with curly dark olive green leaves and rich amber undertones. These nugs are spattered with thick furry fiery orange hairs and a thin layer of trichomes. Bentley OG has an almost confusing aroma of pungent sweet floral that is oddly fragrant and savory, and a taste of sweet tangy floral herbs.", "effects": ["Body High", "Relaxing", "Sleepy"], "aromas": ["Fragrant", "Pungent", "Sweet"], "flavors": ["Sweet"], "relieves": ["Sweet"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bergamot": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bergamot", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bergamot/nHnAYANc/24-cjpg.jpg?t=909ef1b433cd0164649e168b526f80d51b10d64ad2677f1c459450c2c904ffb6", "name": "Bergamot", "description": "Bergamot, also known as “Bergy,” is an indica dominant hybrid strain (80% indica/20% sativa) created through crossing the delicious Afghani X another unknown indica hybrid strain. Best known for its super spicy flavor and soothing high, Bergamot is a great choice for any lover of classic indicas. Like its namesake spice, Bergamot packs a super spicy and peppery flavor with a touch of sour citrus. The aroma is very similar, with a pungent spicy overtone that's accented by a punch of sour citrus and sharp black pepper. The Bergamot high isn't quite as eye-opening, with effects that lift you up into a state of pure happiness and calm mere minutes after your final toke. You'll feel the effects slowly creep up on you, filling your brain with a euphoric sense of pure happiness and relaxation. This is accompanied by a touch of creativity and sociability, both of which lend themselves to lazy conversations with those around you. The sense of relaxation will soon spread throughout your entire body, leaving you feeling fully calmed from head to toe and slightly couch-locked at times. Combined with its high 15-21% average THC level, these effects make Bergamot a great choice for treating depression, chronic stress, mood swings, chronic pain, nausea or appetite loss and hypertension. This bud has small spade-shaped minty green nugs with thin orange hairs and chunky bright white crystal trichomes.", "effects": ["Calming", "Creative", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Pungent", "Spicy"], "flavors": ["Citrus", "Herbal", "Peppery", "Sour", "Spicy"], "relieves": ["Citrus", "Herbal", "Peppery", "Sour", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berkel": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/berkel", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berkel/ld5HkJzb/20201016_180952jpg.jpg?t=3b4c524a466f1add40ed7963172a42ed696a78de149ef5ea4f55fa4b5bea5805", "name": "Berkel", "description": "Berkel, not to be confused with its sister strain “Burkle,” is a rare indica dominant hybrid strain (75% indica/25% sativa) created through crossing the classic Pre-98 Bubba Kush X Grand Daddy Purps strains. This celebrity child boasts a super potent high and long lasting effects that are perfect for those nights when you need a little extra help to get to sleep. The high starts with a euphoric lift that rushes through your mind, infusing you with a sense of pure happiness and hazy unfocused bliss. As your mind soars, a relaxing tingly body buzz will start to creep up on you, suddenly taking hold and dropping you into a deeply relaxing and couch-locked state. A pang of hunger comes next, leaving you ravenous and reaching for anything in sight to snack on. Soon, you'll feel pretty sleepy, drifting away into a long and peaceful sleep that lasts for hours on end. Thanks to these effects and its high 16-24% average THC level, Berkel is said to be perfect for treating those suffering from chronic pain, insomnia, nausea or appetite loss, depression, and chronic fatigue. This bud has a super spicy dank skunky flavor with a heavy herbal earth exhale. The aroma is super pungent and skunky with a heavy spicy herbal overtone that turns sour as the nugs are burned. Berkel buds have fluffy rounded dark olive green nugs with purple undertones, bright orange hairs, and a coating of milky white crystal trichomes.", "effects": ["Body High", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Earthy", "Grape", "Herbal", "Pungent", "Sour", "Spicy"], "flavors": ["Grape", "Herbal", "Skunky", "Sour", "Spicy"], "relieves": ["Grape", "Herbal", "Skunky", "Sour", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berkely Blues": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/berkely-blues", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berkely-blues/2798/xpzmrjmiajgxsdhp7rc6.jpg?t=5a6e3199f543306df302043e6a6bcb9275c782d51c245749ce2d2dbf54b61120", "name": "Berkely Blues", "description": "Berkely Blues is a sativa dominant hybrid with a 20:80 indica/sativa ratio. With a staggering 23% THC content, it is one of strongest of all sativa strains. Even though little is known about the strain, it is said to have been the result of a botany project conducted in the prestigious university in California, which goes by the same name. Moreover, it is a cross between Blueberry and Berkeley. The buds are beautiful with large blue stems and light/dark greens. As for the smell and taste, it has an incredible blueberry flavor that you will fall in love with almost instantaneously. Regardless of how harmless it may seem the strain is not to be underestimated. Even the most experienced of all cannabis users find it difficult to stay in control. The high takes over within seconds and can help individuals stay energetic, calm and relaxed throughout the rest of the day. This also explains why it is often recommended for daytime use. However, smoking too much of the strain does have its drawbacks and can cause anxiety for some individuals. But then again, it is equally effective at treating medical conditions like stress, depression, anorexia and Post Traumatic Stress Disorder.", "effects": ["Energizing", "Happy", "Uplifting"], "aromas": ["Blueberry", "Nutty", "Sweet", "Vanilla"], "flavors": ["Fruity", "Honey", "Sweet", "Vanilla"], "relieves": ["Fruity", "Honey", "Sweet", "Vanilla"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bermuda Triangle OG": {"url": "https://www.allbud.com/marijuana-strains/hybrid/bermuda-triangle-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bermuda-triangle-og/jPKQwFGl/bermuda-triangle-ogjpg.jpg?t=fa8a5f4b2fd4777f98cbf189d2807ee37f091f05810b579609161d32ffcbffff", "name": "Bermuda Triangle OG", "description": "Bermuda Triangle OG, not to be confused with the like-named “Bermuda Triangle,” is a rare evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the infamous Ghost OG X Triangle Kush strains. This high-powered bud is perfect for any hybrid lover, with long-lasting effects that can easily overwhelm inexperienced users thanks to its super high 22-25% average THC level. The high starts with a rush of cerebral effects that rocket their way through your brain, leaving you lifted with an influx of psychedelic tendencies. As your mind dances away through artistic visions, a relaxing body high will lull your physical form into a deeply relaxing state that leaves you slightly couch-locked and pretty sleepy at times, dozing off and on. Thanks to these long-lasting effects and its high THC level, Bermuda Triangle OG is said to be perfect for treating those suffering from conditions such as insomnia, migraines or headaches, nausea or appetite loss, and chronic pain. This bud has a rich sweet pine flavor with a hint of earthy diesel upon exhale. The aroma is very earthy and woody with a heavy diesel overtone that's slightly sweet as the nugs are burned. Bermuda Triangle OG buds have rounded fat forest green nugs with lots of long thin orange hairs and a coating of frosty golden amber crystal trichomes.", "effects": ["Body High", "Cerebral", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Diesel", "Earthy", "Spicy", "Sweet", "Woody"], "flavors": ["Diesel", "Pine", "Sweet", "Woody"], "relieves": ["Diesel", "Pine", "Sweet", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berner's Cut": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/berners-cut", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berners-cut/KpIYbIH8/imagejpg.jpg?t=b49e299dee13c101c994b605198d4b1349063a66d94f26472698bf9e08ec4460", "name": "Berner's Cut", "description": "Berner's Cut, also known as “Berner's Cookies,” is a sativa dominant hybrid (80% sativa/20% indica) variety of the infamous Girl Scout Cookies strain, created by rapper Berner, a close friend of Wiz Khalifa. Specifically, this bud is bred from OG Kush and Durban Poison for the purpose of capturing a THC level that hits well over 27%. Even with its powerful THC, Berner's Cut doesn't have overpowering effects unless you are inexperienced or toke too much at once. The high is very relaxed and lazy with creative and social tendencies that are perfect for kicking it with friends or working on a project. As the high builds you'll feel a sharp pang of hunger accompanied by a sense of tranquil sleepiness that doesn't cause any sort of couch-lock or sedation. These effects coupled with its powerful THC make Berner's Cut perfect for treating chronic stress, depression, appetite loss, chronic pain, and insomnia. Like GSC, this bud has a mild flavor of sweet nutty kush with hints of vanilla and earth, and an aroma that's said to be just like a cookie, but with strong hints of pungency. This bud has small and round grape-shaped forest green nugs with fiery orange hairs and a thick coating of tiny amber colored crystal trichomes.", "effects": ["Creative", "Happy", "Hungry"], "aromas": ["Earthy", "Kush", "Pungent", "Sweet"], "flavors": ["Sweet", "Vanilla"], "relieves": ["Sweet", "Vanilla"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berner's Snowman": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/berners-snowman", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berners-snowman/m3lYq0Pt/a18db254-3444-4729-976b-434f8ebf70f6jpe.jpg?t=f73c564b4c7d5a4efcab50dd68b889534a4e9ef1d61163345717045da3937559", "name": "Berner's Snowman", "description": "Berner's Snowman is a sativa dominant hybrid strain created as a descendant of the classic Girl Scout Cookies strain by infamous rapper and breeder, Berner, best known for being friends with Wiz Khalifa. Although its exact indica to sativa ratios are unknown, it is thought to be sativa dominant because of its heavy head hitting effects. The high starts with a happy and relaxed lift that leaves you feeling incredibly creative and motivated with a hazy sense of focus. This haze will slowly overtake your mind with a stoniness that leaves you lazy and introspective. As this head high builds, a slight body stone will take over the rest of you, leaving you hungry and sleepy, although not quite completely sedated. Because of these effects and its THC level that is said to be well over 20%, Berner's Snowman is perfect for treating conditions such as depression, chronic pain, insomnia, appetite loss, and chronic stress. This bud has large and lumpy dark forest green nugs with a spattering of thin amber hairs and an insanely frosty coating of tiny amber hued crystal trichomes. Like its parent strain, Berner's Snowman has a sweet kushy flavor that's nutty and savory with hints of vanilla spice, and an aroma that is said to be just like your favorite cookie, but with a pungent kick.", "effects": ["Creative", "Happy"], "aromas": ["Earthy", "Kush", "Pungent", "Sweet", "Vanilla"], "flavors": ["Sweet"], "relieves": ["Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bernie HannaButter": {"url": "https://www.allbud.com/marijuana-strains/hybrid/bernie-hannabutter", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bernie-hannabutter/J9OEc3Ly/jet-fuel-gelatopng.jpg?t=dd5ac9e45d6189f5778546dbcd0f3254a5505c23a9ecdf7cd1232a8fd6038c64", "name": "Bernie HannaButter", "description": "Bernie HannaButter, also known as “Bernie Hanna Butter,” is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the powerful (Jet Fuel Gelato X Guava) X (Blue Cookies X Oreoz) strains. Named one of Leafly's Strains of Summer 2022, Bernie HannaButter packs an amazing high that will have you soaring for hours on end. You'll feel the effects wash over your brain a few minutes after your final exhale, lifting your spirits and infusing you with a sense of euphoria and focus. But you'd better hurry – this focus will soon fade away into a heady state that can have you falling in and out of fits of the giggles for hours on end. A physical calm accompanies this heady boost, helping to keep your body totally relaxed. Combined its super high 28-30% average THC level, these effects give Bernie HannaButter an edge in treating a variety of conditions including mood swings or depression, chronic fatigue and chronic stress or anxiety. This bud has a sweet and creamy fruity berry candy flavor with a touch of diesel. The aroma is heavier, with a dank diesel overtone accented by sweet flowers and a punch of tangy berries. Bernie HannaButter buds have oversized and heavy emerald green nugs with deep undertones, thin orange hairs and tiny, minty-white crystal trichomes.", "effects": ["Calming", "Creative", "Euphoria", "Giggly", "Happy", "Relaxing", "Uplifting"], "aromas": ["Berry", "Dank", "Diesel", "Flowery", "Fruity", "Gas", "Sweet"], "flavors": ["Berry", "Candy", "Creamy", "Diesel", "Flowery", "Fruity", "Sweet"], "relieves": ["Berry", "Candy", "Creamy", "Diesel", "Flowery", "Fruity", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry 1": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/berry-1", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-1/A9APbU5B/20180207_095018jpg.jpg?t=60987fe9c673cd0bed37e005f4d77a4cc11c51137b83da7b3fae1aa2107afbd0", "name": "Berry 1", "description": "Berry 1, or Berry #1, is a rare indica dominant hybrid strain of unknown origins that is said to be the Old School original cut of Berry OG. Although this can't be confirmed, Berry 1 is one tasty bud that you need to try at least once in your lifetime. This bud brings on the delicious berry flavors, blending sweet raspberries and fresh blackberries with rich blueberries for a flavor explosion that will leave you begging for more. The aroma takes on a slightly more mellow effect, with a berry overtone that's accented by a touch of kush and earth. Don't let the flavor fool you into having too much – with its high average THC level of 17-19%, this tasty bud can quickly overwhelm you if you're not careful. The high comes on pretty quickly, infusing you with a euphoric boost that fills you with happiness and leaves you feeling giggly and outgoing. You'll feel an increase in creativity in this state, which is countered beautifully by a happy relaxation. In combination with its high THC level, these effects make Berry 1 perfect for treating conditions such as chronic pain, PTSD or stress, and depression. This bud has heart-shaped purplish nugs with bright furry orange hairs and a coating of super chunky frosty milky white crystal trichomes.", "effects": ["Creative", "Euphoria", "Giggly", "Relaxing"], "aromas": ["Earthy", "Fruity", "Kush"], "flavors": ["Berry", "Fruity", "Herbal", "Sweet"], "relieves": ["Berry", "Fruity", "Herbal", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Blast": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/berry-blast", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-blast/ouI05l3Z/berry-blastjpg.jpg?t=6f47360002ec227b2642e03dd5bfe55681b578e01ad958eb0f8c0bffc47aa9df", "name": "Berry Blast", "description": "Berry Blast is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the classic Blue Dream Super Silver Haze Cut X Johnny Blaze strains. If you're after a fast-hitting high with a delicious flavor to it, too, Berry Blast is the bud for you. It comes on with an immediate effect, slamming into your brain with a high-flying lift that's filled with cerebral stimulation. You'll soon find your focus ebbing and flowing as you're dropped off into a state of headiness that can have you drifting through psychedelic visions if you're not mindful of your dosage. While your mind soars, your body will begin to settle into a state of pure calm and ease that's slightly stimulating at times. A sharp pang of hunger rounds out this high, leaving you with a ravenous case of the munchies. Combined with its high 22-30% average THC level, these effects make Berry Blast a great choice for treating chronic fatigue, depression or mood swings, appetite loss, chronic pain and headaches or migraines. This bud has a sweet and fruity sugary blueberry candy flavor with a lightly spicy exhale. Th aroma is of fresh fruity berries, sugary candies and a hint of spicy earthiness. Berry Blast buds have thick and long grape-shaped olive green nugs with blue undertones, thick orange hairs and frosty purple-tinted white crystal trichomes.", "effects": ["Body High", "Cerebral", "Hungry", "Relaxing", "Uplifting"], "aromas": ["Berry", "Blueberry", "Earthy", "Spicy", "Sweet", "Woody"], "flavors": ["Berry", "Blueberry", "Candy", "Fruity", "Sugary", "Sweet"], "relieves": ["Berry", "Blueberry", "Candy", "Fruity", "Sugary", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BERRY COBBLER": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/berry-cobbler", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-cobbler/7885/fxrcpaubhtg1usmjbsob.jpg?t=4a0279d454be79e6db395baa5c4b0e80b96670cc5d9a10cadd634298c1d1829e", "name": "BERRY COBBLER", "description": "Berry Cobbler, also known as “Blueberry Cobbler,” is a super rare sativa dominant hybrid strain created through crossing Blueberry with an unknown strain. The second parent is thought to be a member of the Girl Scout Cookies family, although it has never been confirmed due to breeder secrecy. This bud has a flavor just like its name suggests – fruity and nutty with a sweet cookie aftertaste! The smell is very earthy and kushy with a touch of berry and dank fruitiness as the nugs are burned. The Berry Cobbler high is pretty well balanced in nature, hitting both mind and body with moderate effects that are ideal for all levels of user. It hits you first with a subtle lift that slowly grows, filling you with happiness and a sense of motivated creativity. As this effect grows, your body will start to melt into a feeling of relaxation that won't affect your energy level at all. Rather, you'll feel lifted and happy with no mental or physical pains to speak of. Thanks to these effects and its moderate THC level, Berry Cobbler is often chosen to treat conditions such as chronic pain, muscle spasms, nausea, and depression. This bud has rich dark olive green nugs with purplish blue undertones, dark amber hairs, and a coating of clear crystal trichomes.", "effects": ["Body High", "Focus", "Happy", "Relaxing", "Uplifting"], "aromas": ["Berry", "Dank", "Earthy", "Sweet"], "flavors": ["Berry", "Nutty", "Sugary", "Sweet"], "relieves": ["Berry", "Nutty", "Sugary", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Exotic": {"url": "https://www.allbud.com/marijuana-strains/hybrid/berry-exotic", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-exotic/OpHXU0oJ/berry-exoticjpg.jpg?t=1877881e70fd78b88819726a69441b2f6a25a21f7f4f3e0777a0bfe30ee72a42", "name": "Berry Exotic", "description": "Berry Exotic, also known as “Berry Exotic CBD,” “Berry Exotic Hemp” or “Berry Exotic CBD Hemp,” is an evenly balanced hybrid strain (50% indica/50% sativa) or a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the classic Berry Blossom X Valentine X strains. If you're after a truly out of this world flavor and soothing medicinal experience, Berry Exotic is totally the bud for you. Much like its name implies, Berry Exotic has a sweet and fruity blueberry berry flavor with a sugary honey exhale. The aroma is very similar, with a fruity berry overtone accented by spicy earthiness and a hint of heavy dank. The Berry Exotic high has a super mellow overtone due to its low THC level, so don't expect too much in the effects department! You will, however, experience an all-encompassing calm that wraps you up in a warming blanket of happiness and relaxation that's free of any aches and pains. Thanks to these mild effects and its low 0-1% average THC level and super high 13-17% average CBD level, Berry Exotic is often chosen to treat a variety of conditions including mood swings or depression, chronic stress or anxiety, insomnia, depression, inflammation and chronic pain. This bud has flat rounded minty green nugs with deep purple undertones, thin red-orange hairs and a coating of tiny, golden-white crystal trichomes.", "effects": ["Calming", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Dank", "Earthy", "Fruity", "Grape", "Honey", "Sugary"], "flavors": ["Berry", "Blueberry", "Candy", "Fruity", "Spicy", "Sweet"], "relieves": ["Berry", "Blueberry", "Candy", "Fruity", "Spicy", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Garcia": {"url": "https://www.allbud.com/marijuana-strains/hybrid/berry-garcia", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-garcia/Aawuchuq/16jpg.jpg?t=2c89313cf78a5feb8a00a6799d80ee1de55472608902bb4addae14e0f5470ca3", "name": "Berry Garcia", "description": "Berry Garcia is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the potent NYC Diesel X Blueberry strains. The perfect well-balanced hybrid strain, Berry Garcia brings on both cerebral and physical effects that will have you feeling lifted and giddy for hours and hours on end. The high starts almost as soon as you exhale, filling your mind with a high-flying euphoria that immediately kicks out any negative or racing thoughts. You'll feel happy and giggly with an outgoing sense that has you easily carrying on conversations with those around you, although you may fall into fits of uncontrollable laughter for no apparent reason while you do. With these super happy effects and its high 15-27% average THC level, Berry Garcia is often chosen to treat conditions such as chronic pain, arthritis, chronic stress, depression and migraines or headaches. This bud has a classic sweet and fruity berry flavor with a lightly skunky diesel exhale. The aroma is of earthy skunk and pungent diesel with a light sweet fruitiness to it, too. Berry Garcia buds have fat conical emerald green nugs with lots of orange hairs and a coating of golden amber crystal trichomes.", "effects": ["Euphoria", "Giggly", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Berry", "Diesel", "Earthy", "Fruity", "Skunky", "Spicy"], "flavors": ["Berry", "Diesel", "Fruity", "Skunky", "Sweet"], "relieves": ["Berry", "Diesel", "Fruity", "Skunky", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Gelato": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/berry-gelato", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-gelato/ILmypliT/berry-gelatojpg.jpg?t=cfec1149f408420e76131cec6f31ec21682a63c953f94344ceb8fecf766999c9", "name": "Berry Gelato", "description": "Berry Gelato is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the delicious Thin Mint Girl Scout Cookies X Blueberry strains. This delicious celebrity child boasts a super mouthwatering high and plenty of clear-headed effects that will have your mind soaring while your body drops off into oblivion. You'll feel this mental clarity hit you a few minutes after your final exhale as your mind is lifted to new heights of happiness. This effect will build with seemingly no ceiling, which can have you dropping off into psychedelic visions if you're not careful with your dosage. A tingly body high comes next, washing over you and lulling you into a state of pure relaxation and ease that's pretty arousing at times. Combined with its high 18-22% average THC level and 0-2% CBD level, these sleepy effects make Berry Gelato a great choice for treating those patients suffering from conditions such as chronic stress or anxiety, insomnia, depression or mood swings and chronic pain. This bud has a sweet and fruity berry blueberry candy flavor with a flowery lavender exhale. The aroma is very similar, with a fruity blueberry overtone accented by spicy flowers and sugary berries. Berry Gelato buds have small heart-shaped forest green nugs with bright blue undertones, thin red-orange hairs and a coating of tiny, blue-tinted white crystal trichomes.", "effects": ["Aroused", "Body High", "Cerebral", "Relaxing", "Sleepy", "Tingly"], "aromas": ["Berry", "Blueberry", "Candy", "Earthy", "Flowery", "Lavender"], "flavors": ["Berry", "Blueberry", "Candy", "Flowery", "Fruity", "Sugary", "Sweet"], "relieves": ["Berry", "Blueberry", "Candy", "Flowery", "Fruity", "Sugary", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Haze": {"url": "https://www.allbud.com/marijuana-strains/sativa/berry-haze", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-haze/5046/b9ngvkg5heu5a7ipszpi.jpg?t=c0a8b777d8f103457a91d3b8ccdb13918b991369347a1d947fdc18f029a619c5", "name": "Berry Haze", "description": "Berry Haze, also known as “Very Berry Haze,” is a 100% sativa hybrid strain created through crossing the infamous Strawberry Cough X Super Silver Haze strains. If you haven't tried this sweet variation of Haze, you're definitely missing out. Berry Haze has a sweet flavor that's remarkably like strawberries, much like its Strawberry Cough parent, with just a touch of sweet fruity haze and kush. The aroma takes a more pungent turn, with a touch of spicy earth and sweet berries and kush. Berry Haze buds have dense olive green spade-shaped nugs with sparse orange hairs and a thick sticky coating of sweet syrupy resin. Berry Haze has a high typical of any haze, with clear-headed effects that are both energizing yet slightly hazy around the edges. The high starts with an uplifted energetic effect that boosts your mood and leaves you feeling abnormally social, talking anyone's ear off that will listen to you. As this high builds, you may fall into a giggly state that can be slightly overwhelming to those patients who suffer from anxiety. Because of these effects, Berry Haze is said to be perfect for treating chronic pain, depression, migraines, fatigue, and chronic stress.", "effects": ["Cerebral", "Sociable", "Uplifting"], "aromas": ["Berry", "Dank", "Earthy", "Fruity", "Kush", "Sweet"], "flavors": ["Berry", "Strawberry", "Sweet"], "relieves": ["Berry", "Strawberry", "Sweet"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Jane": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/berry-jane", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-jane/JBb2nd4o/berry-janejpg.jpg?t=54ad92b64cd53d3e2ae6faf026f5f497665fb9c1e03b875ca6e18b907986905c", "name": "Berry Jane", "description": "Berry Jane is a sativa dominant hybrid strain (70% sativa/30% indica) created through crossing the delicious Fruity Pebbles OG X Blueberry strains. Love a great flavor and a super energizing high? Berry Jane is made for you. This lovely lady packs a sweet and fruity strawberry candy flavor with hints of tongue-tingling sugar upon exhale. The aroma is just as delightful, with a sweet strawberry berry overtone accented by sugary candy and fresh fruits. The Berry Jane is one that's perfect for a lazy day when you need to get up and moving, but don't have much of anything to focus on. You'll be hit with an almost giddy energy a few minutes after your final exhale as the Berry Jane rush into your brain. You'll feel instantly focused and motivated with a burning creativity that gets your mental gears turning and you jumping on any mental or artistic task at hand. But you'd better hurry – this focus will soon wane and leave you feeling totally stoned and unable to do much of anything but smile and giggle with those around you. Thanks to these effects and its high 29-30% average THC level, Berry Jane is often chosen to treat those suffering from conditions such as chronic stress or anxiety, depression or mood swings, chronic fatigue and ADD or ADHD. This bud has oversized and heavy minty green nugs with lots of thin orange hairs and a coating of frosty, tiny milky white crystal trichomes.", "effects": ["Creative", "Energizing", "Euphoria", "Focus", "Sociable", "Uplifting"], "aromas": ["Berry", "Fruity", "Spicy", "Strawberry", "Sweet"], "flavors": ["Berry", "Candy", "Fruity", "Strawberry", "Sugary", "Sweet"], "relieves": ["Berry", "Candy", "Fruity", "Strawberry", "Sugary", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Lemonade": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/berry-lemonade", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-lemonade/8TzA2sdi/strawberry-lemonadejpg.jpg?t=e7c7e293500395dd5b7dd7e21046d0845e2dfaf2b5f795e8cfe81d594167eee2", "name": "Berry Lemonade", "description": "Berry Lemonade is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the mouthwatering Strawberry Lemonade X Blueberry Lemonade strains. Named for its celebrity parentage and insanely delicious flavor, Berry Lemonade is the perfect delicious hybrid to help you kick back and relax. Like its name suggests, Berry Lemonade has a sweet and fruity blueberry berry taste accented by sour, sugary lemons and a touch of spice. The aroma follows the same profile with a sweet fruity berry smell accented by sour lemons, fresh earthiness and a hint of spice. The Berry Lemonade high isn't quite as vibrant as the smell, with a lifted start that soon settles into deeply soothing relaxation. You'll feel a lift from the onset as your mind is filled with a sense of euphoria that leaves you with no room for negative moods or racing thoughts. A soothing body high comes next, creeping over you slowly before suddenly taking hold and dropping you off into a buzzy yet calming state. Thanks to these effects and its high 18-20% average THC level, Berry Lemonade is often chosen to treat those patients suffering from conditions such as depression, chronic pain, insomnia, chronic stress and headaches or migraines. This bud has grape-shaped dense forest green nugs with deep olive undertones, thin orange hairs and chunky amber crystal trichomes.", "effects": ["Creative", "Euphoria", "Giggly", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Berry", "Blueberry", "Citrus", "Earthy", "Fruity", "Lemon", "Sour"], "flavors": ["Berry", "Blueberry", "Fruity", "Sour", "Strawberry", "Sugary", "Sweet"], "relieves": ["Berry", "Blueberry", "Fruity", "Sour", "Strawberry", "Sugary", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Melon-O": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/berry-melon-o", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Berry Melon-O", "description": "Berry Melon-O is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the iconic (Melon Bred X Melon Bred 2) X Blueberry Bred strains. Named with a cheeky nod to one of your parents' favorite singers, Berry Melon-O packs a super sweet flavor and an even sweeter high that will have you falling in love in no time at all. Like its name suggests, Berry Melon-O has a sweet and fruity berry and melon flavor accented by creamy tropical fruits and sour citrus. The aroma is very similar, with a bouquet of fresh creamy berries accented by super sour citrus and spicy black pepper. The Berry Melon-O high is just as mouthwatering, with heavy effects that will smash into both mind and body, leaving you hopelessly immovable and super happy about it. You'll feel an instant rush of cerebral calm wash over you as soon as you exhale, providing immediate mental relief and replacing any bad moods or racing thoughts with hazy happiness. A deep physical relaxation comes next, washing over you in warming waves and lulling you into a state of pure ease. Combined with its super high 23-29% average THC level, these effects give Berry Melon-O an edge in treating chronic pain, insomnia, chronic stress, cramps or muscle spasms, depression and arthritis. This bud has fat spade-shaped forest green nugs with dark purple undertones, thin orange hairs and tiny white trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Happy", "Relaxing", "Uplifting"], "aromas": ["Berry", "Fruity", "Herbal", "Peppery", "Sour", "Spicy", "Tropical"], "flavors": ["Blueberry", "Citrus", "Creamy", "Fruity", "Sour", "Sweet", "Tropical"], "relieves": ["Blueberry", "Citrus", "Creamy", "Fruity", "Sour", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Pie": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/berry-pie", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-pie/oI139gZq/berry-piejpg.jpg?t=6fedb9109eb768d34efff7ed7c4621f3edb3a1b960c0446f576a672fd4809759", "name": "Berry Pie", "description": "Berry Pie is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the delicious Girl Scout Cookies X Blueberry strains. Named for its celebrity parentage and amazing flavor, Berry Pie is the perfect choice for any hybrid lover. Like its name suggests, Berry Pie packs a super sweet and fruity blueberry berry flavor with a nutty vanilla exhale. The aroma is very similar, much like a freshly baked blueberry pie with hints of nutty earthiness to it, too. The Berry Pie high is just as delightful, with a soothing and happy overtone that will have you feeling stimulated yet kicked back for hours on end. You'll feel a cerebral buzz hit you first as your mind is activated, awakening your sense of focus while infusing you with a touch of mental energy. At the same time, a lightly relaxing body high will begin to work its way into your limbs, helping you stretch out and get moving without affecting your energy level too much. With these effects and its high 21-25% average THC level and 0-1% CBD level, Berry Pie is often chosen to treat those suffering from conditions such as depression, chronic fatigue, ADD or ADHD and chronic stress or PTSD. This bud has oversized and heavy emerald-green nugs with lots of thin orange hairs, rich golden undertones and a coating of chunky, frosty white crystal trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Energizing", "Tingly", "Uplifting"], "aromas": ["Berry", "Blueberry", "Earthy", "Fruity", "Nutty", "Sweet"], "flavors": ["Berry", "Blueberry", "Cherry", "Fruity", "Sweet", "Vanilla"], "relieves": ["Berry", "Blueberry", "Cherry", "Fruity", "Sweet", "Vanilla"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Runtz": {"url": "https://www.allbud.com/marijuana-strains/hybrid/berry-runtz", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-runtz/dDeLvDjk/b78b6df2-c85b-413b-bd90-f97af253e902jpe.jpg?t=5d5ec958fd26a3f097726ed584b5c6f00026f57401a86a939eaaf3144cb5fd97", "name": "Berry Runtz", "description": "Berry Runtz is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the delicious Zkittlez X Gelato strains. A fantastic choice for any hybrid lover, Berry Runtz packs a smooth high with an amazing flavor that will leave your coming back for more. It starts with a mental lift that fills your mind with a sense of energy and a touch of motivation that boosts your mood, infuses you with euphoria and has you flying for hours on end. At the same time, a calming body high will wash over you, helping you to settle down and relax, free of any physical aches or pains to speak of. Combined with its high 21% + average THC level, these effects make Berry Runtz a great choice for treating conditions such as chronic stress or anxiety, depression or mood swings, chronic pain, insomnia and chronic fatigue. This bud has a super sweet and fruity berry blueberry candy flavor with a touch of sour lemon upon exhale. The aroma is very similar, with a sour citrusy lemon overtone accented by fresh fruity berries. Berry Runtz buds have dense popcorn-shaped minty green nugs with red-orange hairs, deep blue-purple undertones and a coating of frosty golden-white crystal trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Energizing", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Berry", "Blueberry", "Citrus", "Fruity", "Lemon", "Sour"], "flavors": ["Berry", "Blueberry", "Candy", "Citrus", "Fruity", "Sour", "Sweet"], "relieves": ["Berry", "Blueberry", "Candy", "Citrus", "Fruity", "Sour", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Sour Creme": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/berry-sour-creme", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-sour-creme/5047/fsig9apcgc9fgsjqwzjf.jpg?t=2ed72f62454262f4b1db06a5ca52108b828ce84d272cca3c7f667acae7cda209", "name": "Berry Sour Creme", "description": "Berry Sour Creme is an evenly balanced hybrid (50% sativa/50% indica) strain created through a cross of the hugely popular (Cinderella 99 X Sour Diesel) X Blueberry strains. This bud can be slightly sativa dominant in nature as well, depending on the breeding style and exact parentage. Berry Sour Crème is infamous for its flavor that is exactly like it sounds – sweet and sour cream with buttery berries! The aroma is a little more dense, with sour diesel accented by creamy berries and a sugary sweetness that can be detected as the nugs are burned. This bud has insanely frosty thick popcorn shaped forest green nugs that are covered in furry orange hairs and visible droplets of resin. The Berry Sour Crème high is very deep and introspective, with a happy yet sedative effect overall. The high starts with a stoney head buzz that relieves any mental pain and instantly lifts your mood. This hazy state drops you into deep introspection, leaving you spacey and distant, yet blissfully happy and completely peaceful. These heady effects coupled with its average THC level of 21% make Berry Sour Crème the perfect choice for patients suffering from conditions such as chronic stress or anxiety, migraines, depression, chronic pain, and insomnia.", "effects": ["Happy"], "aromas": ["Diesel", "Earthy", "Pungent", "Sour", "Sweet"], "flavors": ["Berry", "Creamy", "Sweet"], "relieves": ["Berry", "Creamy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Stomper": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/berry-stomper", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-stomper/QbEGie4x/16695911381172845803068887804061jpg.jpg?t=23fda8818a36fc0de7e1dbbe637a5bddbb0e62fba11a154f10f3c78a1a10ba6a", "name": "Berry Stomper", "description": "Berry Stomper is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the iconic Kushberry X Lemon Glue Stomper strains. This heavy-hitter packs a boatload of soothing effects and a delicious flavor that are certain to leave you craving more. The high hits you between the eyes almost as soon as you exhale, launching your brain into a state of tingly happiness that’s free of any bad moods or negative thoughts. This tingle will soon work its way throughout the rest of your body, lulling you into a state of physical calm and ease that allows you to stretch out and relax without causing any sedation to speak of. With these effects and its high 18-19% average THC level, Berry Stomper is often chosen to treat those patients suffering from conditions such as chronic pain, appetite loss or nausea, cramps or muscle spasms and chronic stress. This bud has a sweet and fruity blueberry berry flavor with a tangy sour lemon-lime exhale. The aroma is very much the same, although it does have a touch of spicy diesel and earthy flowers to it, too. Berry Stomper buds have heart-shaped dense forest green nugs with golden undertones, sparse red-orange hairs and a coating of tiny, golden-white crystal trichomes.", "effects": ["Calming", "Euphoria", "Happy", "Hungry", "Relaxing", "Uplifting"], "aromas": ["Berry", "Blueberry", "Diesel", "Earthy", "Flowery", "Fruity", "Spicy", "Sweet"], "flavors": ["Berry", "Blueberry", "Citrus", "Fruity", "Sour", "Sweet"], "relieves": ["Berry", "Blueberry", "Citrus", "Fruity", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berry Sunset": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/berry-sunset", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berry-sunset/SfJsva9N/49jpg.jpg?t=bc176d2f4b930cb10d5b919df5d2b9c5c16c5f277fe794ea272b0e5630394ce2", "name": "Berry Sunset", "description": "Berry Sunset is a sativa dominant hybrid strain (80% sativa/20% indica) created through crossing the classic Dutch Haze X Blue Dream strains. This celebrity child brings on the best of both of its parent strains in both flavor and effects. It has a sweet and spicy blueberry berry taste that's accented by touches of diesel upon exhale. The aroma is of spicy diesel and sweet blueberries with hints of pungency that intensify as the nugs are broken apart and burned away. Berry Sunset buds have rounded and fluffy bright neon green nugs with a mix of deep blue and purple undertones, long thin amber hairs and a coating of chunky frosty purple-tinted trichomes. The Berry Sunset high is perfect for a day when you have a lot to get done, with lifted and focused effects that slowly grow and expand as the high continues. You'll feel a sense of lifted motivation hit you almost as soon as you exhale, filling you with the mental energy that you need to really get moving on anything. In combination with its super high 20-26% THC level and 0-3% CBD level, these effects make Berry Sunset the perfect choice for treating chronic fatigue, depression, ADD or ADHD and chronic stress.", "effects": ["Cerebral", "Energizing", "Euphoria", "Focus", "Motivation", "Uplifting"], "aromas": ["Berry", "Diesel", "Fruity", "Pungent", "Spicy", "Sweet"], "flavors": ["Berry", "Blueberry", "Diesel", "Fruity", "Spicy", "Sweet"], "relieves": ["Berry", "Blueberry", "Diesel", "Fruity", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Berserker": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/berserker", "img": "https://media.allbud.com/resized/350x242/media/images/strain/berserker/5egEi4lZ/83-cjpeg.jpg?t=e712f6882394447020f21c685027d0f26c1ed1ba3f2f0d935d8543cc4a4c6092", "name": "Berserker", "description": "Berserker is an indica dominant hybrid strain (75% indica/25% sativa) created through a potent cross of the classic Thor's Hammer X Skywalker OG strains. Like its name suggests, Berserker has a quick-hitting high that runs through you with unmatched power before leaving you immovable and fully sedated in its wake. These effects hit you almost as soon as you experience your final exhale, filling you with a hard-hitting lifted euphoria that instantly erases any negative or racing thoughts. A deeply calming and relaxing body high comes next, slamming into your physical form and leaving you fully couch-locked and soothed from head to toe. This full-bodied high quickly turns sedative, leaving you dozing off before you know it. These sleepy effects combined with its super high 20% + average THC level make Berserker a great choice for treating those suffering from conditions such as chronic stress or anxiety, depression, mood swings, chronic fatigue and insomnia. Berserker has a sweet and fruity tropical citrus flavor with a sugary exhale. The aroma is of sour citrus and pungent earth with a dank overtone of rotting tropical fruits and lemon. Berserker buds have fat oversized bright neon green nugs with thin orange hairs and a coating of tiny white crystal trichomes.", "effects": ["Body High", "Calming", "Euphoria", "Relaxing", "Sleepy"], "aromas": ["Citrus", "Dank", "Lemon", "Pungent", "Sour", "Sweet", "Tropical"], "flavors": ["Citrus", "Fruity", "Spicy", "Sugary", "Sweet", "Tropical"], "relieves": ["Citrus", "Fruity", "Spicy", "Sugary", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Best Shit Ever": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/best-shit-ever", "img": "https://media.allbud.com/resized/350x242/media/images/strain/best-shit-ever/6vMUhwLm/best-shit-everjpg.jpg?t=558108b085d2667619d31963d168f2ae7a1fb9f547abc658a7f65d89b509a74c", "name": "Best Shit Ever", "description": "Best Shit Ever is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the potent Lemon Master X Sage N Sour strains. One taste of this delicious bud and you’ll know why it earned its name. Best Shit Ever has a sweet and sour citrusy lemon taste accented by hints of fresh peppery sage and rich herbs. The aroma follows the same profile, with a sour lemony overtone accented by herbal sage and rich spicy diesel. The Best Shit Ever high is just as delicious, with soothing overtones that will help relax both mind and body while also stimulating it with arousing tingles. You’ll feel mentally boosted with a sense of sociability and creativity that’s perfect for any social situation. A hint of the giggles comes next, leaving you falling into uncontrollable laughter at the drop of a hat. A relaxing body high completes the experience, helping you to feel kicked back and without a care in the world. Thanks to these effects and its high 21-26% average THC level, Best Shit Ever is often chosen to treat conditions such mood swings or depression, chronic stress, bipolar depression and chronic pain. Best Shit Ever buds have dense pepper-shaped forest green nugs with deep leaves, thin red-orange hairs and a coating of tiny, bright white crystal trichomes.", "effects": ["Body High", "Cerebral", "Creative", "Giggly", "Sociable", "Tingly", "Uplifting"], "aromas": ["Citrus", "Earthy", "Lemon", "Peppery", "Sage", "Sour", "Spicy"], "flavors": ["Citrus", "Lemon", "Peppery", "Sage", "Sour", "Sweet"], "relieves": ["Citrus", "Lemon", "Peppery", "Sage", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Betazoid": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/betazoid", "img": "https://media.allbud.com/resized/350x242/media/images/strain/betazoid/5048/ufkiwvkbrm1lkalzjgpt.jpg?t=6da3e40334f6088ecd758e0d255a6eb9df8432052a6284ba708ab4f58a14c888", "name": "Betazoid", "description": "Betazoid is a sativa dominant hybrid (80% sativa/20% indica) strain created as a cross between the insanely popular and potent Grapefruit X Northern Lights X African Sativa strains. This dank bud was named for its ability to help the breeder's close friend kick a harmful drug habit, and it boasts a moderate THC level that ranges from 14-19% on average. Users describe the Betazoid high as one that is intensely alert with cerebral effects typical of a powerful sativa strain. You'll feel insanely uplifted with ebbing levels of creative energy and inspiration without the overwhelming feelings of anxiety typical of a strong sativa. This level of alertness translates over into an intense focus that lends itself to any project at hand. Due to these potent effects, Betazoid is said to be an ideal strain for treating patients suffering from conditions such as addiction, chronic pain due to injury or illness, mild cases of depression, and chronic anxiety. Betazoid buds have a delicious aroma of spicy earthy grapefruit and a taste of sweet peppery grapefruit with a hint of fragrant pine upon exhale. These buds have small to medium-sized bright neon green nugs with fiery orange hairs and a sparse layer of chunky white trichomes.", "effects": ["Creative", "Energizing", "Focus"], "aromas": ["Earthy", "Grapefruit", "Pepper"], "flavors": ["Spicy", "Sweet"], "relieves": ["Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Betsy": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/betsy", "img": "https://media.allbud.com/resized/350x242/media/images/strain/betsy/4426/i98o8srnr1pmwoq3yibs.jpg?t=22e72f40305a260f695f3b44a7891e9677a60cb3ef27cb40ec00ff52721c6433", "name": "Betsy", "description": "Betsy, also known as “Betsey” or “Betsie,” is an old school San Diego sativa dominant hybrid strain that is thought to be a descendant of Hogsbreath, although nobody really knows for sure. Like Hogsbreath, Betsy is infamous for its insanely pungent and potent smell that fills any room it's in. It has a sweet and skunky aroma that has touches of dank tropical fruits that are almost rotting. The taste is of sweet mangos with a hint of earthy pungency and spice upon exhale that can be overwhelming to some. Betsy nugs are super sticky leafy cone-shaped brownish green nugs with dark orange hairs and a frosty coating of cloudy white trichomes. The Betsy high is very sativa heavy in nature with all the old school effects that users love. The high starts off strong with a powerful hit to the head of a happy relaxed state that's slightly hazy and spacey. A body buzz comes next that builds and builds and builds, leaving you completely stoned, couch-locked, and hungry beyond all reason. Because of these effects and its insanely high 17-21% average THC level, Betsy is often used to treat conditions such as chronic pain, migraines or headaches, chronic stress or anxiety, and appetite loss.", "effects": ["Body High", "Happy", "Hungry", "Uplifting"], "aromas": ["Dank", "Pungent", "Skunky", "Sweet"], "flavors": ["Sweet"], "relieves": ["Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Better Than Bubba": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/better-bubba", "img": "https://media.allbud.com/resized/350x242/media/images/strain/better-bubba/1vS18GO4/better-than-bubbajpg.jpg?t=06cc8fe9825a33cb29410ff0729bd934ba7a0f50d7c7894f580b2f862168263d", "name": "Better Than Bubba", "description": "Better Than Bubba is a rare indica dominant hybrid strain created through crossing the infamous Pre-98 Bubba Kush with an unknown hybrid strain. This potent bud packs a super heavy high that's perfect for kicking back after a long and stressful day when sleep just won't come. You'll feel a slightly lifted onset at the start of the high that fills you with a sense of warming euphoria, pushing out negative thoughts and leaving you totally at ease. As your mind lifts to new heights, your body will start to drop off into a super sedative body high that leaves you sleepy and totally immovable for hours on end. With these effects and its super high 32% average THC level, Better Than Bubba is often chosen to treat conditions such as chronic pain, muscle spasms, chronic anxiety, and nausea or appetite loss. This bud has a super pungent flavor reminiscent of a strong cup of coffee topped with herbs and spices. The aroma is very dank as well with a spicy earthy overtone that quickly turns sour as the nugs are burned. Better Than Bubba buds have small rounded dark olive green nugs with rich purple undertones, bright orange hairs, and a super thick frosty white blanket of crystal trichomes.", "effects": ["Body High", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Coffee", "Dank", "Earthy", "Herbal", "Pungent"], "flavors": ["Coffee", "Herbal", "Spicy"], "relieves": ["Coffee", "Herbal", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bettie Page": {"url": "https://www.allbud.com/marijuana-strains/hybrid/bettie-page", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bettie-page/zyGDS5tk/1519856236442jpg.jpg?t=5dd083616f70da2a79f87a81c948606200b21bbc3474254d77cc7f6dce32ce9c", "name": "Bettie Page", "description": "Bettie Page is an evenly balanced hybrid (50% indica/50% ruderalis) strain created through a cross of an unknown ruderalis and an unknown indica. Although its parentage is unknown, Bettie Page is beloved for her exotic terpene profile and relatively mild effects. The high starts with a slight lift of energy and euphoria that leaves you creatively inspired with a tendency to talk and talk and talk. This effect is accompanied by a slowly building body buzz that leaves you slightly couch-locked and spacey although still able to get up and move if need be. Because of these effects and its medium average THC level of 12-14%, Bettie Page is said to be perfect for treating conditions such as depression, inflammation, chronic pain, muscle spasms, and chronic stress. Although its terpene profile is what gets you hooked on this lady, the flavor is why you stay. As you smoke Bettie, you’ll detect sweet ripe berries topped with creamy cheese and earthy spice. The aroma is very similar with cheesy pungency and rich blueberries and cream. This bud has round and leafy light green nugs with rich amber hairs and a frosty coating of tiny amber colored crystal trichomes.", "effects": ["Aroused", "Creative", "Relaxing", "Sociable"], "aromas": ["Berry", "Cheese", "Dank", "Earthy", "Fruity", "Pungent"], "flavors": ["Berry", "Blueberry", "Cheesy", "Citrus", "Fruity", "Pine"], "relieves": ["Berry", "Blueberry", "Cheesy", "Citrus", "Fruity", "Pine"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Beyond Blueberry": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/beyond-blueberry", "img": "https://media.allbud.com/resized/350x242/media/images/strain/beyond-blueberry/6Ie2ohjh/78jpg.jpg?t=71d4e1957c01f52acfef9376a59a8bd5db45cc2f3d5fa7056a0e6d5a53b2f964", "name": "Beyond Blueberry", "description": "Beyond Blueberry is a slightly indica dominant hybrid strain (60% indica/40% sativa) created as a phenotype of the delicious Sundae Driver strain, a cross of Grape Pie X Fruity Pebbles OG. Best known for its insanely tasty flavor, Beyond Blueberry is one bud that you'll have to experience at least once in your life. This bud has a super sweet and creamy blueberry flavor with a sharp sour apple exhale. The aroma is very similar, with a rich blueberry overtone that's accented by fresh earth and spicy fruits. The Beyond Blueberry high settles in almost as soon as you exhale, washing over your mind with an almost sticky feeling of pure calm and ease. As your mind settles into this happy state, a relaxing body high will work its way into your limbs, leaving you slightly couch-locked although not too sedated. Combine these effects with its high 17-18% average THC level and you get the perfect recipe for treating conditions such as chronic stress or anxiety, appetite loss or nausea, inflammation, insomnia and chronic pain. Beyond Blueberry buds have dense and fat rounded minty green nugs with thick orange hairs and a coating of frosty tiny light amber crystal trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Berry", "Blueberry", "Earthy", "Fruity", "Sour", "Spicy"], "flavors": ["Berry", "Blueberry", "Creamy", "Fruity", "Spicy", "Sweet"], "relieves": ["Berry", "Blueberry", "Creamy", "Fruity", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Beyond Blue Dream": {"url": "https://www.allbud.com/marijuana-strains/hybrid/beyond-blue-dream", "img": "https://media.allbud.com/resized/350x242/media/images/strain/beyond-blue-dream/OkKOPz0Z/beyond-blue-dreamjpg.jpg?t=e7e0dc1ba7d639124c702884fbab4a4b14fcc9fd508eea3ee3f7eead9c693ae3", "name": "Beyond Blue Dream", "description": "Beyond Blue Dream is a rare evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the infamous Super Silver Haze X Blue Dream strains. If you're a fan of Blue Dream, you'll totally be in love with Beyond Blue Dream after just one toke. The Beyond Blue Dream high is just as relaxing and dreamy as its celebrity parents, with long-lasting effects that will have you kicking back with ease. You'll feel a lift at the onset of the high that fills you with a sense of euphoria and deep happiness that leaves you hazy and unfocused. As your mind fades further and further, you'll start to feel dreamy visions wash over you as a relaxing body high locks you into place. Thanks to these effects and its high 22-25% average THC level, Beyond Blue Dream is often chosen to treat those suffering from conditions such as chronic pain, depression, chronic fatigue, insomnia, and chronic stress. This bud has as super sweet blueberry berry flavor wit ha rich fruity sour exhale. The aroma is pungent and herbal with an earthy overtone that's accented by spicy berries and herbs. Beyond Blue Dream buds have tapered heart-shaped forest green nugs with rich blue undertones, thin orange hairs, and a frosty thick coating of frosty white blue-tinted crystal trichomes.", "effects": ["Cerebral", "Creative", "Euphoria", "Happy", "Uplifting"], "aromas": ["Berry", "Earthy", "Fruity", "Herbal", "Pungent", "Sour"], "flavors": ["Berry", "Blueberry", "Fruity", "Herbal", "Sour"], "relieves": ["Berry", "Blueberry", "Fruity", "Herbal", "Sour"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Beyond The Brain": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/beyond-brain", "img": "https://media.allbud.com/resized/350x242/media/images/strain/beyond-brain/7893/ecxrzjoy4wkfcqdsyczb.jpg?t=39c3b92fea22678f34727f70001fb5f6a0cc2061369cfd2c8769916b169800f7", "name": "Beyond The Brain", "description": "Beyond the Brain is a rare sativa dominant hybrid (80% sativa/20% indica) strain created through crossing the classic Colombian Sativa X Haze X Satori strains. This bud was a limited edition creation in 2010 from the infamous Mandala Seeds and is pretty tough to find on the market these days. Nonetheless, this bud is sought after for its brain bending effects and eye opening visions that truly can expand your mind. You'll feel an almost immediate onset of a lifted clear-headed high just a few minutes after your first toke. This will leave you alert and focused as your mind starts to wander and focus on the tiny details of things. As your thought expands, you'll find yourself experiencing deep philosophical visions and engaging in conversations with those around you. In combination with its high 12-25% average THC level, these long-lasting effects make Beyond the Brain perfect for treating conditions such as chronic pain, anxiety or stress, appetite loss, nausea, and depression. This bud has a sweet minty pine flavor and an aroma of fresh thyme and herbs with just a touch of menthol as the nugs are burned. Beyond the Brain buds have small fluffy bright neon green nugs with amber hairs and a coating of milky golden crystal trichomes.", "effects": ["Energizing", "Euphoria", "Focus", "Sociable"], "aromas": ["Earthy", "Herbal", "Pine", "Sage"], "flavors": ["Herbal", "Menthol", "Pine", "Sweet"], "relieves": ["Herbal", "Menthol", "Pine", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BF Blue Cheese": {"url": "https://www.allbud.com/marijuana-strains/indica/bf-blue-cheese", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bf-blue-cheese/DnpSPNAZ/1031191326jpg.jpg?t=3b0114512a874d8ad1b3d68791bca58641c3759b08c9994c515fd10040a899bc", "name": "BF Blue Cheese", "description": "BF Blue Cheese, also known as “Barney's Farm Blue Cheese” to many members of the cannabis community, is a 100% pure indica strain created as a potent cross of the infamous Skunk #1 X UK Cheese X Blueberry strains. This dank bud boasts a moderately high THC level that ranges from 18-20% on average as well as a CBD level between 1-1.5% and a myriad of powerful indica effects. Users describe the BF Blue Cheese high as one that slowly creeps up on you and comes on strong, leaving you completely couch-locked and body stoned. You'll be utterly sedated with mental clarity. A warming body buzz will spread throughout your body leaving you completely relaxed and pain-free with a sense of bliss. Upon the comedown, you'll be eased into a deep and peaceful sleep that lasts for hours. Due to these effects, this strain is said to be ideal for treating chronic pain and muscle spasms. BF Blue Cheese has an aroma of pungent blueberry cheese and a taste of earthy sweet blueberry with a creamy cheesy aftertaste. These buds have medium-sized spade-shaped dark forest green nugs with rich purple undertones and hairs as well as a fine layer of frosty white trichomes and sweet sticky resin.", "effects": ["Body High", "Relaxing", "Sleepy"], "aromas": ["Blueberry", "Cheese", "Pungent", "Sweet"], "flavors": ["Cheesy", "Sweet"], "relieves": ["Cheesy", "Sweet"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BF G13 Haze": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/bf-g13-haze", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bf-g13-haze/3203/orteqxzopve0hy7ufbre.jpg?t=381ad994719830047c4d1fd88117cfcd60e5e0082f5a5634872e7ac91f3fd13d", "name": "BF G13 Haze", "description": "BF G13 Haze, also known as “Barney's Farm G13 Haze” to many members of the cannabis community, is a sativa dominant hybrid (80% sativa/20% indica) strain created as a potent cross between the infamous G13 X Hawaiian Sativa strains. Breeders combined the infamous G13 strain rumored to have been created from a 1970's secret US federal medical marijuana distribution program with their favorite delicious Hawaiian Sativa to create this potent and tasty strain. This dank bud boasts a THC level that ranges from 19-23% on average and a myriad of sativa effects. Users describe the BF G13 Haze high as having an intense cerebral head high onset that leaves them uplifted, euphoric, and insanely energetic. You'll feel motivated and creatively stimulated with a sense of bliss. This is accompanied by a note of relaxing body buzzing indica effects that serve to anchor you to the real world as your energy spikes. Due to these potent effects, BF G13 Haze is ideal for treating conditions such as stress, fatigue, chronic pain, and depression. This bud has an aroma and taste of hazy ripe fruit with a hint of spicy sandalwood. BF G13 Haze buds have dark forest green arrow-shaped nugs with amber hairs and a frosty layer of trichomes.", "effects": ["Body High", "Cerebral", "Euphoria", "Uplifting"], "aromas": ["Fruity", "Pungent", "Sweet"], "flavors": ["Fruity", "Sage", "Spicy", "Sweet"], "relieves": ["Fruity", "Sage", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Biesel": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/biesel", "img": "https://media.allbud.com/resized/350x242/media/images/strain/biesel/W835dnmK/bieseljpg.jpg?t=584065484d17a230d59e56ae7cb30dbb0b0c1cebf25f6d49da92f33f861eec65", "name": "Biesel", "description": "Biesel is a super rare slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the classic Shark Haze X Sour Diesel strains. Perfect for anyone who loves a heavy stone, Biesel packs an insanely potent high thanks to a THC level that bottoms out at about 23% on average. The high starts with a subtle lifted effect that eases away any negative or racing thoughts, replacing them with a heaviness that leaves you eyes and head drooping. As your mind falls further and further into hazy stoney bliss, your body will begin to follow suit, leaving you hopelessly couch-locked and immovable for hours and hours on end. This soon becomes sleepy, which can have you dozing off fairly quickly. Thanks to these hard-hitting effects and its high THC level, Biesel is said to be perfect for treating chronic pain, depression, chronic stress or anxiety, and cramps or muscle spasms. This bud has a skunky sour flavor with a sharp hint of savory diesel upon exhale. The aroma is of fresh herbs and spices with a heavy pungent overtone that turns to dank diesel as the nugs are burned. Biesel buds have spade-shaped minty green nugs with lots of dark orange hairs and a coating of thick frosty clear crystal trichomes.", "effects": ["Body High", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Diesel", "Earthy", "Pungent", "Sour", "Spicy"], "flavors": ["Diesel", "Herbal", "Skunky", "Sour", "Spicy"], "relieves": ["Diesel", "Herbal", "Skunky", "Sour", "Spicy"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Bambo": {"url": "https://www.allbud.com/marijuana-strains/sativa/big-bambo", "img": "https://media.allbud.com/resized/350x242/media/images/strain/big-bambo/3998/i6irkw8yymgqj3yhvmjp.jpg?t=909d156f2d1e248403ae9aa0e3f25dd154faf21bf7d499a61f8e831a2f69e03d", "name": "Big Bambo", "description": "Big Bambo is an extremely rare 100% pure sativa strain from Jamaica with unknown genetics. This strain was most popular back in the early 90s for use in joints, and since then has almost completely fallen out of use by the cannabis community. However, now and again this strain will appear in dispensaries in the US for short periods of time, mainly in Southern California. The Big Bambo bud has medium density, bright neon green nugs with patches of dusty green and dark olive green leaves. These nugs are decked with fiery orange hairs and a thick layer of white crystal trichomes and fine syrupy sweet resin. Big Bambo has an aroma of fresh earthy grass and a taste of earthy spice with an aftertaste of lemony herbs. Users have described the Big Bambo high as very clear-headed, with energized and motivated feelings that inspire them to get up off the couch and focus on what needs to be done. This bud will leave you feeling euphoric and offers a clean feeling that is ideal for morning and daytime use. Due to these potent sativa effects and THC level ranging from 10-16%, this strain is perfect for treating anxiety, depression, and attention disorders, including ADD and ADHD.", "effects": ["Energizing", "Happy"], "aromas": ["Grassy"], "flavors": ["Spicy"], "relieves": ["Spicy"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Bang 2": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/big-bang-2", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Big Bang 2", "description": "Big Bang 2 is an indica dominant hybrid strain (70% indica/30% sativa) created through an unknown combination of other hybrid strains, although it is known to be a member of the Skunk family. A hard-hitting indica that's perfect for those nights when sleep just doesn't seem to come your way, Big Bang 2 packs soothing and happy effects that will melt away stress and hep your mind truly settle down. You'll feel happy from start to finish with this bud, filled with a carefree sense of bliss that instantly washes away any negative thoughts and bad moods. In fact, thought will be all but impossible in this state. At the same time, a relaxing physical high will slowly take hold of your body, helping you to settle down before dropping you off of the face of the earth into sweet sedation. With these effects and its super high 22-25% average THC level, Big Bang 2 is often chosen to treat conditions such as chronic pain, insomnia, chronic stress, mood swings and depression. This bud has a sweet and fruity apple citrus flavor with light touches of flowery skunk upon exhale. The aroma is skunky and flowery with a beautiful rose overtone accented by sour apples, sharp citrus and freshly chopped woods. Big Bang 2 buds have oversized rounded forest green nugs with thin dark red-orange hairs, golden undertones and tiny golden white crystal trichomes.", "effects": ["Calming", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Apple", "Citrus", "Flowery", "Rose", "Skunky", "Sour", "Woody"], "flavors": ["Apple", "Berry", "Flowery", "Fruity", "Rose", "Sweet"], "relieves": ["Apple", "Berry", "Flowery", "Fruity", "Rose", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Blue": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/big-blue", "img": "https://media.allbud.com/resized/350x242/media/images/strain/big-blue/h3XYXO50/2d7ee374-a14a-499b-860e-e71b6136ad74jpe.jpg?t=ab11f8bf2fd1bb28b08a5831f986c789f57ec44eebb244e0a1431e185b0bcaf8", "name": "Big Blue", "description": "Big Blue is a rare indica dominant hybrid strain (65% indica/35% sativa) created through crossing the iconic Northern Lights X Blueberry strains. Named for its gorgeous appearance, Big Blue is the perfect celebrity child that wonderfully combines the best of both of its beloved parent strains. Big Blue buds have lumpy oversized bright neon green nugs with deep blue undertones, vivid orange hairs, and a coating of chunky frosty bright white crystal trichomes. As you pull apart each sticky little nugget, aromas of sweet grapes and fruity berries are released with a slightly sour pungent overtone as the nugs are broken apart and burned. The flavor is of fresh sweet berries and fruits with a touch of spicy herbs upon exhale. The Big Blue high is just as delicious as the flavor, with a relaxing overtone that's best suited for a lazy night in when you want to kick back and catch up on Netflix before passing out. You'll feel totally relaxed throughout the duration of the high with a heavy sedation that drops you off into a deep and peaceful sleep as you begin to come down. Thanks to these effects and its high 15-23% average THC level, Big Blue is said to be perfect for treating those suffering from conditions such as chronic pain, insomnia, depression, and cramps or muscle spasms.", "effects": ["Body High", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Earthy", "Fruity", "Sour", "Spicy", "Sweet"], "flavors": ["Berry", "Blueberry", "Fruity", "Grape", "Sour", "Sweet"], "relieves": ["Berry", "Blueberry", "Fruity", "Grape", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Blue Mountain": {"url": "https://www.allbud.com/marijuana-strains/sativa/big-blue-mountian", "img": "https://media.allbud.com/resized/350x242/media/images/strain/big-blue-mountian/5855/ntqchvug5wzncaqbpkdo.jpg?t=66ff9c4bddf14d50bb3387e170a989b171478962f4ef77ed774caf0b391fb1b6", "name": "Big Blue Mountain", "description": "Big Blue Mountain is a 100% sativa strain that is thought to be a child of the infamous Blue Mountain Fire strain. Like its name suggests, this bud has super dense and heavy buds that have a slight blue tint to them. The nugs are thick and dense bright neon green balls with bright orange hairs and a thick coating of crystal trichomes that appear to be gold in the light. The Big Blue Mountain effects are those of a heavy sativa, especially considering its 20% or more average THC level. It starts with a powerful almost immediate head rush that launches you into euphoric giggles and an intense feeling of creative inspiration. Each toke is incredibly expansive, opening up your lungs and infusing you with energy with each inhale. As the high builds, you'll feel a slight pang of hunger that's mild at best. Because of these head heavy effects, Big Blue Mountain is often used to treat fatigue, inflammation, multiple sclerosis, asthma, and inattentiveness, and should be avoided if you suffer from anxiety. The flavor of Big Blue Mountain is that of sweet tropical spice with hints of woody earth, and the aroma is very skunky with spicy haze and earth that can be detected as the nugs are broken apart and burned.", "effects": ["Creative", "Giggly", "Happy", "Hungry", "Sociable"], "aromas": ["Earthy", "Herbal", "Pine", "Spicy", "Sweet"], "flavors": ["Sweet", "Tropical", "Woody"], "relieves": ["Sweet", "Tropical", "Woody"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Bomb": {"url": "https://www.allbud.com/marijuana-strains/hybrid/big-bomb", "img": "https://media.allbud.com/resized/350x242/media/images/strain/big-bomb/YdDLwBQ1/big-bombjpg.jpg?t=3a30dcdbddc4f46aad5af0393bfdeb601b70517c48c3544f4dcb96760db18334", "name": "Big Bomb", "description": "Big Bomb is a rare evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic Big Bud X Bomb #1 strains. Even with its even balance, Big Bomb tends to lean more so towards the indica side in terms of effects, exploding through your physical state and leaving you totally couch-locked and immovable for hours on end. The high starts with a subtle tingle in the back of the head, creeping forward and leaving you feeling lifted and at ease. This quickly turns stoney, spreading through your limbs and instantly locking you to the couch. Soon you'll be hit with a wave of sedation, leaving you dozing off and on for hours. With these long-lasting effects and its moderate 10-15% average THC level, Big Bomb is said to be perfect for treating conditions such as chronic pain, insomnia, inflammation, spasticity and chronic fatigue. This bud has a super pungent spicy flavor with a dank exhale that is pretty sour at times. The aroma is earthy and pungent with a spicy dank overtone that fills any room with its heavy woody stench. Big Bomb has super dense oversized bright neon green nugs with almost clear orange hairs and a coating of frosty tiny milky white crystal trichomes.", "effects": ["Body High", "Happy", "Relaxing", "Sleepy", "Tingly", "Uplifting"], "aromas": ["Dank", "Earthy", "Pungent", "Skunky", "Spicy"], "flavors": ["Herbal", "Pine", "Skunky", "Spicy"], "relieves": ["Herbal", "Pine", "Skunky", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Boy": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/big-boy", "img": "https://media.allbud.com/resized/350x242/media/images/strain/big-boy/7882/mnhh70oo4ps8uh4jrjpf.jpg?t=9320edd6da942bab1f7693d1357aaf5a30dc96970439efdded7a180d640d0697", "name": "Big Boy", "description": "Big Boy is a super rare indica dominant hybrid strain created through crossing the infamous Big Bud with the delicious Boy Scout Cookie strain. Like its Big Bud parent, Big Boy has super heavy oversized nugs. Each nug is spattered with fluffy amber hairs and coated with a thick layer of sweet sticky resin. As these sticky little nuggets are broken apart, mild aromas of fresh earth and kush are released. The flavor packs the same effects, although with a spicy skunky effect that lingers long after you finish your last toke. The Big Boy high really isn't all that big – it brings well-balanced effects and a low to moderate THC level to match. The high comes on with a smooth relaxing lift that boosts your mood and leaves you in a state of happy bliss. A tingly body high comes next, washing over you and leaving you pain-free and completely at ease. A mild case of the munchies may hit you at this point, although you won't be insanely hungry. Thanks to these moderate effects, Big Boy is often chosen to treat nausea, depression, appetite loss, and chronic stress.", "effects": ["Body High", "Euphoria", "Hungry", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Herbal", "Mellow", "Spicy"], "flavors": ["Herbal", "Skunky", "Spicy", "Sweet"], "relieves": ["Herbal", "Skunky", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Bubba Diesel": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/big-bubba-diesel", "img": "https://media.allbud.com/resized/350x242/media/images/strain/big-bubba-diesel/ylodhv2L/15876547871603353614572316309111jpg.jpg?t=507d3e20e73b93080d195c80b70b6fc5029743682d2a1d250b5609c6debee546", "name": "Big Bubba Diesel", "description": "Big Bubba Diesel, also known as “Big Bubba D,” is an indica dominant hybrid strain created through crossing the infamous Bubba Kush and the classic Chem 91. This celebrity child brings on the classic indica effects, with full-bodied sedation that is sure to please the pickiest indica lover. The high comes on fast and hard with immediate cerebral effects that lift you into a state of slight focus and euphoria. These mental effects will quickly fade into sedative relaxation that can leave you feeling sleepy and spacey. A mellow body high comes next, spreading over you in calming waves and leaving you completely at ease. In combination with its low to moderate THC level, these effects make Big Bubba Diesel perfect for treating conditions such as insomnia, chronic stress, depression, anorexia, and nausea. This bud has a super sweet and sugary fruity diesel flavor that intensifies on each exhale. The aroma is very dank and diesel with a sharp citrus chemical overtone that can be harsh at times. Big Bubba Diesel buds have small heart-shaped light minty green nugs with long thin orange hairs and a coating of frosty tiny amber crystal trichomes.", "effects": ["Cerebral", "Mellow", "Relaxing", "Sleepy"], "aromas": ["Chemical", "Citrus", "Dank", "Diesel", "Fruity"], "flavors": ["Diesel", "Fruity", "Sweet"], "relieves": ["Diesel", "Fruity", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Bud": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/big-bud", "img": "https://media.allbud.com/resized/350x242/media/feature/strain/big-bud.jpg?t=93c7754e30f499d119ffd1f2a8d8b9ecba31c26c27383ffca48d8f5b6faee3a6", "name": "Big Bud", "description": "Big Bud is an indica dominant hybrid (85% indica/15% sativa) strain that was the overall winner of the 1989 High Times Cannabis Cup. This strain was named for its enormously oversized buds and huge yields for growers, as well as its intensely high THC level ranging from 23-26%. Although the original Big Bud strain was a cross between the insanely popular Afghani X Skunk #1 strains, it has since then been rebred and bred with other strains to create different effects and potencies. Big Bud has long, dense spade shaped olive green nugs with rich purple undertones and fiery orange hairs spattered throughout the body. These nugs are covered in a fine layer of white crystal trichomes and visible sweet resin. Big Bud has an aroma of sweet and spicy earth and a taste of sweet and spicy earth with a grape aftertaste. Users describe the Big Bud high as a slowly creeping onset of an overpowering couch-lock, feeling of lethargic laziness, and sleepiness. This sedative strain offers an uplifted mood and feelings of euphoria as well, that slowly ease you into a deep and peaceful sleep. Due to these potent effects, Big Bud is an ideal strain for treating patients suffering from conditions such as insomnia and chronic pain.", "effects": ["Creative", "Euphoria", "Happy", "Hungry", "Relaxing", "Sleepy"], "aromas": ["Earthy", "Herbal", "Pepper", "Spicy", "Woody"], "flavors": ["Sweet", "Woody"], "relieves": ["Sweet", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Buddha Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/big-buddha-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/big-buddha-kush/7888/gmbpe0ugpj9yxomawvqh.jpg?t=ccf0f877c68bb49dc0c5c7f80ed8f94baa7771d8167a20b5395fdc14c751e246", "name": "Big Buddha Kush", "description": "Big Buddha Kush, also known as “Big Buddha Kush OG,” is a rare indica dominant hybrid strain created through crossing the classic Big Bud X Buddah Kush strains. With its potent 18-20% average THC level and relaxing body heavy effects, Big Buddha Kush is the perfect choice for any classic indica lover. The Big Buddha Kush high comes on slowly, creeping up on you with a sense of tingly happiness that spreads from top to bottom in relaxing warming waves. As this lifted effect grows, you'll start to feel sleepy and slightly sedated, although not completely weighted down. Rather, you'll be in state of couch-locked relaxation that lasts for hours on end. These effects give Big Buddha Kush an edge in treating conditions such as chronic stress or anxiety, depression, and insomnia or fatigue. This bud has a classic sweet earthy flavor with hints of rich skunk and pine. The aroma takes on a spicy turn, mixing earthy woodiness with a touch of herbs for a potent stench. Big Buddha Kush buds have oversized forest green fluffy nugs with rich amber hairs and a coating of matching crystal trichomes dotted with sweet syrupy resin.", "effects": ["Body High", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Earthy", "Herbal", "Pine", "Spicy", "Woody"], "flavors": ["Pine", "Skunky", "Sweet"], "relieves": ["Pine", "Skunky", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Cheese": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/big-cheese", "img": "https://media.allbud.com/resized/350x242/media/images/strain/big-cheese/5050/e9zvvhvkctthitdeh9kt.jpg?t=ef563e957e305cb2a735a7e9f6c474bbfef293b640d0820d124e34be713cf80f", "name": "Big Cheese", "description": "Big Cheese is a Sativa dominant hybrid that has an Indica/ Sativa ratio of 40/60 percent. It is a unique strain that has deep green colored dense buds that are covered with crystals and red hair. It has different versions and produces a moderate to high yield. It is produced by crossing Cheese-Wreck with Big Bud. Big Cheese has an extremely powerful high that energizes, invigorates and relaxes you. It has an excellent potency, but its exact THC level is not known. Its aroma and taste both are true its name and have a strong cheesy flavor with a hint of berry that makes this strain very interesting cannabis to smoke. Cheese lovers will surely fall in love with this one! Its effects are very long lasting and stay on your system for about two hours. In addition to energizing you, it makes you feel calm, creative, sleepy and relaxed. This strain is perfect for treating anxiety, depression and stress. It alleviates the symptoms of these troubles and makes you feel peaceful. Moreover, you can employ this strain for treating insomnia, loss of appetite and mild pains.", "effects": ["Creative", "Energizing"], "aromas": ["Cheese"], "flavors": ["Cheesy"], "relieves": ["Cheesy"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big City Lights": {"url": "https://www.allbud.com/marijuana-strains/hybrid/big-city-lights", "img": "https://media.allbud.com/resized/350x242/media/images/strain/big-city-lights/2RM9yo0E/5d9da40b-6861-48e9-8dea-70245ff5b5d3jpe.jpg?t=727fd8bf18ebb338047ec32719471297b46afe27cb60d726923ea720b8f2cbc4", "name": "Big City Lights", "description": "Big City Lights is an evenly balanced hybrid strain (50% indica/50% sativa) created through a cross of the infamous Dark Desire X Frisco OG strains. If you're looking for a totally gorgeous bud, you've found it. Big City Lights buds have small super dense dark olive green nugs with rich purple undertones, sparse amber hairs and a thick frosty coating of glittering tiny purple-tinted white crystal trichomes. As you break apart each sticky little nugget, you can detect aromas of pungent flowers and rich spicy berries and fruits. The flavor is of sweet grape and spicy berries with a lightly herbal exhale that turns earthy as you continue to toke. The Big City Lights high is just as delightful as the flavor, with full-bodied effects that are best suited for a lazy afternoon when you want to kick back and be alone with your dreamy feelings. You'll feel slightly tingly at the onset of the high with a sense of unfocused euphoria and deep relaxation through and through. This quickly becomes stoney, dropping you into a dreamy state that is very pleasant and calming. Thanks to these effects and its high 15-23% average THC level, Big City Lights is said to be perfect for treating insomnia, depression, migraines or headaches, and chronic stress or anxiety.", "effects": ["Cerebral", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Berry", "Earthy", "Floral", "Grape", "Herbal", "Spicy"], "flavors": ["Fruity", "Grape", "Herbal", "Spicy"], "relieves": ["Fruity", "Grape", "Herbal", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Daddy Purple": {"url": "https://www.allbud.com/marijuana-strains/hybrid/big-daddy-purple", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Big Daddy Purple", "description": "Big Daddy Purple is an evenly balanced hybrid strain (50% indica/50% sativa) created through an unknown combination of other hybrid strains, although it is thought to be a relative of the classic Granddaddy Purple strain. Named for its oversized buds and gorgeous appearance, Big Daddy Purple is the perfect hybrid for any discerning connoisseur. Like its name suggests, Big Daddy Purple buds have oversized and super heavy pepper-shaped olive green nugs with rich purple undertones, thin orange hairs and a coating of frosty, dark purple-tinted white crystal trichomes. As you pull apart each sticky little nugget, aromas of sweet spicy grapes and peppery diesel are released, intensifying the more that you toke. The aroma is very similar, with a sweet berry grape taste accented by spicy earthiness and a touch of nutty savory diesel. The Big Daddy Purple high will settle in a few minutes after your final toke, lifting your spirits into a state of calming happiness. A light physical tingle comes next, washing over your body and helping you to settle down into a fully relaxed state. This tingly feeling will be both arousing and laughter-inducing, leaving you giggling before you finally drop off into a state of pure sleepy sedation. Combined with its moderate 12-17% average THC level and 0-1% CBD level, these effects make Big Daddy Purple a great choice for treating conditions such as chronic pain, Multiple Sclerosis, fibromyalgia, chronic stress or PTSD, hypertension and cramps or muscle spasms.", "effects": ["Aroused", "Calming", "Giggly", "Sleepy", "Sociable", "Tingly", "Uplifting"], "aromas": ["Diesel", "Earthy", "Fruity", "Grape", "Herbal", "Nutty", "Peppery", "Spicy"], "flavors": ["Berry", "Fruity", "Grape", "Nutty", "Spicy", "Sweet"], "relieves": ["Berry", "Fruity", "Grape", "Nutty", "Spicy", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Duke": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/big-duke", "img": "https://media.allbud.com/resized/350x242/media/images/strain/big-duke/5856/l4joarpjmri2zuvcvxnu.jpg?t=a85f300ec2856281a77a8d927aea9c3ba92e7fe0642cd541522e12267cce3cec", "name": "Big Duke", "description": "Big Duke is a slightly indica dominant hybrid strain created through crossing the potent Big Bud X Duke Nukem strains. Although it is pretty hard to come by outside of the West Coast, Big Duke is often sought after for its pain-killing effects and lazy full-bodied high. The Big Duke high kicks off with an uplifted energetic mood boost that gives you a happy outlook on life and a feeling of relaxation. As this head high builds, a mellow body buzz will slowly wash over you, leaving you feeling lazy and unmotivated although not couch-locked or weighed down in the slightest. With these effects and its powerful 22% average THC level, Big Duke is said to be the perfect bud for treating conditions such as mood swings, appetite loss, chronic fatigue, insomnia, and chronic pain. Big Duke has a sweet skunky flavor with hints of smooth citrus and earth and a super earthy aroma with a spicy overtone that's accented by sharp citrus and super pungent skunk. Big Duke buds have oversized forest green fluffy nugs with dark amber hairs and a spattering of chunky amber crystal trichomes.", "effects": ["Body High", "Relaxing"], "aromas": ["Citrus", "Earthy", "Pungent", "Skunky", "Spicy"], "flavors": ["Orange", "Sweet"], "relieves": ["Orange", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big E OG": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/big-e-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/big-e-og/wDGCzsWE/fire-ogjpg.jpg?t=e6d88994ced54a1df7b6ccc6246007b0c7bc3f486292497cdb503c3c3f9b9290", "name": "Big E OG", "description": "Big E OG, also known as “BE OG,” is a rare slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the infamous Fire OG X Chem D strains. Known for its super euphoric high, this bud packs the high-powered giddy effects into each and every deliciously pungent toke. The Big E OG high comes on with a rush of cerebral effects that spill their way into your brain, pushing out any negative or racing thoughts and replacing them with a light sense of motivation and laser-sharp focus. As your mind lifts, your body will start to succumb to a deeply relaxing buzz that lulls you into a completely calm and couch-locked state that can last for hours on end. Thanks to these effects and its high 19-25% average THC level, Big E OG is often chosen to treat those suffering from conditions such as chronic anxiety or stress, depression, chronic pain, migraines or headaches, ADD or ADHD, and epilepsy. This bud has a rich flowery herbal flavor with a sharp spicy diesel exhale. The aroma is super pungent but follows the same spicy diesel profile. Big E OG buds have elongated grape-shaped forest green nugs with orange furry hairs and a coating of tiny golden crystal trichomes.]", "effects": ["Body High", "Calming", "Euphoria", "Focus", "Relaxing", "Uplifting"], "aromas": ["Chemical", "Diesel", "Floral", "Herbal", "Pungent", "Spicy"], "flavors": ["Diesel", "Flowery", "Herbal", "Spicy", "Sweet"], "relieves": ["Diesel", "Flowery", "Herbal", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Big Foot": {"url": "https://www.allbud.com/marijuana-strains/hybrid/big-foot", "img": "https://media.allbud.com/resized/350x242/media/images/strain/big-foot/PxqNsMay/15496431337921329257740256692830jpg.jpg?t=7ba81c273a7a89ddefc52a9d644cf9ddb97341c88ce0b47fc6b3e28eab9827fe", "name": "Big Foot", "description": "Big Foot is an evenly balanced hybrid (50% indica/50% sativa) strain created through a cross of the classic BC Hash Plant X Grim strains. This bud is often confused with the similarly Bigfoot OG, although it has extremely different effects. The high starts with a euphoric head buzz that launches your mood and mind into the clouds with uplifted energy. You'll start to fade into deep relaxation and a sense of calm as the high builds, instantly relieving you of any stress or anxiety you may be experiencing. These effects paired with its insanely high average THC level of 22% make Big Foot an ideal strain for treating patients suffering from conditions such as depression, chronic stress or anxiety, migraines, and inattentiveness. Like its name suggests, Big Foot has massively oversized nugs that are super dense and lumpy with a deep forest green coloration and beautiful amber colored hairs. These nugs are super sticky as they are broken apart and are said to be incredibly hard to grind because of this. Big Foot has an incredibly dense dank aroma of sweet rotting fruit, and a flavor of spicy fruit with a hint of earthy pungency upon exhale.", "effects": ["Happy", "Relaxing", "Uplifting"], "aromas": ["Dank", "Fruity", "Pungent", "Spicy", "Sweet"], "flavors": ["Dank", "Fruity", "Sweet"], "relieves": ["Dank", "Fruity", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}}