{"Yabba Dabba Goo": {"url": "https://www.allbud.com/marijuana-strains/hybrid/yabba-dabba-goo", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yabba-dabba-goo/J0dCBq4d/yabba-dabba-goojpg.jpg?t=5c33019e3c7efe02be2ce6418509660bb49ece764e24c9607e51af452e0d6196", "name": "Yabba Dabba Goo", "description": "Yabba Dabba Goo is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic Hawaiian Kona Gold X California Green Crack strains. A great balanced hybrid for any discerning patient, Yabba Dabba Goo packs a soothing yet energizing high that will get you up and moving in no time at all. It begins with a tingle in the brain almost as soon as you exhale, activating your senses and filling you with a budding euphoric energy. As your mood is boosted, your body will begin to settle into a fully kicked-back state of happy relaxation that won’t affect your energy level in the slightest. In combination with its high 15-25% average THC level, these effects make Yabba Dabba Goo a great choice for treating those suffering from conditions such as chronic stress, headaches or migraines, chronic fatigue, depression and chronic pain. This bud has a sour citrusy lemon-lime flavor with a woody and flowery exhale. The aroma is of flowery woody kush with a touch of earthiness and a punch of sour lemony-lime citrus. Yabba Dabba Goo buds have oversized rounded emerald-green nugs with dark purple leaves, matching undertones, thin orange hairs and a coating of frosty, purple-tinted white crystal trichomes.", "effects": ["Body High", "Cerebral", "Energizing", "Euphoria", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Citrus", "Earthy", "Flowery", "Herbal", "Kush", "Lime", "Sour", "Woody"], "flavors": ["Citrus", "Flowery", "Lemon", "Lime", "Sour", "Spicy"], "relieves": ["Citrus", "Flowery", "Lemon", "Lime", "Sour", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Ya Hemi": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/ya-hemi", "img": "https://media.allbud.com/resized/350x242/media/images/strain/ya-hemi/VlLrjQ6j/20221115_161143jpg.jpg?t=2ba40f7e8cb37ba965b2a4dc32f74ec0d1ae4975724a3a7a4dca1460e4e442e9", "name": "Ya Hemi", "description": "Ya Hemi, also known as “Yahemi” or “YaHemi,” is a sativa dominant hybrid strain (70% sativa/30% indica) created through crossing the powerful Project 4516 X Melonatta strains. Beloved for its immediate effects and long-lasting high, Ya Hemi is perfect for any lover of high-powered sativas. It starts as soon as you exhale, slamming into the brain with a high-flying lifted sense. You'll feel happy with a sense of giddiness that quickly has you falling into fits of uncontrollable giggles. A relaxing body high will slowly creep in next, filling your physical form with a sense of calm that has you totally kicked back from head to toe. In combination with its high 22% + average THC level, these effects make Ya Hemi a great choice for treating those suffering from conditions such as chronic pain, cramps or muscle spasms, arthritis, inflammation, depression and chronic stress. This bud has a sweet and sour lemony citrus flavor with a lightly spicy and peppery herbal exhale. The aroma is very similar, with a spicy black pepper overtone accented by fresh sour citrus and touches of savory diesel. Ya Hemi buds have long pepper-shaped olive green nugs with dark undertones, thin yellow-orange hairs and a coating of tiny, milky white crystal trichomes.", "effects": ["Body High", "Calming", "Giggly", "Happy", "Relaxing", "Uplifting"], "aromas": ["Fruity", "Herbal", "Lemon", "Sour", "Spicy"], "flavors": ["Citrus", "Diesel", "Lemon", "Sour", "Sweet"], "relieves": ["Citrus", "Diesel", "Lemon", "Sour", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yampa Valley Couch-Lock": {"url": "https://www.allbud.com/marijuana-strains/indica/yampa-valley-couch-lock", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yampa-valley-couch-lock/6033/xue2luyjnairg8hcf2fp.jpg?t=3d80afb91fd80abe6c4433a6c3dc7d14bdb1d5af15a6425e1446b5aa66003dd8", "name": "Yampa Valley Couch-Lock", "description": "Yampa Valley Couch-Lock is a 100% pure indica strain that is a potent cross between the insanely popular Northern Lights #5 X Afghan strains. This dank bud boasts an average THC level ranging from 10-14% and is popular among both smokers and vapers alike. Users describe the Yampa Valley Couch-Lock high as a potent, long-lasting slowly creeping onset of a body buzz accompanied by intense couch-lock that leaves you absolutely sedated and at ease. This warming narcotic indica based effect will slowly ease you into a deep and peaceful long-lasting sleep. Due to these potent sedative indica effects, Yampa Valley Couch-Lock is an ideal strain for treating patients suffering from conditions such as hyperactivity, chronic pain due to illness or injury, chronic stress, and sleep disorders, including insomnia. The Yampa Valley Couch-Lock buds have light minty green fluffy popcorn-shaped nugs with dark olive green and rich amber undertones. These nugs are specked with rusty red hairs and a thick layer of white crystal trichomes and syrupy sweet resin. Yampa Valley Couch-Lock has an intensely sweet aroma of peachy vanilla butter and a taste of sweet peachy lemon that intensifies as you exhale.", "effects": ["Body High"], "aromas": [], "flavors": ["Lemon", "Pine"], "relieves": ["Lemon", "Pine"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yarkoum": {"url": "https://www.allbud.com/marijuana-strains/indica/yarkoum", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yarkoum/VcS313GH/yarkoumjpg.jpg?t=c63a7e73bb7dcd0f2bdf7bc31b1ceb8cff0aa1beb1ec3357e692f784bde90fe1", "name": "Yarkoum", "description": "Yarkoum is a 100% pure indica hybrid strain created through crossing the classic Pakistani X Chitral strains. Weird name aside, this bud is known among patients and breeders alike for its classic effects and pretty potent high. It starts with a subtle lift that fills the mind with a light buzzing euphoria, pushing out any negative or racing thoughts and replacing them with pure bliss and haziness. As your mind settles into this state of happy calm, your body will begin to fade away into a sense of deep relaxation, working its way into your very bones and leaving you feeling totally couch-locked and immovable but really, really happy about it. As your mind and body begin to settle into this deep state of tranquility, you'll begin to feel sleepier and sleepier before you finally doze off. Thanks to these effects and its high 10-20% THC level, Yarkoum is often chosen to treat those suffering from conditions such as chronic stress, depression, chronic pain and appetite loss or nausea. This bud has a spicy flowery flavor with a lightly woody exhale. The aroma is very similar, with a spicy flowery overtone accented by fresh earth and sweet pine. Yarkoum buds have oversized flat bluish green nugs with deep purple undertones, vivid orange hairs and a coating of frosty tiny purple-tinted white crystal trichomes.", "effects": ["Body High", "Giggly", "Hungry", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Earthy", "Flowery", "Herbal", "Spicy", "Woody"], "flavors": ["Flowery", "Pine", "Spicy", "Sweet", "Woody"], "relieves": ["Flowery", "Pine", "Spicy", "Sweet", "Woody"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yeager": {"url": "https://www.allbud.com/marijuana-strains/hybrid/yeager", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yeager/BlboNvPF/15384563202083644225318990234763jpg.jpg?t=ccd3a83937a3becb5eb81bf7f29ee4fbb11cbb8b1a0cb4c2f44064f08fa5068e", "name": "Yeager", "description": "Yeager is an evenly balanced hybrid strain (50% indica/50% sativa) created as an alternative version of the classic Hindu Kush strain. Infamous around the world, Yeager packs a super heavy full-bodied high that will leave you feeling super calm and at ease for hours on end before you finally fade away and fall asleep. The high starts with a subtle build of effects, slowly creeping into your brain with a lifted sense of euphoria that's accompanied by a touch of tingly calm. This tingle will gently erase any negative or racing thoughts, replacing them with blissful nothingness. A soothing body high will come next, washing over you and leaving you completely immovable and totally at peace. With these sedative effects and its high 14-24% average THC level, Yeager is often chosen to treat those suffering from conditions such as chronic stress or anxiety, insomnia, chronic pain and muscle spasms or inflammation. This bud has a sweet and fruity berry citrus flavor with a lightly spicy flowery exhale. The aroma is of spicy flowers, fresh earth and a bouquet of ripe berries and sour citrus. Yeager buds have long dense pepper-shaped forest green nugs with dark purple undertones, thin orange hairs and a coating of chunky amber crystal trichomes.", "effects": ["Calming", "Cerebral", "Euphoria", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Flowery", "Fruity", "Sour", "Spicy"], "flavors": ["Berry", "Citrus", "Fruity", "Sour", "Spicy", "Sweet"], "relieves": ["Berry", "Citrus", "Fruity", "Sour", "Spicy", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yellow Haze": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/yellow-haze", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yellow-haze/hT3RvGSo/lemon-skunkjpg.jpg?t=79bceb89dbfbfc1218fab28c099e80c9e3bb12fb3007bfaa3116a019c9a2125c", "name": "Yellow Haze", "description": "Yellow Haze, also known as “Yellow Lemon Haze,” is a sativa dominant hybrid strain (70% sativa/30% indica) created through crossing the delicious Lemon Skunk X Super Silver Haze strains. Named for its delicious flavor and gorgeous appearance, Yellow Haze is the perfect choice for any sativa lover. This bud has a sweet and sour citrusy lemon flavor with hints of spicy peppery flowers and fresh woods. The aroma is very similar, with a citrusy skunky overtone accented by spicy black pepper and flowery woods. The Yellow Haze high will hit you almost as soon as you exhale, rushing through your mind with a high-flying energy that's accompanied by a boost in creativity. Even with this lift, your mind will remain in a state of calm, filled with happiness and focus that helps you get to work. Thanks to these effects and its high 21-29% average THC level, Yellow Haze is often chosen to treat a variety of conditions including chronic fatigue, mood swings or depression, chronic stress or PTSD or bipolar depression. This bud has airy and piecey conical bright neon green nugs with golden yellow undertones, light orange hairs and a thick coating of tiny, frosty white crystal trichomes.", "effects": ["Bipolar Depression", "Calming", "Creative", "Energizing", "PTSD", "Uplifting"], "aromas": ["Earthy", "Flowery", "Fruity", "Peppery", "Skunky", "Spicy", "Woody"], "flavors": ["Citrus", "Flowery", "Fruity", "Lemon", "Sour", "Sweet", "Woody"], "relieves": ["Citrus", "Flowery", "Fruity", "Lemon", "Sour", "Sweet", "Woody"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yellow Lion Rum": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yellow-lion-rum", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Yellow Lion Rum", "description": "Yellow Lion Rum is an indica dominant hybrid strain of unknown parentage due to breeder secrecy around their practices. This bud gets its name from the unique way that the breeders cure the bud – it’s cured inside of an aged rum barrel! Although this method of curing doesn’t affect the THC level or effects, it infuses the bud with a spicy sweet flavor and smell that’s remarkably just like rum. This bud is typically purchased in a pre-rolled joint form, although if you open the joint up you can see that it is piecey and dark with a spattering of amber hairs and a pretty heavy stickiness to it. The Yellow Lion Rum high is pretty typical of your average indica, brining a happy and slightly sedated high that’s fueled by an 18-19% average THC level. The high hits you first with a sense of calm that washes over your mind before spreading throughout your entire body n relaxing waves. As you fall into deep relaxation, your mind will soar with a happy euphoria, leaving you blissful and slightly sedated. With these effects, Yellow Lion Rum is often chosen to treat patients suffering from conditions such as mood swings, muscle spasms, insomnia, and chronic pain.", "effects": ["Euphoria", "Happy", "Relaxing"], "aromas": ["Dank", "Earthy", "Herbal", "Spicy", "Woody"], "flavors": ["Dank", "Herbal", "Pine", "Spicy"], "relieves": ["Dank", "Herbal", "Pine", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yellowstone": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/yellowstone", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yellowstone/iByA0EaC/92-cjpg.jpg?t=c9169804d0ed496008ecf095058c0e3943d8ed6d5f99696e93da532e0f6a1550", "name": "Yellowstone", "description": "Yellowstone is a slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the potent The Dark Side X Cheese strains. A great well-balanced bud to fuel any outdoors adventuring, Yellowstone packs a full-bodied high that's filled with happy energy and calming physical effects. It starts in the head with a lifted sense that pulls your mind into a state of happy and slightly unfocused bliss. You'll feel mentally calmed with a rush of creative thought that has your mental gears turning, although you'll be falling out of focus here and there. As your mind settles, your body will be infused with a light physical energy that gets you up and moving without causing any anxiety or amplifying aches or pains. Combined with its high 16% + average THC level, these effects make Yellowstone a great choice for treating those suffering from conditions such as chronic fatigue, depression, chronic stress, nausea or appetite loss or chronic pain. This bud has a sweet and sour citrusy lemon taste with a light touch of savory cheese, too. The aroma is very pungent and cheesy with a punch of sour citrus that intensifies as you continue to toke. Yellowstone buds have fat oversized pepper-shaped forest green nugs with yellow undertones, matching hairs and a coating of frosty tiny white trichomes.", "effects": ["Calming", "Creative", "Happy", "Relaxing", "Uplifting"], "aromas": ["Cheese", "Earthy", "Lemon", "Pungent", "Sour", "Spicy"], "flavors": ["Citrus", "Lemon", "Sour", "Sweet"], "relieves": ["Citrus", "Lemon", "Sour", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yellow Zushi": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yellow-zushi", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Yellow Zushi", "description": "Yellow Zushi is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the tasty Zkittlez X Kush Mints #6 strains. A beautiful bud with delightfully potent effects, Yellow Zushi is the perfect choice for any hybrid lover who appreciates an indica lean in their medicine. Like itsee name suggest, this bud has fat and squat triangle-shaped forest green nugs with surprisingly bright yellow-green undertones, thin yellow-orange hairs and a frosty, thick coating of tiny bright white crystal trichomes. As you pull apart each sticky little nugget, aromas of spicy menthol and gassy diesel are released, intensifying with a punch of pungent sour lemon as the nugs are burned away. The flavor is of sweet and sour lemony citrus accented by spicy flowers and a touch of gassiness. The Yellow Zushi high has as surprisingly quick onset, slamming into the brain almost immediately with a lifted sense of happy focus and creativity. But you'd better get to any sort of work quickly – this creativity will soon drop off, replaced with a heady sense of bliss that has you unfocused and blissfully unaware of anything happening around you before you finally fade away and fall asleep. Thanks to these effects and its high 19-23% average THC level, Yellow Zushi is often said to be perfect for treating conditions such as chronic stress or anxiety, depression, insomnia and chronic fatigue.", "effects": ["Calming", "Focus", "Happy", "Relaxing", "Sleepy", "Sociable", "Uplifting"], "aromas": ["Citrus", "Earthy", "Flowery", "Gas", "Lemon", "Menthol", "Sour", "Spicy"], "flavors": ["Citrus", "Flowery", "Lemon", "Menthol", "Sour", "Spicy"], "relieves": ["Citrus", "Flowery", "Lemon", "Menthol", "Sour", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yemen Girl": {"url": "https://www.allbud.com/marijuana-strains/hybrid/yemen-girl", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yemen-girl/04F68Bgz/3a28bf84-a73e-4f42-b77f-d204739510d6jpe.jpg?t=803c5eb8d32d03a33e3606241c3dd4ca83bef4b2e184e043211ddb73223faf4e", "name": "Yemen Girl", "description": "Yemen Girl is a rare evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the iconic Yemen X Fast Moda strains. This classic bud packs a full-bodied high that’s perfect for any hybrid lover who appreciates a great flavor, too. The Yemen Girl high has a nice slow build that sinks itself into your head, hiding behind the eyes before taking ahold of your mind. You’ll feel lifted and euphoric with a sense of pure happiness that immediately pushes out any negative or racing thoughts, leaving your mind feeling totally at peace. As your mental state lifts, your physical form will start to fall away into a deeply relaxing state that can leave you slightly sedated and couch-locked if you’re not careful. With these long-lasting effects and its high 26-27% average THC level, Yemen Girl is often chosen to treat conditions such as depression, chronic stress, nausea, chronic fatigue, and migraines or headaches. This bud has a sweet flowery flavor with hints of fresh herbs and grass. The aroma is very earthy with a floral overtone that turns slightly spicy as the nugs are burned. Yemen Girl buds have airy piecey forest green nugs with rich amber hairs and a coating of bright white frosty crystal trichomes.", "effects": ["Body High", "Cerebral", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Floral", "Herbal", "Sweet"], "flavors": ["Flowery", "Herbal", "Sweet"], "relieves": ["Flowery", "Herbal", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yem OG": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yem-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yem-og/5840/qlwoutqlizs5mjwixirh.jpg?t=ed7ab28b1c7b8bf12d4e8b35bc378eeb907fcc657578e58a6155268a0c15a5f6", "name": "Yem OG", "description": "Yem OG is an extremely rare indica dominant hybrid strain created through crossing the potent Ghost OG X Phishhead Kush strains. Although it's not found on the general market, Yem OG is infamous among users for taking home 3rd Place for Best Hybrid at the 2013 High Times' Cannabis Cup. And with a heavy high powered by a THC level that bottoms out at about 25%, you'll can definitely see why it took home the bronze medal. The Yem OG high is definitely a creeper, sneaking up on you after a few minutes before seizing your mind and pulling it down into a deep hazy introspection that's both sleepy and imaginative. A numbing body buzz comes next, moving from your neck and spine through to your fingers and toes, lulling you into complete relaxation and a heavy case of couch-lock. Many will end up passing out as they sink further and further into their seat and succumb to their vivid dreamy visions. These effects make Yem OG ideal for treating conditions such as chronic pain, insomnia, appetite loss, and muscle spasms or cramps. This bud has spade-shaped forest green nugs with sparse dark hairs and tiny milky white crystal trichomes. Yem OG has a sweet flavor and smell of earthy pine accented by spicy tropical fruits.", "effects": ["Body High", "Relaxing", "Sleepy"], "aromas": ["Citrus", "Earthy", "Fruity", "Pine"], "flavors": ["Pine", "Sweet", "Tropical"], "relieves": ["Pine", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yenz Cookies": {"url": "https://www.allbud.com/marijuana-strains/hybrid/yenz-cookies", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yenz-cookies/ROSl0hx2/yenz-cookiesjpg.jpg?t=2b6deecb36f3e61c6f710d0f587e357d3392e8e148452119ee2b2797c32fd0de", "name": "Yenz Cookies", "description": "Yenz Cookies is an extremely rare evenly balanced hybrid strain (50% indica/50% sativa) that is said to be a phenotype of the classic Girl Scout Cookies strain. Although its exact heritage is unknown, this bud is infamous for its insanely high 18-29% average THC level and long-lasting effects. The high starts with a lifted effect that infuses your mind with a happy euphoria, easing away any mental aches or pains and leaving you feeling totally relaxed. This effect will soon spread throughout the rest of your body in warming tingly waves, easing away physical aches and pains and leaving you feeling peaceful and calm. The high may make you hungry at this point, so be ready with some snacks on hand for when the munchies hit! With these effects and its high 17-29% average THC level, Yenz Cookies is often chosen to treat conditions such as insomnia, nausea, appetite loss, and chronic pain. This bud has a nutty herbal flavor with hints of fresh spicy herbs upon exhale. The aroma is very earthy and dank with a nutty spicy overtone that turns pungent as the nugs are burned. This bud has fluffy tapered grape-shaped minty green nugs with furry orange hairs and a coating of tiny amber crystal trichomes.", "effects": ["Body High", "Hungry", "Relaxing", "Uplifting"], "aromas": ["Dank", "Earthy", "Herbal", "Pungent", "Spicy"], "flavors": ["Herbal", "Nutty", "Spicy"], "relieves": ["Herbal", "Nutty", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yenzo Cookies": {"url": "https://www.allbud.com/marijuana-strains/hybrid/yenzo-cookies", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yenzo-cookies/pXY880Po/yenzo-cookiesjpg.jpg?t=51ae7c324cb2931e77597dba081a9df1353e8b19cebe9327cd45d01d3b6defb3", "name": "Yenzo Cookies", "description": "Yenzo Cookies is a super rare evenly balanced hybrid strain (50% indica/50% sativa) created through crossing Girl Scout Cookies with another unknown hybrid strain. Although its exact heritage is kept a closely guarded secret by its breeders, Yenzo Cookies is highly sought after for its super potent and well-balanced effects that hit both mind and body with ease. The high stars with a lightly building cerebral lift that fills your mind with a sense of euphoria while gently edging out any negative or racing thoughts. As your mind lifts higher and higher, your body will begin to settle into a deeply relaxing state, lulling you into a sleepy calm that can cause you to start dozing in almost no time flat. Thanks to these effects and its high 22-26% average THC level, Yenzo Kush is said to be perfect for treating those suffering from conditions such as nausea or appetite loss, chronic pain, insomnia, and depression. This bud has a sweet herbal nutty flavor with a rich spicy herbal exhale and a touch of sour fruits. The aroma is of pungent earth and sweet herbs with a spicy overtone that intensifies as the nugs are burned. Yenzo Cookies buds have rounded dark olive green fluffy nugs with amber hairs and a coating of frosty white crystal trichomes with sweet sticky resin throughout.", "effects": ["Body High", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Dank", "Herbal", "Nutty", "Pungent", "Spicy", "Sweet"], "flavors": ["Fruity", "Herbal", "Nutty", "Spicy", "Sweet"], "relieves": ["Fruity", "Herbal", "Nutty", "Spicy", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yerba Buena": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yerba-buena", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yerba-buena/KJoONzpH/20200721_025845jpg.jpg?t=61a9e2ca493ca5eb118d228544a3a235a6215346d28b069b20f7979f6d37490a", "name": "Yerba Buena", "description": "Yerba Buena is an indica dominant hybrid strain (80% indica/20% sativa) created through crossing the classic SFV OG Kush X Joseph strains. Known for its super balanced high and effects that are ideal for all different experience levels, Yerba Buena is one indica that you need to try. This baby packs full-bodied effects that hit both cerebral and physical states, leaving you totally relaxed in every aspect with a sense of tranquility and calm. You'll feel a boost in your spirits with a slightly airy lift that fills you with euphoria and unfocused bliss. With these long-lasting effects and its moderately high 15-16% average THC level, Yerba Buena is often chosen to treat those patients suffering from conditions such as chronic pain, nausea or appetite loss, chronic fatigue, depression and chronic stress. This bud has a spicy and woody herbal pine flavor that has touches of savory fuel upon exhale. The aroma is heavy and pungent, with a spicy diesel overtone that's accented by hints of woody pine and dank earth. Yerba Buena buds have rounded spade-shaped olive green nugs with dark undertones, matching hairs and a thick frosty coating of milky amber crystal trichomes dripping with sweet sticky resin.", "effects": ["Body High", "Cerebral", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Diesel", "Earthy", "Herbal", "Pine", "Spicy", "Woody"], "flavors": ["Diesel", "Herbal", "Pine", "Spicy", "Woody"], "relieves": ["Diesel", "Herbal", "Pine", "Spicy", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yesca OG": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yesca-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yesca-og/zUaRLptE/og-kushjpg.jpg?t=681e993a0008c3b982359df409b7d57a56e7b7d5f90647d845c60916e6f3079e", "name": "Yesca OG", "description": "Yesca OG, also known as “Yesca” or “Yesca OG Kush,” is an indica dominant hybrid strain that’s said to be a descendant or family member of the classic OG Kush. The perfect classic bud for any hybrid lover who appreciates a high level of potency behind their medicine, Yesca OG packs super buzzy effects that hit both mind and body almost as soon as you exhale. You’ll feel your spirits lift with a tingly mental energy that dampens your focus rather than helping it, leaving you giggly and giddy, without a care in the world. This heady state is accompanied by a light physical tingle that quickly intensifies to a fully-fledged buzz, leaving you feeling fully relaxed from head to toe and slightly couch-locked a times. These heavy effects combined with its super high 23-26% average THC level gives Yesca OG an edge in treating a variety of conditions including chronic pain, migraines or headaches, chronic stress and depression. This bud has a classic spicy and flowery woody flavor with a lightly sour herbal exhale. The aroma is of earthy herbs with a woody pine overtone and touches of rich spices. Yesca OG buds have small popcorn-shaped olive green nugs with thick orange hairs and a coating of tiny golden crystal trichomes.", "effects": ["Body High", "Cerebral", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Earthy", "Flowery", "Pepper", "Sour", "Spicy", "Woody"], "flavors": ["Herbal", "Sour", "Spicy", "Woody"], "relieves": ["Herbal", "Sour", "Spicy", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yesterday's Paper": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yesterdays-paper", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yesterdays-paper/a8SzMLUY/jolly-rancherjpg.jpg?t=3e7ddcaa2ffd9b6222bc53b4588cd455cdd16b45a12d4de6b517a6e30c50d9b6", "name": "Yesterday's Paper", "description": "Yesterday's Paper is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the delicious Grape Gorilla X OG Kush X Jolly Rancher X Grass Knuckles strains. A well-balanced hybrid with plenty of giggles to go around, Yesterday's Paper is a great choice for any discerning patient. Yesterday's Paper buds have fluffy and fat heart-shaped forest green nugs with rich amber undertones, lots of thin orange hairs and a coating of tiny, frosty white crystal trichomes. This bud has a sweet and fruity cherry berry flavor with a lightly kushy and skunky exhale. The aroma is very similar, with a pungent cheesy overtone accented by sour skunkiness, sweet fruity cherries and a touch of spicy earthiness. The Yesterday's Paper high is just as delicious, with a happy and soothing overtone that will boost the spirit while relaxing the body at the same time. You'll feel giggly and lifted with a sense of relaxation that permeates both mind and body, infusing you with an overall feeling of calm that wipes away any negative moods or racing thoughts. Thanks to these effects and its high 17-20% average THC level, Yesterday's Paper is often chosen to treat those suffering from conditions such as chronic stress or anxiety, insomnia, chronic pain and depression or mood swings.", "effects": ["Body High", "Calming", "Giggly", "Happy", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Berry", "Cheese", "Cherry", "Grape", "Kush", "Pungent", "Spicy"], "flavors": ["Citrus", "Fruity", "Skunky", "Sour", "Spicy"], "relieves": ["Citrus", "Fruity", "Skunky", "Sour", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yeti Dog": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yeti-dog", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yeti-dog/UGbdk9cj/foo-dogjpg.jpg?t=990cd4d74cda38b306502e2b3dc0251f8e10243f337ff8b2fc7fc39d2fa78f2d", "name": "Yeti Dog", "description": "Yeti Dog is an indica dominant hybrid strain (80% indica/20% sativa) created through crossing the classic Foo Dog X Yeti BX2 strains. This high-powered celebrity child is great for anyone who wants to have a quick boost of the spirits before they settle into relaxing after a long and stressful day. It starts with a lifted feeling behind the eyes and in the forehead, filling your mind with warming happy thoughts and pushing out any negative feelings whatsoever. As your cerebral state settles into this sense of happiness, you’ll feel a giddiness wash over you, leaving you giggling without end. A relaxing body high comes next, locking you to the couch and leaving you totally immovable but insanely happy about it. With these effects and its moderately high 13-18% average THC level, Yeti Dog is often chosen to treat patients suffering from conditions such as chronic pain, depression, muscle spasms or cramps and appetite loss or nausea. This bud has a sweet and fruity berry flavor with a lightly spicy exhale. The aroma is earthy and pungent with a deep spicy berry overtone that’s accented by rich herbs as the nugs are burned away. Yeti Dog buds have oversized fluffy and airy bright neon green nugs with vivid orange hairs, golden undertones and a coating of chunky frosty white crystal trichomes.", "effects": ["Body High", "Giggly", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Earthy", "Herbal", "Pungent", "Spicy"], "flavors": ["Berry", "Fruity", "Herbal", "Spicy", "Sweet"], "relieves": ["Berry", "Fruity", "Herbal", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yin & Yang": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yin-yang", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yin-yang/CLj5mEEH/55-cjpg.jpg?t=5938820af3a8bd88e18f9c7d674df333d78254590170a5e02205beeefd5b28f5", "name": "Yin & Yang", "description": "Yin & Yang, also known as “Yin and Yang” or “YinYang,” is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the classic Harlequin X Jack the Ripper strains. If you're looking for the best of both sativa and indica effects, you've found it with Yin & Yang. This bud packs a full-bodied high that's pretty mellow in nature thanks to a low THC level and super high CBD level. You'll feel relaxed and calmed from start to finish with a lucid happiness that has you fading in and out of conscious. A touch of sleepiness will accompany this blissful state, leaving you feeling fully relaxed, almost meditative at times. These effects combined with its low 6% THC level and super high 9% CBD level make Yin & Yang perfect for treating arthritis, insomnia, inflammation, depression, chronic pain and muscle spasms or cramps. Yin & Yang has a sweet and spicy woody pepper flavor with a hint of rich black coffee upon exhale. The aroma is of earthy pine and sweet black pepper with a heavy pungency that's kicked up once the nugs are broken apart and burned away. Yin & Yang buds have rounded fat dark olive green nugs with dark amber hairs, matching undertones and a coating of frosty tiny amber crystal trichomes.", "effects": ["Calming", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Coffee", "Earthy", "Herbal", "Pepper", "Pine", "Spicy"], "flavors": ["Herbal", "Peppery", "Spicy", "Sweet", "Woody"], "relieves": ["Herbal", "Peppery", "Spicy", "Sweet", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yoda OG": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yoda-og", "img": "https://media.allbud.com/resized/350x242/media/feature/strain/yoda-og.jpg?t=ea01c77cf56fd0f4dc90141c3fe9e8f6517eefdc6ee904973d8ecd9fdc32bd58", "name": "Yoda OG", "description": "Yoda OG, also known as “Yoda,” “Yoda Kush” or “Yoda OG Kush,” is an indica dominant hybrid strain (80% indica/20% sativa) created as a descendant of the infamous OG Kush strain. Named for the iconic Star Wars character, Yoda OG packs a high that will have you feeling the force of pure giddy sedation for hours on end. The high starts with a slow creeping effect, sneaking into your brain before lifting your spirits to new heights of happy euphoria. As your spirit flies, your body will succumb to a heavy tingly physical high that will instantly lock you to the couch, providing substantial relief from aches and pains and leaving you pretty sedated. Combined with its high 19-22% average THC level, these effects make Yoda OG the perfect choice for treating conditions such as chronic stress or anxiety, depression, appetite loss or nausea, chronic pain and muscle spasms or cramps. This bud has a classic sour citrusy pine flavor with a touch of pungent earthiness, too. The aroma is woody and flowery with a sharp zap of sour citrus and a punch of heavy pungency that intensifies as the nugs are burned away. Yoda OG buds have fluffy grape-shaped minty green nugs with lots of thin orange hairs and a coating of tiny, golden-white crystal trichomes.", "effects": ["Calming", "Cerebral", "Euphoria", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Flowery", "Pungent", "Sour", "Spicy", "Woody"], "flavors": ["Citrus", "Flowery", "Peppery", "Sour", "Spicy", "Woody"], "relieves": ["Citrus", "Flowery", "Peppery", "Sour", "Spicy", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yoda OG Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yoda-og-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yoda-og-kush/tgshJgCj/00000img_00000_burst20200517213131594_co.jpg?t=b6b7c1eb2a9dc144d28803fff630bdd71c695266a090ea538a0766da9dd3d1df", "name": "Yoda OG Kush", "description": "Yoda OG Kush, also known simply as \"Yoda OG\" to most of the cannabis community, is an indica dominant hybrid (85% indica/15% sativa) strain that is a potent phenotype of the infamous OG Kush strain. This dank bud boasts a moderately high THC level that ranges from 15-24% on average and a myriad of potent indica and sativa effects. Users describe the Yoda OG Kush high as one that is builds slowly before reaching an insanely potent peak. This indica strain has a slowly building body high that peaks and leaves you completely lethargic and utterly couch-locked. You'll be melted into your seat and completely relaxed and at ease. This high almost always ends in a deep and powerful pain-free sleep upon continuation of the high. Due to these potent effects Yoda OG Kush is said to be an ideal strain for treating patients suffering from conditions such as chronic stress or anxiety, chronic pain due to injury or illness, mild to moderate cases of depression, and insomnia. Yoda OG Kush has a taste of earthy woody pine with a hint of lemon and an aroma akin to lemon pledge cleaner. These nugs have long leafy grape-shaped light minty green nugs with thin orange hairs and chunky white trichomes.", "effects": ["Body High", "Cerebral", "Relaxing"], "aromas": ["Dank", "Earthy", "Vanilla"], "flavors": ["Lemon", "Orange", "Vanilla"], "relieves": ["Lemon", "Orange", "Vanilla"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yoga Fire": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yoga-fire", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yoga-fire/QybBieKN/yoga-firejpg.jpg?t=5613a652a9113e92d3185f8c16becd5ea3260acfa47322036f0df8f9cd656fdb", "name": "Yoga Fire", "description": "Yoga Fire is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the powerful AK-47 X Fire OG strain. On the hunt for a soothing bud that will lift your spirits and leave your body feeling settled? Yoga Fire is totally the perfect choice for you. This amazing indica packs a relaxing high that will have you feeling totally tranquil and at ease with the world around you from head to toe. You'll feel the onset hit you slowly, filling your mind with a lifted sense of euphoria that is both calming and happy at the same time. You'll be free of any negative feelings or thoughts in this state, prone to falling into fits of the giggles at times. At the same time, a soothing body high will work its way throughout your entire being, helping you to actually settle down and relax before you drift off into a long and peaceful sleep. In combination with its high 19-26% average THC level, these effects make Yoga Fire a great choice for treating chronic stress or anxiety, depression, nausea or appetite loss and insomnia. This bud has a sour and citrusy flavor with a lightly spicy and dank earthy exhale. The aroma is of earthy herbs, spicy skunk and sour citrus, all wrapped up with a pungent dank. Yoga Fire buds have small rounded dark olive green nugs with dark amber undertones, thin dark amber hairs and a coating of frosty, milky trichomes.", "effects": ["Calming", "Euphoria", "Giggly", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Dank", "Earthy", "Peppery", "Pungent", "Sour", "Spicy"], "flavors": ["Citrus", "Herbal", "Peppery", "Skunky", "Sour", "Spicy"], "relieves": ["Citrus", "Herbal", "Peppery", "Skunky", "Sour", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yogi Berry": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yogi-berry", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yogi-berry/MmKFg8Ba/yogi-berryjpg.jpg?t=4d2bbd999cbf255f39960b434e104c23fc227cc8e77fd4159cb499188de9da06", "name": "Yogi Berry", "description": "Yogi Berry, also known as “Yogi Berries,” is an indica dominant hybrid strain created through crossing the delicious Mendo Berries X Lime OG strains. The perfect delicious bud for any indica lover, this bud brings on a super relaxing high that will have you feeling lifted and at ease in no time at all. You'll feel an uplifted onset hit you a few minutes after your final toke, filling you with a tingly feeling that leaves you totally euphoric and a little unfocused at times. A calming body high comes next, filling you with a sense of deep relaxation and ease that is often accompanied by a sharp pang of hunger before a ravenous case of the munchies kicks in. With these long-lasting effects and its high 20%+ average THC level, Yogi Berry is often chosen to treat conditions such as chronic stress, depression, appetite loss or nausea and headaches or migraines. This bud has a super tasty sour lemony lime flavor with a fruity berry exhale. The aroma takes an earthy turn, with a sour overtone that's accented by a punch of lemon and lime. Yogi Berry buds have small and airy rounded forest green nugs with purple undertones and a coating of tiny purple-tinted white crystal trichomes.", "effects": ["Cerebral", "Hungry", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Berry", "Fruity", "Lemon", "Lime", "Sour", "Spicy"], "flavors": ["Citrus", "Lemon", "Lime", "Sour", "Spicy", "Sweet"], "relieves": ["Citrus", "Lemon", "Lime", "Sour", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yo Mama": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yo-mama", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yo-mama/YjVTdBmP/20210702_172513jpg.jpg?t=a5727886e28ee18a2d15fafb2a6ba2864a1faed3fdde1532ba2cf13ae1059aa7", "name": "Yo Mama", "description": "Yo Mama, also known as “Yo Momma” and “Yomama,” is an indica dominant hybrid strain created through crossing the classic Afgooey X Appalachia strains. Ready to get in on this momma? Yo Mama brings on the hard-hitting indica effects, with warming overtones that will have you kicked back and dozing off in no time at all. The high starts with a creeping effect, sneaking up on the back of the mind before suddenly dropping you into a state of heady euphoria and unfocused hazy bliss. As your mind settles further and further into oblivion, a warming tingle will begin to sneak into your limbs. You'll suddenly start to fade into a heavily relaxing couchlock that has you feeling like you're permanently stuck. This warming effect quickly turns sedative, leaving you dozing here and there before you finally fall asleep. Thanks to these effects and its super high 19-20% average THC level, Yo Mama is said to have an edge in treating chronic pain, depression, chronic stress, arthritis, cramps or muscle spasms and chronic fatigue. This bud has a sour citrusy lemon flavor with a punch of sweet vanilla and caramel apple upon exhale. The aroma follows the same profile, although with hints of spiciness to it, too. Yo Mama buds have light green arrowhead-shaped nugs with golden undertones, bright orange hairs and a thick coating of frosty white crystal trichomes dripping with sweet sticky resin.", "effects": ["Body High", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Lemon", "Sour", "Spicy", "Sweet"], "flavors": ["Apple", "Citrus", "Lemon", "Sour", "Sweet", "Vanilla"], "relieves": ["Apple", "Citrus", "Lemon", "Sour", "Sweet", "Vanilla"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yuckleberry Wow": {"url": "https://www.allbud.com/marijuana-strains/hybrid/yuckleberry-wow", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yuckleberry-wow/5842/qwvemd78snyjnqlktd7s.jpg?t=3a60b6af04ee4466d2f04889e388b613e74497dbe185851c1dd9498ea1acff90", "name": "Yuckleberry Wow", "description": "A potent indica strain, Yuckleberry Wow will take your pain away within seconds. The strain has a smooth clean taste that leaves a woodsy aftertaste. The plant of this strain has small dense buds that are coated with amber hair. This high potency strain has a grassy and peppery aroma that will delight smokers and offer them a good relief from their daunting schedules. Those suffering from anxiety or chronic pain can use this strain to get rid of their nervous jitters and relax into a comfortable and peaceful state of mind. A few tokes of Yuckleberry Wow will give smokers a mellow high which makes it an ideal strain for beginners who want to experiment with something mild. It will clear the mind and help you think better. It will also relieve pain and relax and soothe your nerves. The dank strain will hit at the right spot and help you unwind and lighten up. Perfect for a cold winter evening, this strain will give you the warmth you desire and help you doze off into a restful sleep.", "effects": ["Energizing", "Euphoria", "Happy", "Uplifting"], "aromas": ["Dank", "Grassy", "Pepper", "Spicy"], "flavors": ["Pine", "Woody"], "relieves": ["Pine", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yumberry": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yumberry", "img": "https://media.allbud.com/resized/350x242/media/images/strain/yumberry/6034/woamvi0yfaqxsygoiego.jpg?t=6eba610565b6d35f72dc885af5f3377a88de58828405113e86fab2cb264cbe5b", "name": "Yumberry", "description": "Yumberry, also known as “Blueberry Yum Yum,” is a slightly indica dominant hybrid (60% indica/40% sativa) strain created through crossing the delicious DJ Short Blueberry X Durban Poison strains. Some users report that this bud is actually a cross of Blue Dream X Durban Poison, but this story of Yumberry's heritage is largely debated. One taste of Yumberry, and you'll definitely know where it gets its name – it has a sweet blueberry flavor that's accented by a hint of mint and a touch of pine. The aroma is just as delicious, with earthy pine accented by freshly picked blueberries and sweet mint. If you like the taste of Yumberry, you're going to love the well-balanced high. Yumberry has a hunger-inducing energetic effect that's perfect for giving you a boost late in the day when you still need to be able to fall asleep later. You'll be hit first with a feeling of euphoria that offers a slight influx of energy that's not overwhelming in the slightest. These effects in combination with its 17-19% THC level make Yumberry perfect for treating conditions such as chronic fatigue, pain, appetite loss, and migraines or headaches. This bud has small and piecey light green nugs with dark amber hairs and tiny bright white crystal trichomes.", "effects": ["Happy", "Hungry"], "aromas": ["Blueberry", "Earthy", "Fragrant", "Pine", "Sweet"], "flavors": ["Blueberry", "Fruity", "Sweet"], "relieves": ["Blueberry", "Fruity", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Yumboldt '47": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/yumboldt-47", "img": "https://media.allbud.com/resized/350x242/media/feature/strain/yumboldt-47.jpg?t=57d8d30ebcb027445f0f849c0e0a6fe95b6a5f9f99857f836808308d6e4585d4", "name": "Yumboldt '47", "description": "Yumboldt '47, also known as “Yumboldt-47,” is a heavily indica dominant hybrid strain (90% indica/10% sativa) created through crossing the powerful Yumboldt X AK-47 strains. This celebrity child boasts a super lifted yet soothing high that will provide heavy relief in both mind and body. You'll feel the heady effects hit you a few minutes after your final exhale, filling your brain with an expansive euphoria that has you feeling insanely happy and without a care in the world. At the same time, a slowly creeping body high will work its way into your physical form, leaving you super relaxed and in a state of pure physical calm. Your mind will remain active and creative as your body settles, before you're hit with a soothing sedation. Combined with its high 20% + average THC level, these effects make Yumboldt '47 a great choice for treating chronic stress or anxiety, depression, insomnia, chronic pain and nausea or appetite loss. This bud has a sweet and sour lemon-lime flavor with a woody exhale. The aroma is pungent and herbal with a sour citrusy overtone that turns spicy and woody as the nugs are burned away. Yumboldt '47 buds have oversized and fat spade-shaped emerald green nugs with sparse thick orange hairs and a coating of frosty, tiny white crystal trichomes.", "effects": ["Body High", "Creative", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Lemon", "Pine", "Sour", "Woody"], "flavors": ["Citrus", "Flowery", "Lemon", "Pine", "Spicy", "Sweet", "Woody"], "relieves": ["Citrus", "Flowery", "Lemon", "Pine", "Spicy", "Sweet", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}}