{"Z-Technology": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/z-technology", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Z-Technology", "description": "Z-Technology, also known as “Z-Tech,” is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the potent Zkittlez X another unknown hybrid strain. Although its second parent strain is kept a closely guarded secret, Z-Technology is often sought out by both breeders and patients alike for its insanely high potency level and long-lasting effects. That being said, be sure to mind your dosage when it comes to this bud – with its insane potency, it can knock you flat out if you're not careful. The high has a creeping effect, slowly sneaking over you before suddenly dropping you off of the face of the planet. You'll find your mind boosted with a surprisingly energetic lift of euphoria that activates your mental gears and gets you thinking. As your happiness grows and expands, a sense of relaxation will begin to creep into your body, slowly locking you to the couch and drawing you further and further into sedation. Thanks to these effects and its super high 30-31% average THC level, Z-Technology is often chosen to treat a variety of conditions including chronic fatigue, depression, insomnia, chronic stress, mood swings and headaches. This bud has a sweet and sour citrusy orange candy flavor with a spicy and gassy aroma to go with it. Z-Technology buds have dense triangle-shaped forest green nugs with amber undertones, thin amber hairs and matching crystal trichomes.", "effects": ["Cerebral", "Energizing", "Happy", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Gas", "Herbal", "Orange", "Sour", "Spicy"], "flavors": ["Candy", "Citrus", "Lemon", "Orange", "Sour", "Spicy", "Sweet"], "relieves": ["Candy", "Citrus", "Lemon", "Orange", "Sour", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Z6": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/z6", "img": "https://media.allbud.com/resized/350x242/media/images/strain/z6/Y75xcBoE/c305jpg.jpg?t=8155ebf4f4ef7f5afeb12fcd8968f01230b92e4acd56da569a8dda121ae096ad", "name": "Z6", "description": "Z6 is a rare indica dominant hybrid strain (75% indica/25% sativa) created through crossing the powerful Resin Cannatonic X Mr. Nice Afghan X Skunk strains. Hard to find on your average market outside of the Seattle or Los Angeles areas, Z6 is one indica that you need to try. With a high level of CBD and a moderate level of THC, this bud is highly medicinal in nature and well-suited for treating patients with a variety of experience levels. That being said, the Z6 high is pretty mellow in nature, with lifted effects that will have you feeling totally pain-free in both mind and body in no time at all. You'll feel an almost giddy euphoria settle in first, filling you with pure happiness and pushing out any negative moods or thoughts. As your spirits lift, a sense of physical calm will wash over you, lulling you into a state of relaxation without causing any sort of sedation. Rather, you'll be totally at ease and kicked back but able to move if you need to. With these effects and its moderate 10-15% THC level and super high 5-10% CBD level, Z6 is the perfect medicinal strain for treating conditions such as chronic stress or anxiety, depression, appetite loss or nausea, inflammation and chronic pain. This bud has a sour citrusy flavor with mouthfuls of skunk and earth upon exhale. The aroma is earthy and pungent with a heavy skunky overtone that turns sour and citrusy as the nugs are burned. Z6 buds have small dense arrowhead-shaped dark olive green nugs with purple undertones, bright orange hairs and a coating of frosty dark purple-tinted crystal trichomes.", "effects": ["Calming", "Giggly", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Skunky", "Sour"], "flavors": ["Citrus", "Skunky", "Sour", "Sweet"], "relieves": ["Citrus", "Skunky", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Z7": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/z7", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Z7", "description": "Z7, also known as “Z7 CBD” or “Z7 CBD Crew,” is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the potent Cannatonic X Mr. Nice strains. Beloved among breeders and patients alike for its high CBD level and soothing effects, Z7 is the perfect choice for any hybrid lover. Because it has a low THC level, the Z7 high is pretty mellow in nature, with effects that serve to soothe rather than to lift or leave you feeling stoned. You'll feel a light lift settle in a few minutes after your final exhale, gently lifting your spirits and filling your mind with a happy sense of calm. As your mind settles, a soothing body high will begin to settle into your limbs, helping you to stretch out and relax without causing any physical sedation. A light sleepy sense rounds out the high, helping you to settle down and get to sleep if you really want to. Thanks to these effects and its low 0-3% THC level and super high 13-18% average CBD level, Z7 is often chosen to treat conditions such as chronic pain, inflammation, insomnia, chronic stress or anxiety, PTSD and seizures or epilepsy. This bud has a sweet and fruity tropical mango flavor with a light lemon-lime exhale. The aroma is sweet and fruity with hints of fresh flowery lavender, sour lemon-lime and touches of delicious mango. Z7 buds have long spade-shaped thick minty green nugs with lots of thin orange hairs and a coating of tiny, bright white crystal trichomes.", "effects": ["Calming", "Happy", "Mellow", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Lemon", "Lime", "Sour", "Sweet", "Tropical"], "flavors": ["Flowery", "Fruity", "Lavender", "Mango", "Rose", "Sweet", "Tropical"], "relieves": ["Flowery", "Fruity", "Lavender", "Mango", "Rose", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zamal": {"url": "https://www.allbud.com/marijuana-strains/sativa/zamal", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zamal/EYPDNLAS/307-pjpg.jpg?t=caf14378206a79ed3328e5d12c6f7171f5fcbeca6c6c3b214ba9d5133d49a082", "name": "Zamal", "description": "Zamal, also known more commonly as “Reunion Zamal,” is a 100% pure sativa strain that is native to Reunion Island, a small isle located east of Madagascar. Known for its super upbeat and energizing high, Zamal is the perfect wake-and-bake for those days when you're feeling way too lazy or just need a little extra help getting up and moving. The high comes on fast and hard with a rush of clarity and cerebral energy. You'll feel an increase of focus come with this clear-headed state, allowing you to focus on any task that you have at hand on your to-do list. These effects in combination with its high 14-24% average THC level make Zamal the perfect choice for treating those suffering from conditions such as chronic fatigue, ADD or ADHD, chronic stress and depression or mood swings. This bud has a sour lemony flavor with a bright tropical mango exhale that sweetens as you continue to toke. The aroma is very similar, although with an earthy woody overtone that turns spicy as the nugs are broken apart and burned away. Zamal buds have super oversized bushy bright neon green nugs with orange undertones, lots of matching hairs and a coating of milky orange-tinted white crystal trichomes.", "effects": ["Cerebral", "Energizing", "Euphoria", "Focus", "Uplifting"], "aromas": ["Citrus", "Earthy", "Spicy", "Tropical", "Woody"], "flavors": ["Citrus", "Lemon", "Mango", "Sour", "Sweet", "Tropical"], "relieves": ["Citrus", "Lemon", "Mango", "Sour", "Sweet", "Tropical"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zamalmystik": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/zamalmystik", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zamalmystik/1n9ex5Tu/45-cjpg.jpg?t=8be086e8841453d6d491a0341fcec5567e12a1117658a283d8b58ef507f74e69", "name": "Zamalmystik", "description": "Zamalmystik, also known as “Zamal Mystik,” is a slightly dominant hybrid strain (65% sativa/35% indica) created through crossing the potent Zamal Mafate 80's X (Original Misty x [Jack Herer X Afghan]) F5 strains. Infamous for its electrifying high, Zamalmystik is the perfect hard-hitting sativa for a day when you need to get up and moving but need something to really help you get there. You'll feel the effects hit you almost immediately, jolting your brain with an almost frenzied uplifted energy that has you suddenly filled with motivation and creativity. You'll feel this buzzing energy soon work its way throughout your entire body, stimulating your limbs and giving you a get-up-and-move feeling. The heady effects can quickly become psychedelic and heady, so mind your dosage if you have things to do or if you suffer from anxiety. Combined with its high 19-20% average THC level, these vibrant effects make Zamalmystik a great choice for treating conditions such as chronic fatigue, mood swings, depression, headaches or migraines and chronic stress. This bud has a sweet and fruity flavor with a rich peppery and flowery exhale. The aroma is of fresh flowery lavender with a punch of black pepper and earthy herbs. Zamalmystik buds have heavy oversized minty green nugs with dark amber hairs and a coating of frosty blue-tinted white crystal trichomes.", "effects": ["Cerebral", "Creative", "Energizing", "Focus", "Uplifting"], "aromas": ["Earthy", "Flowery", "Fruity", "Lavender", "Spicy", "Woody"], "flavors": ["Flowery", "Fruity", "Herbal", "Spicy", "Sweet", "Woody"], "relieves": ["Flowery", "Fruity", "Herbal", "Spicy", "Sweet", "Woody"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zambezi": {"url": "https://www.allbud.com/marijuana-strains/sativa/zambezi", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zambezi/TdVAxP3q/zambezijpg.jpg?t=e96c82a67aa2f5bd32bb6007eda60ea850acb704156162fb3c3fc12e27545fd5", "name": "Zambezi", "description": "Zambezi is a 100% pure sativa strain that is a landrace native to the highlands of the regions of Zambia. Perfect for any sativa lover who’s after a bright high and a delicious flavor, Zambezi brings on the best of native landrace strains. This bud has a mouthwatering sweet and sour tropical citrus flavor with hints of fresh woodiness upon exhale. The aroma follows the same profile, with a sour citrusy overtone that’s accented by spicy herbs and fresh flowery earth as the nugs are broken apart and burned away. The Zambezi high is just as eye-opening, with motivating and energizing effects that will have you up and moving in no time at all. In fact, the high will hit you squarely between the eyes almost as soon as you exhale, filling your mind with a lifted euphoria and tingly happiness that pushes out any negative moods or thoughts immediately. You’ll find yourself filled with creative motivation and sociability that is perfect for helping you jump on artistic tasks or simply carry out conversations with those around you. With these vibrant effects and its high 14-18% average THC level, Zambezi is often chosen to treat conditions such as chronic fatigue, headaches or migraines, depression, appetite loss or nausea and chronic stress. This bud has conical forest green nugs with golden undertones, thick orange hairs and a coating of tiny golden amber crystal trichomes.", "effects": ["Cerebral", "Creative", "Energizing", "Euphoria", "Hungry", "Sociable", "Uplifting"], "aromas": ["Earthy", "Flowery", "Sour", "Spicy", "Tropical", "Woody"], "flavors": ["Citrus", "Fruity", "Sour", "Spicy", "Sweet", "Tropical"], "relieves": ["Citrus", "Fruity", "Sour", "Spicy", "Sweet", "Tropical"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zambian Copper": {"url": "https://www.allbud.com/marijuana-strains/sativa/zambian-copper", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zambian-copper/RsIqIYMm/zambian-copperjpg.jpg?t=6788cf0a427c3ef66ff33de51c41b48366dcaf5bf5a0afd39d280f4b92930e57", "name": "Zambian Copper", "description": "Zambian Copper is a super rare 100% pure sativa strain created through a combination of other unknown sativa strains. Although pretty difficult to find outside of the Middle East and some parts of Colorado, Zambian Copper is a breeder favorite for its sturdy structure and powerfully energetic high. This gorgeous girl has super dense and heavy bright neon green nugs with rich copper undertones, vivid red hairs, and a frosty thick coating of tiny bright white crystal trichomes that are practically dripping with sweet syrupy resin. As you break apart each thick nugget, sharp skunky aromas are released with a rich peppery overtone that’s accented by fresh earth. The flavor follows the same profile to a lesser degree with a pine overtone that’s slightly sweet as you continue to toke. The Zambian Copper high is definitely one for a wake-and-bake, with energetic and totally lifted effects that will get you up and moving in no time flat. You’ll feel a physical relaxation with a touch of arousal that accompanies this energizing mental state, making this bud perfect for those days when you just can’t seem to get going. In combination with its high 16-22% average THC level, these bright effects make Zambian Copper perfect for treating mood swings, chronic pain, depression, and chronic stress.", "effects": ["Aroused", "Creative", "Energizing", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Herbal", "Pine", "Pungent", "Skunky"], "flavors": ["Pine", "Skunky", "Woody"], "relieves": ["Pine", "Skunky", "Woody"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zangria": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zangria", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zangria/PleQ45eh/zkittlezjpeg.jpg?t=abe8da3c4303fa9e2f9361f9970237d55eb601ac5f3f933720a7f3243de26b9e", "name": "Zangria", "description": "Zangria is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the tasty Thin Mint Girl Scout Cookies X Zkittlez strains. Named for the classic drink and its celebrity parentage, Zangria is a great choice for any classic indica lover. Like its namesake adult beverage, Zangria packs a sweet and fruit flavor with hints of fresh cherries, rich berries and sour citrusy pineapple. The aroma is just as delicious, with a bouquet of fresh fruity berries, sweet yet sour citrusy pineapple and a punch of nutty anise. The Zangria high will settle in a few minutes after your final exhale, creeping into your brain with a growing sense of lifted happiness that pushes away any negative or racing thoughts. You'll feel them replaced with a sense of calm that permeates your entire body, leaving you feeling fully relaxed from head to toe and pretty sleepy at times. Thanks to these effects and its high 24-25% average THC level, Zangria is often chosen to treat those suffering from conditions such as chronic stress, depression, headaches or migraines, insomnia and chronic fatigue. This bud has fat heart-shaped blue-green nugs with thin orange hairs and a coating of chunky milky blue-tinted white crystal trichomes.", "effects": ["Calming", "Cerebral", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Citrus", "Fruity", "Nutty", "Pineapple", "Sour"], "flavors": ["Cherry", "Citrus", "Fruity", "Pineapple", "Sour", "Sweet"], "relieves": ["Cherry", "Citrus", "Fruity", "Pineapple", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zawt": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zawt", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zawt/bZMjVnbC/44jpg.jpg?t=4e1a2a22403000011e812a8765c79c2ce3b63b29bfef66d7798b1e7bb8168861", "name": "Zawt", "description": "Zawtz is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the delicious (Zkittlez X Gelatti X King Louis XIII OG) X (Zkittlez X Gelatti X King Louis XIII OG) strains. This powerful five-way cross packs a super heavy potency level and delicious flavor that will leave you coming back for more again and again. The Zawtz high will hit you between the eyes as soon as you exhale, catapulting your mind into a state of pure lifted energy and euphoria. You'll see stars in the best of ways, filled with a giddy sense of pure happiness and ease. This energy will soon ebb and fade away, replaced with a heady, stoney sedation that's soothing and sleepy in nature, which can leave you dozing before you know it. With these effects and its super high 25-30% average THC level, Zawtz is often chosen to treat a wide variety of conditions such as insomnia, chronic stress or anxiety, depression or mood swings and chronic stress. This bud has a sweet and fruity flavor with hints of spicy hash and super sour citrus. The aroma is of hashy diesel with a punch of sour lemons and spicy, earthy flowers. Zawtz buds have fluffy grape-shaped minty green nugs with light amber undertones, thin orange hairs and tiny, milky amber crystal trichomes.", "effects": ["Calming", "Energizing", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Diesel", "Earthy", "Flowery", "Hash", "Sour", "Spicy"], "flavors": ["Citrus", "Diesel", "Flowery", "Fruity", "Hash", "Lemon", "Sour"], "relieves": ["Citrus", "Diesel", "Flowery", "Fruity", "Hash", "Lemon", "Sour"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zed": {"url": "https://www.allbud.com/marijuana-strains/indica/zed", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zed/8126/dyyodi7nkxlxc8ibacv6.jpg?t=4f2a2f3bf96640755eb313bffbc3863959ab38d324aecfd121060ca1f67cdc32", "name": "Zed", "description": "Zed is a 100% pure indica strain that is a Hash Plant with unknown parentage. There's a general lack of knowledge where this bud comes from, although the demand for it doesn't really seem affected. With a super powerful THC level that bottoms out at 20% and long-lasting effects, Zed is one bud that will always be in demand. The Zed high hits you slowly, washing over you with a growing sense of calm before completely taking hold and lulling you into a heavy relaxation. This state will quickly become buzzy, numbing any physical or mental pains that you may be experiencing. These effects can top about 3 hours in length and can be sedative at times. Coupled with its THC level, these effects give Zed an edge in treating chronic pain, stress or anxiety, and appetite loss. Zed buds have thick grape-shaped forest green nugs with long thin bright amber hairs and a coating of tiny milky white crystal trichomes. The flavor definitely has a classic feel, with tastes of sweet pungent earth and fresh fragrant pine dancing on your tongue. The aroma has a hint of sweet floral spice to it, perfectly complementing the rich woodiness.", "effects": ["Body High", "Hungry", "Long Lasting", "Relaxing"], "aromas": ["Earthy", "Floral", "Fragrant", "Pungent", "Spicy"], "flavors": ["Pine", "Spicy", "Sweet"], "relieves": ["Pine", "Spicy", "Sweet"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zelato": {"url": "https://www.allbud.com/marijuana-strains/hybrid/zelato", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zelato/XkEg1VZm/13-cjpg.jpg?t=cb70e26519b21a2d37011de46ac1cae7da4fc95ef472644ba1409e3063c04454", "name": "Zelato", "description": "Zelato is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the mouthwatering Gelato X Zkittlez strains. Named with a nod to its celebrity parents, Zelato is the perfect tasty hybrid to help you feel like you can take on the world. The high comes roaring in immediately, rushing through your brain with a sense of lifted sense of cerebral euphoria that has you soaring to new heights of happiness. This state is pretty heady in nature, which can leave you falling in and out of focus, alternating with uncontrollable fits of the giggles. A lightly relaxing body high complements this mental boost, helping to keep your body in check throughout the duration of the high. Thanks to these effects and its high 15-24% average THC level, Zelato is often chosen to treat a variety of conditions including chronic fatigue, appetite loss or nausea, depression or mood swings and chronic pain. This bud has a sweet and fruity cherry berry flavor with a cherry-flavored woody exhale. The aroma is of sweet woody pine with a touch of spicy flowers and fresh fruity berries. Zelato buds have dense and fat spade-shaped dark olive green nugs with purple undertones, thin red-orange hairs and tiny, purple-white crystal trichomes.", "effects": ["Cerebral", "Euphoria", "Giggly", "Happy", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Flowery", "Lemon", "Pine", "Sour", "Woody"], "flavors": ["Berry", "Cherry", "Citrus", "Flowery", "Fruity", "Sour", "Sweet"], "relieves": ["Berry", "Cherry", "Citrus", "Flowery", "Fruity", "Sour", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zelda Haze": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/zelda-haze", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zelda-haze/JeE9gTXA/47-cjpg.jpg?t=313ca09f4d54cabd63cdbe12b2b694b60f00bb9ab706c4c7ba17f059f420e1cf", "name": "Zelda Haze", "description": "Zelda Haze is a sativa dominant hybrid strain (80% sativa/20% indica) created through crossing the potent Jamaican X El Nino X Headband strains. Known for its heady high and energizing boost, Zelda Haze is a great choice for any sativa lover who's after a little power to help them get up and out of bed in the morning. The high starts with an immediate rush of cerebral effects, filling your mind with a high-flying euphoria that pushes out any negative or racing thoughts. You'll feel your senses sharpen as your focus settles in, accompanied by a kick of motivation and energy that gets your mind moving on any mental task at hand. These energizing effects in combination with its moderate 14-16% average THC level gives Zelda Haze an edge in treating those suffering from conditions such as chronic fatigue, ADD or ADHD, chronic stress, depression and nausea or appetite loss. This bud has a spicy haze flavor with a lightly creamy lemony exhale. The aroma is of sour citrus with a punch of spicy haze and black pepper to it, too. Zelda Haze buds have long dense pepper-shaped bright neon green nugs with thick orange hairs and a coating of tiny bright white crystal trichomes.", "effects": ["Cerebral", "Energizing", "Euphoria", "Focus", "Motivation", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Lemon", "Pepper", "Sour", "Spicy"], "flavors": ["Citrus", "Creamy", "Herbal", "Lemon", "Spicy"], "relieves": ["Citrus", "Creamy", "Herbal", "Lemon", "Spicy"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zelda Og": {"url": "https://www.allbud.com/marijuana-strains/hybrid/zelda-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zelda-og/vHz0lrzi/e2a49d72-b706-47cc-8da4-762663186889png.jpg?t=e230e54d88d80da9e503d0277f82ec1ab669f88640ec39c5e41f6ef4ac52401a", "name": "Zelda Og", "description": "Zelda OG is an evenly balanced hybrid strain (50% indica/50% sativa) created through a potent cross of Legend OG X Orange Blossom Trail. Named for the iconic video game hero, this bud is perfect for those days when you want to go on an adventure but don't want to take it too seriously. The Zelda OG high has a relaxing overtone that hits both mind and body with a high level of potency without causing sedation or couch-lock. You'll feel a sense of calm wash over you mere minutes after your final toke, leaving you feeling totally at peace with the world around you. You'll feel a tingly effect that leaves you slightly aroused and pretty giggly at times as the high expands. Thanks to these potent effects and its super high 18-26% average THC level, Zelda OG is often chosen to treat those suffering from conditions such as chronic pain, cramps, chronic stress, depression, and chronic fatigue. This bud has a sweet anise flavor with hints of woody rose and florals and a touch of citrus upon exhale. The aroma is earthy and citrusy with a woody overtone that has a touch of flowery skunk to it. Zelda OG buds have tapered spade-shaped minty green nugs with dark orange hairs and a coating of small bright white crystal trichomes.", "effects": ["Aroused", "Calming", "Creative", "Giggly", "Relaxing"], "aromas": ["Citrus", "Earthy", "Floral", "Orange", "Woody"], "flavors": ["Citrus", "Flowery", "Sour", "Woody"], "relieves": ["Citrus", "Flowery", "Sour", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zelly’s Gift": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/zellys-gift", "img": "https://media.allbud.com/resized/350x242/media/feature/flower/zelly.jpg?t=96ea98fe019bbc7c57433c33eff7dc37d1978c3e925cb3a1b9b836a991eeca04", "name": "Zelly’s Gift", "description": "Zelly's Gift is a rare sativa dominant hybrid strain crated through a heavy cross of (Afgoo X Purple Thai X Super Lemon Haze X God Bud) X Jack Herer. This potent combination makes for a beautiful long-lasting high that leaves you upbeat and positive for hours on end. You'll feel an almost immediate onset of happy energy a few minutes after your last hit, infusing you with a sense of motivation and focus that is perfect for getting things checked off on your to-do list. You'll feel a giggly state wash over you next, leaving you laughing at anything and everything around you. In combination with its high 17-18% average THC level, these effects make Zelly's Gift perfect for treating condition such as mood swings, depression, chronic fatigue, insomnia, and chronic stress or anxiety. This bud has a sour lemon lime flavor with a savory herbal exhale. The aroma is very fresh and earthy with an herbal citrus overtone that's spicy and mellow. Zelly's Gift buds have small piecey minty green nugs with long thin amber hairs and a coating of tiny amber crystal trichomes.", "effects": ["Energizing", "Euphoria", "Focus", "Giggly", "Happy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Lemon"], "flavors": ["Citrus", "Lemon", "Lime", "Sour"], "relieves": ["Citrus", "Lemon", "Lime", "Sour"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zen - X": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/zen-x", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zen-x/2097/vovbyxsogu9ygxet2gbz.jpg?t=545993aab6b19064aad46d5771b514546717e841521da3cd6d07645a63b97ba1", "name": "Zen - X", "description": "Zen - X is a sativa-dominant hybrid (80% sativa/20% indica) that boasts an uplifting, energizing effect with substantial mind relief. Users report a smooth onset of a warming feeling followed by full-body relaxation and sedation. Be ready to feel the munchies, too, so make sure your refrigerator is stocked up! It's often used to treat patients with stomach and digestive issues, Crohn's disease, or anorexia. This dank strain is a potent cross between Mexican Sativa X Afghani X Lavender and offers the user a THC level ranging from 18-22%. Because of its moderately high THC level and full-body sedative effects, it is not recommended that new users smoke Zen - X. Seasoned users beware, too – this dank strain's potency is deceptive and will take you by surprise. Simply smell the aroma of this sour berry-infused earthy bud and you will experience an onset of a full-body body warm feeling and relaxation. The taste of this strain is smooth and earthy with flowery undertones upon exhale. Be careful not to smoke too much, or you'll experience paranoia and a racing heart.", "effects": ["Energizing", "Focus", "Happy"], "aromas": ["Citrus", "Diesel", "Earthy", "Mint", "Sour", "Woody"], "flavors": ["Berry", "Mint", "Pine"], "relieves": ["Berry", "Mint", "Pine"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zen Berry": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zen-berry", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zen-berry/IXWTo5cz/5jpg.jpg?t=8adfac4ccf0fc1f801d7599d20363dcfb70e24d4bcbdce684e14d28df87a95f5", "name": "Zen Berry", "description": "Zen Berry is an indica dominant hybrid strain (70% indica/30% sativa) created through a combination of unknown members of the Berry family. The perfect bud to help you settle and relax after a long and stressful day, Zen Berry brings on a calming and soothing high that will have you thinking back on the good times before you finally fade into a long and peaceful sleep. The high starts with a relaxing lift, filling both mind and body with a light heaviness that washes away both mental and physical aches and pains, replacing them with a soothing nothingness. This euphoric boost soon becomes sedative, leaving you dozing off before you know it. With these super calming effects and its high 15-16% average THC level and 1% CBD level, Zen Berry is often chosen to treat conditions such as chronic stress, insomnia, depression or mood swings and chronic anxiety. This bud has a sweet and fruity strawberry and blueberry flavor with a punch of earthy citrus upon exhale. The aroma is very similar, although earthier and more potent in nature. Zen Berry buds have grape-shaped forest green nugs with thin amber hairs and a coating of tiny sparkling amber crystal trichomes.", "effects": ["Calming", "Euphoria", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Citrus", "Earthy", "Herbal", "Sour", "Spicy"], "flavors": ["Berry", "Blueberry", "Fruity", "Spicy", "Strawberry", "Sweet"], "relieves": ["Berry", "Blueberry", "Fruity", "Spicy", "Strawberry", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zen Remedy": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zen-remedy", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zen-remedy/9031/izn6c6b7xj86lhziwbps.jpg?t=1e3f54f5f32e562a696024d07c10703207fbc9ab5766cc850a26d97e020f124b", "name": "Zen Remedy", "description": "Zen Remedy is an indica dominant hybrid strain created through crossing the classic Zen and Remedy strains. This bud has a very mellow high that's relaxing in nature, making it perfect for users of any experience level. The Zen Remedy high starts with a happy lift that is very light and relaxing. This sense of happiness will become slightly tingly, spreading throughout your entire body with warming waves of subtle energy that won't cause anxiety or paranoia. A touch of focus will accompany this high, lending itself well to mental tasks that don't require a lot of energy to complete. In combination with its moderate 12-14% average THC level and high 2-6% CBD level, these effects give Zen Remedy an edge in treating conditions such as chronic pain, ADD or ADHD, inflammation, chronic fatigue, muscle spasms or tremors, and seizures. This bud has a light sweet berry flavor with hints of citrusy pine on each fruity exhale. The aroma is very earthy and lemony with a mellow floral overtone. Zen Remedy buds have light green piecey grape-shaped nugs with bright orange hairs and a coating of clear crystal trichomes.", "effects": ["Focus", "Happy", "Mellow", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Floral", "Lemon", "Mellow", "Sweet", "Woody"], "flavors": ["Berry", "Citrus", "Herbal", "Pine"], "relieves": ["Berry", "Citrus", "Herbal", "Pine"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zensation": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zensation", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zensation/5844/glzfkngqrqeciphp2crc.jpg?t=80baef9e2ef6e19d20a2662c8ab7010a42bef10f024c90222c5015101ca5c746", "name": "Zensation", "description": "Zensation is an indica dominant hybrid (75% indica/25% sativa) strain that is relatively new on the market courtesy of the Ministry of Cannabis farms. This dope bud has unknown genetics due to breeder secrecy and boasts a THC level ranging from 20-24% on average. Users describe the Zensation high as one that is long lasting and provides total relaxation of the mind and body. You'll feel sleepy and comfortable and completely at ease with a moderate case of the munchies. This high will eventually ease you into a deep and peaceful sleep that is uninterrupted and invigorating. Due to these potent effects, Zensation is said to be an ideal strain to treat patients suffering from conditions such as appetite loss, chronic stress or anxiety, and sleep disorders, including insomnia, sleep apnea, and night terrors. Zensation has a delicious taste of sweet earthy berry that intensifies as you smoke and an aroma of pungent earthy berry that is reminiscent of walking through a cherry grove. These buds have supersized frosty dark neon green buds that are completely covered with dark olive green curly leaves and long furry bright red and white hairs. These nugs are caked in thick chunky trichomes and a fine layer of sticky sweet resin.", "effects": ["Body High", "Cerebral", "Relaxing"], "aromas": ["Cherry", "Woody"], "flavors": ["Cherry", "Woody"], "relieves": ["Cherry", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zen Skywalker OG": {"url": "https://www.allbud.com/marijuana-strains/indica/zen-skywalker-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zen-skywalker-og/2874/ikizzxfvtznxn3qzinnr.jpg?t=e07fc25bb7c716819381dd2876a3e0c3d8d42b3579dad8fd14ebbf12ad05837b", "name": "Zen Skywalker OG", "description": "Zen Skywalker OG is a 100% pure indica hybrid strain that is created through a potent cross of the insanely popular Blueberry X Mazar strains. This dank bud boasts a moderately THC level that ranges from 18-20% on average and a myriad of indica effects. Users describe the Zen Skywalker OG high as one that can be overwhelming for new users. This high is slowly building and will creep up on you, leaving you lethargic and completely couch-locked all of a sudden, almost out of nowhere. You'll be completely spacey with deep introspective thoughts and in a state dreamy bliss that almost always ends in a deep and pain-free sleep. Due to these potent effects, Zen Skywalker OG is said to be an ideal strain for treating patients suffering from conditions such as chronic pain due to injury or illness, muscle tension or spasms, and sleep disorders, including insomnia and night terrors. These buds have a delicious aroma of sweet berry herbs and a taste of sweet vanilla with a hint of herbal berry tea. Zen Skywalker OG buds have dense yet fluffy medium-sized light minty green popcorn-shaped nugs with dark orange hairs and a fine layer of sugary white trichomes and sweet sticky resin.", "effects": ["Body High", "Relaxing", "Sleepy"], "aromas": ["Herbal"], "flavors": ["Herbal"], "relieves": ["Herbal"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zerbert": {"url": "https://www.allbud.com/marijuana-strains/hybrid/zerbert", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zerbert/ocrgZsd3/16111692754594419640463983175619jpg.jpg?t=3b3df4525fdcc6cfcaa3a8a2ba46998eaabca155e4e5c232697d95a86c8933eb", "name": "Zerbert", "description": "Zerbert is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the delicious Blue Sherbet X Zkittlez strains. If you're on the hunt for an amazing flavor and a full-bodied high, you've found it with Zerbert. This bud brings on the mouthwatering tastes, with sweet and sour blueberry candy dancing across your tongue with each toke. The aroma is very much the same, although with hints of sharp citrus and fresh earth to it, too. The Zerbert high isn't as bright as the flavor, with effects that are more relaxing in nature, ideal for a lazy night when you want to kick back and enjoy some tunes or your favorite show on Netflix. The high starts with a subtle build, slowly working its way through your mind with expansive euphoria, easing away any negative or racing thoughts and replacing them with unfocused happiness A light tingly body high comes next, washing over your physical form and leaving you relaxed with a sharp pang of hunger hitting you quickly. With these effects and its moderately high 14-19% average THC level, Zerbert is often chosen to treat chronic pain, depression, migraines or headaches, inflammation and chronic stress. This bud has grape-shaped dark green nugs with thin orange hairs, rich blue undertones and a coating of frosty tiny white crystal trichomes.", "effects": ["Creative", "Euphoria", "Happy", "Hungry", "Relaxing", "Uplifting"], "aromas": ["Berry", "Cherry", "Citrus", "Earthy", "Fruity", "Sour", "Sweet"], "flavors": ["Berry", "Blueberry", "Candy", "Fruity", "Sour", "Sweet"], "relieves": ["Berry", "Blueberry", "Candy", "Fruity", "Sour", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zereal Milk": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zereal-milk", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zereal-milk/7Fxygnqa/feriajpg.jpg?t=ef03893f2d1a7ded73bc802807e973124bdbcceb40a2592a6558d23c6714e975", "name": "Zereal Milk", "description": "Zereal Milk is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the delicious Cereal Milk X Zkittlez strains. The perfect tasty bud for any indica lover, Zereal Milk brings on a mouthwatering flavor and super sociable high that's ideal for any lazy afternoon spent with friends. Like its parent strains, Zereal Milk has a sweet and creamy sugary vanilla flavor with a touch of fresh tropical citrus, too. The aroma is just as delicious, with a creamy vanilla overtone accented by a punch of sour tropical citrus that intensifies the more that you toke. The Zereal Milk high is one for the ages, with a super euphoric and sociable overtone that will have you feeling bright mentally while your body rests. You'll feel creative and outgoing, ready to chat with anyone around you about anything at all. As your mind lifts higher and higher, your body will settle into the couch with a happy sense of lightly heavy relaxation that helps you kick back without causing any sedation. Combined with its high 27-31% average THC level, these effects make Zereal Milk a great choice for treating chronic pain, depression or mood swings, chronic pain and cramps or muscle spasms. This bud has oversized and airy conical minty green nugs with thin orange hairs and a coating of milky, golden white crystal trichomes.", "effects": ["Calming", "Euphoria", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Citrus", "Lemon", "Sour", "Sweet", "Tropical", "Vanilla"], "flavors": ["Citrus", "Fruity", "Sour", "Sugary", "Sweet", "Tropical", "Vanilla"], "relieves": ["Citrus", "Fruity", "Sour", "Sugary", "Sweet", "Tropical", "Vanilla"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zerealz": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zerealz", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zerealz/1W6pEAPe/79-cjpg.jpg?t=8f1659d117f6a448d0bfa9d4410547223b4d65f80f309d075dc64d1e1e99cc1a", "name": "Zerealz", "description": "Zerealz is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the powerful Zkittlez X Cereal Milk strains. Looking for an insanely delicious flavor and a super euphoric yet relaxing high? Zerealz is definitely made for you. This bud packs a sweet and creamy fruity berry flavor into each and every toke, sharpened slightly by a sour citrus exhale. The aroma is earthy and herbal at the onset before settling into a sweet and fruity effect as the nugs are broken apart and burned away. The Zerealz high is just as delicious as its flavor, with lifted and happy effects that boost the spirits before helping you to settle into a long and peaceful sleep. You'll feel a budding euphoria at the onset that slowly works its way throughout your entire mind, pushing out negative thoughts and replacing them with a happy creativity. A relaxing body high accompanies this lifted state, anchoring your physical form and helping aching muscles relax and relieve tension. Combined with its moderately high 14-18% average THC level, these effects make Zerealz perfect for treating chronic pain, depression, chronic fatigue, insomnia and chronic stress. This bud has small grape-shaped forest green nugs with lots of red-orange hairs and a coating of tiny purple-tinted white crystal trichomes.", "effects": ["Creative", "Euphoria", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Citrus", "Earthy", "Fruity", "Herbal", "Sweet"], "flavors": ["Berry", "Citrus", "Creamy", "Fruity", "Sour", "Sweet"], "relieves": ["Berry", "Citrus", "Creamy", "Fruity", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zero-Gravity": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zero-gravity", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zero-gravity/0amVEXa7/hash-plantwebp.jpg?t=863028c599c30c11b080172110bb34d3ef350c8351d635ec37f127c3edf91373", "name": "Zero-Gravity", "description": "Zero Gravity is a rare slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the classic Hash Plant X Northern Lights #1 strains. Named for its lifting effects that will totally have you feeling like you're floating, Zero Gravity is perfect for any indica lover who appreciates a full-bodied high. The high starts with a lifted feeling that fills the back of the head and neck with a feeling of lightheadedness. As your mind expands into a blissful oblivion you'll feel a case of the giggles come racing in, leaving you laughing at anything and everything around you as your body begins to settle into the couch. Thanks to these effects and its moderately high 13-21% average THC level, Zero Gravity is the perfect bud for treating conditions such as nausea or appetite loss, chronic pain, depression or mood swings and chronic stress. This bud packs a super sour citrusy flavor with hints of sweet and spicy fruits throughout. The aroma takes an earthy turn, with hints of spicy peppery herbs accenting sour citrus. Zero Gravity buds have gorgeous piecey spade-shaped bright neon green nugs with minty undertones, deep amber hairs and a coating of sparkling white chunky crystal trichomes.", "effects": ["Body High", "Cerebral", "Giggly", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Citrus", "Earthy", "Fruity", "Herbal", "Sour", "Spicy"], "flavors": ["Citrus", "Fruity", "Herbal", "Sour", "Sweet"], "relieves": ["Citrus", "Fruity", "Herbal", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zeta Sage": {"url": "https://www.allbud.com/marijuana-strains/hybrid/zeta-sage", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zeta-sage/4539/lreiwo4i5qofyqikrpm0.jpg?t=de0cabbd3a314c5812720f03550b2a1dd1853d06c6d88694ec8498d2f1498228", "name": "Zeta Sage", "description": "Zeta Sage is a sativa dominant hybrid strain created through a cross of the classic S.A.G.E. X OG Kush strains. This incredibly rare bud is a favorite for its sharp flavor and classic daytime effects. Zeta Sage has an incredibly delicious taste of sweet pungent diesel with a sharp blueberry aftertaste that sweetens upon exhale. The smell is of pungent diesel with a surprisingly sweet blueberry aroma that's released as the nugs are broken apart and smoked. This bud has small leafy and airy super piecey bright forest green nugs with sparse rich amber hairs and a super sticky coating of sweet syrupy resin that seems to glisten. This bud has a characteristically uplifting high that's perfect for use on a day when you need a boost of energy with pain relief that won't weigh you down. The high starts with a rush of euphoric effects felt almost immediately after toking that offer a substantial mood boost and a feeling of motivation and purpose. This effect quickly becomes buzzy, removing any mental pain and stopping any racing negative thoughts in their tracks. This buzz slowly spreads throughout the body with a warming numbing effect, numbing any pain or tension that you may be feeling without becoming sedative or limiting functionality in any way. These well-balanced and energizing effects as well as its powerful 20%+ THC level make Zeta Sage the perfect bud for treating patients suffering from chronic fatigue, mild to moderate cases of depression, chronic pain, inflammation, and chronic stress or anxiety.", "effects": ["Body High", "Cerebral", "Energizing", "Euphoria", "Uplifting"], "aromas": ["Blueberry", "Diesel", "Pungent", "Sweet"], "flavors": ["Diesel", "Grape", "Sage", "Sweet"], "relieves": ["Diesel", "Grape", "Sage", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zhit": {"url": "https://www.allbud.com/marijuana-strains/hybrid/zhit", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zhit/6M5JQB1I/gorilla-grapejpeg.jpg?t=797c68a2ee1679d66fe36786122baf75ee0bf3e38c49b88ad183d776c0ca0b79", "name": "Zhit", "description": "Zhit is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the powerful S.A.G.E. X Gorilla Grape strains. A great bud for an afternoon when you're after a little energy and inspiration, Zhit packs a lifted high that's filled with creativity from start to finish. You'll feel an instant influx of mental energy hit you almost as soon as you exhale, filling your mind with a lifted sense of happiness and a ‘get-to-work' sense. You'll feel euphoric and outgoing as your mind is freed from the shackles of any negative or racing thoughts. At the same time, a sense of relaxation will work into your body, although it won't weigh you down in the slightest or cause any sedation. Thanks to these effects and its high 24-27% average THC level, Zhit is often chosen to treat those suffering from conditions such as chronic pain, depression, chronic stress or anxiety and headaches or migraines. This bud has a sweet and fruity berry grape flavor with a touch of spicy sage and other savory herbs. The aroma is like that of a fancy dinner out, with savory herbs, rich spices and hints of cherry wine. Zhit buds have heart-shaped forest green nugs with thick yellow-orange hairs and a coating of frosty, chunky white crystal trichomes.", "effects": ["Creative", "Energizing", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Berry", "Earthy", "Fruity", "Pine", "Sage", "Sweet", "Woody"], "flavors": ["Berry", "Fruity", "Grape", "Pine", "Sweet", "Woody"], "relieves": ["Berry", "Fruity", "Grape", "Pine", "Sweet", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zilvermist": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/zilvermist", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zilvermist/AXBYdTIB/48-cjpg.jpg?t=7f0988f43edc3ebb597a8890d52678bb501d18a99816b82505e10b2fdeb50551", "name": "Zilvermist", "description": "Zilvermist is a sativa dominant hybrid strain (70% sativa/30% indica) created through crossing the potent Kali Mist X Super Silver Haze strains. Known for its gorgeous appearance and super heady high, Zilvermist is a great choice for any sativa lover who's after a potent toke with their medicine. Like its parent strains, Zilvermist has beautiful pepper-shaped minty green nugs with long thick orange hairs and a frosty thick coating of tiny silvery white crystal trichomes. As you break apart each sticky little nugget, aromas of spicy black pepper and sour citrus are released, intensifying the more that you toke. The flavor is very similar, with hints of fresh fruity citrus, sour herbs and spicy woods with touches of fresh earth. The Zilvermist is just as delicious as the flavor, with lifted effects that will have you feeling giddy and refreshed, ready to take on the world. You'll feel an immediate influx of expansive euphoria with your first exhale, numbing the mind and replacing it with a giggly, stoney creativity. This quickly turns calming and slightly sedative, leaving you feeling calmed and relaxed without falling to sleep. Combined with its high 14-19% average THC level, these effects make Zilvermist a great choice for treating chronic stress, depression or mood swings, chronic fatigue and headaches or migraines.", "effects": ["Calming", "Cerebral", "Creative", "Giggly", "Happy", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Fruity", "Herbal", "Pepper", "Sour", "Spicy", "Woody"], "flavors": ["Citrus", "Fruity", "Herbal", "Peppery", "Spicy", "Sweet"], "relieves": ["Citrus", "Fruity", "Herbal", "Peppery", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zimbabwe": {"url": "https://www.allbud.com/marijuana-strains/sativa/zimbabwe", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zimbabwe/P2VOJxLe/zimbabwejpg.jpg?t=100d858bab7a20119ad246068f7098bd45701069c640b5bd1a55d1f933fe7fbf", "name": "Zimbabwe", "description": "Zimbabwe is a 100% pure sativa strain that is native to the regions of Zimbabwe. Known for its super giggly and arousing high, Zimbabwe is one stimulating bud that will boost the spirits in more ways than one. It starts almost as soon as you exhale, filling your mind with an uplifted euphoria and a touch of cerebral energy. Your senses will sharpen as your mental state expands, leaving you able to focus if need be but still able to relax. This effect will quickly take a heady turn, starting with a tingle that turns giggly and unfocused out of nowhere. This tingle will soon spread throughout the entire body, leaving you slightly relaxed and pretty aroused at times. Combined with its high 15-20% average THC level, these effects give Zimbabwe an edge in treating conditions such as depression or mood swings, Bipolar Disorder, cramps or muscle spasms, chronic pain and chronic stress. This bud has a sweet and sour citrusy flavor with hints of fresh sharp lemon and rich flowers upon exhale. The aroma is of lemon flavored woods with an earthy and spicy overtone that turns sour as the nugs are burned away. Zimbabwe buds have long pepper-shaped forest green nugs with dark olive green leaves, thin orange hairs and a coating of tiny bright white crystal trichomes.", "effects": ["Aroused", "Euphoria", "Giggly", "Happy", "Tingly", "Uplifting"], "aromas": ["Citrus", "Earthy", "Flowery", "Sour", "Spicy"], "flavors": ["Citrus", "Flowery", "Lemon", "Sour", "Spicy", "Sweet", "Woody"], "relieves": ["Citrus", "Flowery", "Lemon", "Sour", "Spicy", "Sweet", "Woody"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zinn": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/zinn", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zinn/F1XrHPlE/zinnjpg.jpg?t=7cc6fec243bb079dc7b5c2b6dd004791ce2a994e7503aa2d7ec375d27c5addef", "name": "Zinn", "description": "Zinn is a rare heavily sativa dominant hybrid strain (90% sativa/10% indica) created through crossing the potent Soma’s Rochbud X Gooey strains. Best known for its super stoney high, Zinn is a great bud for any patient who’s after a lifting and energizing toke that will help them forget the world’s stresses in no time flat. You’ll feel the effects smash into your brain almost immediately, launching your mind to the stars and leaving you feeling insanely euphoric with an unfocused and hazy sense. This heady state will soon take a stoney turn, dropping you off into a place of pure happiness and bliss. In combination with its high 13-19% average THC level, these effects make Zinn a great choice for treating those suffering from conditions such as chronic pain, muscle spasms or cramps, insomnia, depression and chronic fatigue. This bud has a sweet and spicy flavor with a lightly sour and earthy exhale. The aroma is very similar, with a heavily pungent overtone that intensifies the more that you toke. Zinn buds have heavy oversized dark olive green nugs with deep purple undertones, rich amber hairs and a thick frosty coating of amber crystal trichomes that are dripping with sweet sticky resin.", "effects": ["Body High", "Cerebral", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Earthy", "Herbal", "Pungent", "Sour", "Spicy", "Sweet"], "flavors": ["Herbal", "Sour", "Spicy", "Sweet"], "relieves": ["Herbal", "Sour", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zion's Amethyst": {"url": "https://www.allbud.com/marijuana-strains/hybrid/zions-amethyst", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zions-amethyst/6035/kuvgspri0ti3iqfbwpgr.jpg?t=e896f25a5b90941afdb37335a64c776584954f4a0890c540e512b76e33ecaf18", "name": "Zion's Amethyst", "description": "Zion's Amethyst is an evenly balanced hybrid (50% indica/50% sativa) strain created by breeders at the infamous Zion Botanicals farms as a potent cross between the insanely popular S.A.G.E. n' Sour X Granddaddy Purple strains. This dank bud boasts a moderately high THC level ranging from 18-21% on average and a myriad of well-balanced indica and sativa effects. Users describe the Zion's Amethyst high as one that is incredibly relaxed and euphoric with uplifting happy giggly tendencies and focused creativity. You'll feel clear-headed without too much sleepiness or sedation and a substantial level of mind and body pain relief. This is accompanied by a physical body buzz that leaves you utterly relaxed and completely blissful. Due to these potent effects, Zion's Amethyst is said to be an ideal strain for treating conditions such as chronic stress, nausea, chronic pain due to injury or illness, and insomnia. These buds have a woody berry aroma and a smooth taste of woody berry with a hint of sweet earth upon exhale. Zion's Amethyst has small heart-shaped dark olive green furry nugs with dark purple undertones and minty green patches. These nugs are specked with translucent hairs and a fine layer of milky trichomes and resin.", "effects": ["Focus", "Happy", "Uplifting"], "aromas": ["Sour", "Spicy", "Woody"], "flavors": ["Pine", "Sweet", "Woody"], "relieves": ["Pine", "Sweet", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zkittlez 2.0": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zkittlez-20", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zkittlez-20/knPyr5Dq/white-runzjpeg.jpg?t=a507f000f34b3363a2c43a51ad05b653e67b90fdc14bff8cd85846d4748ccd06", "name": "Zkittlez 2.0", "description": "Zkittlez 2.0 is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the delicious White Runtz X Zkittlez strains. A more powerful sister of the beloved Zkittlez strain, Zkittlez 2.0 packs a high potency level and giddy effects that are perfect for gearing you up for any evening-time social situation. The effects hit you pretty quickly, starting in the brain with a sense of happy calm. You'll feel a light weight behind the eyes and in the sides of your forehead as a smile creeps over your face and you find yourself freed of any negative or aching thoughts. This bliss is accompanied by a boost in sociability and a giggly sense that has you laughing at anything and everything around you. At the same time, a physical high will creep into your body, helping you to stretch out and settle down into a state of pure calm and relaxation that won't leave you sleepy. With these effects and its high 17-22% average THC level, Zkittlez 2.0 is often chosen to treat conditions such as chronic stress or anxiety, depression or mood swings and bipolar disorder. Zkittlez 2.0 has a sweet and sour tropical citrus flavor with hints of fruity berries and cherries. The aroma follows the same profile, with touches of spicy earthiness to it, too. Zkittlez 2.0 buds have oversized conical dark olive green nugs with deep purple undertones, thick orange hairs and frosty dark purple-tinted white crystal trichomes.", "effects": ["Calming", "Giggly", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Berry", "Earthy", "Fruity", "Herbal", "Spicy", "Tropical"], "flavors": ["Berry", "Cherry", "Creamy", "Fruity", "Sour", "Sweet", "Tropical"], "relieves": ["Berry", "Cherry", "Creamy", "Fruity", "Sour", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zkittlez Auto": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zkittlez-auto", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zkittlez-auto/VEKW6yEO/c309jpg.jpg?t=656e4115ed46a6ba94d243d699d86f7dfc460ce30b39dcb5c1f38565d0b7deae", "name": "Zkittlez Auto", "description": "Zkittlez Auto is a rare indica dominant hybrid strain created through crossing the infamous Zkittlez X an unknown Ruderalis strain. This bud was bred to be a fast-growing autoflowering version of its infamous parent strain, combining the best of its effects with a decently high level of potency, too. That being said, a lot of the original aspects of Zkittlez are maintained in this bud, especially the flavor. Zkittlez Auto packs as sweet and fruity candy berry flavor with just a touch of chocolate upon exhale. The aroma follows the same profile although with touches of earthiness to it, too. The Zkittlez Auto high is just as delightful as its parent strain, with long-lasting and lifted effects that will leave you feeling buzzy and happy from head to toe. You'll feel a rush of cerebral euphoria fill your mind, pushing out negative or racing thoughts and replacing them with a giddy and unfocused sense that quickly turns stoney. As your mind settles into this state of pure happiness, a deeply relaxing body high will wash over you with a tingly effect, leaving you feeling buzzy, warm and totally pain-free. With these effects and its high 20-23% average THC level, Zkittlez Auto is often chosen to treat conditions such as chronic pain, muscle spasms or cramps, depression, chronic stress, headaches or migraines and chronic fatigue. Zkittlez Auto buds have heavy and dense oversized bright neon green nugs with thick brownish-orange hairs and a coating of chunky white crystal trichomes.", "effects": ["Body High", "Cerebral", "Happy", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Berry", "Chocolate", "Earthy", "Fruity", "Herbal", "Sweet"], "flavors": ["Berry", "Candy", "Chocolate", "Fruity", "Sweet"], "relieves": ["Berry", "Candy", "Chocolate", "Fruity", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zkittlez Cake": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zkittlez-cake", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zkittlez-cake/qEeKmCwy/83-cjpg.jpg?t=05b993be6a15a107f0f005d48fb4f217950c64608bbdde7e4c03eb3b07569761", "name": "Zkittlez Cake", "description": "Zkittlez Cake is an indica dominant hybrid strain (70% indica/30% sativa or 60% indica/40% sativa) created through crossing the delicious Zkittlez X Wedding Cake strains. Ready to take a bite of this delicious cake? Zkittlez Cake definitely has a flavor that will leave your head spinning, with a sweet nuttiness to it that's accented by fresh fruity berries and a bite of sour citrus. The aroma is just as sweet, with a cakey overtone that's accented by a punch of earthy pepper and sweet fruits. The Zkittlez Cake high is definitely one that's ideal for a weekend day or weekday night, with a relaxing physical stone accompanied by a heady and alert cerebral high. You'll feel your spirits lift and a sense of creativity seep into your mind accompanied by touches of focus here and there. Your senses will be heightened as your body falls into blissful numbness, sinking into the couch and leaving you fully pain-free. Combined with its high 24-25% THC level, these effects make Zkittlez Cake ideal for treating ADD or ADHD, chronic stress or anxiety, depression, chronic pain and chronic fatigue. This bud has fat dense forest green nugs with thick amber hairs and tiny crystal trichomes.", "effects": ["Body High", "Cerebral", "Creative", "Euphoria", "Focus", "Uplifting"], "aromas": ["Berry", "Citrus", "Earthy", "Sour", "Sweet"], "flavors": ["Berry", "Fruity", "Herbal", "Nutty", "Sour", "Sweet"], "relieves": ["Berry", "Fruity", "Herbal", "Nutty", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zkittlez ZOZ": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zkittlez-zoz", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zkittlez-zoz/q3d9krz7/zkittlez-zozjpeg.jpg?t=767c260944ff9568e620ee470972181976c5fa66269f1aeb8da13f289d07e96a", "name": "Zkittlez ZOZ", "description": "Zkittlez ZOZ, also known as “ZOZ by Zkittlez,” is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the delicious Zkittlez X (Zkittlez X OG Eddy Lepp) strains. Best known for its super delicious flavor and long-lasting high, Zkittlez ZOZ is the perfect choice for any indica lover who's after a heavy stone. Like its parent strains, Zkittlez ZOZ has a super sweet and fruity berry citrus flavor with hints of spicy grapes and a touch of earthy flowers. The aroma takes a pungent turn, with a heavy spicy diesel overtone accented by sweet fruity berries, peppery grapes and sour citrus. The Zkittlez ZOZ high will settle in moments after your final exhale, filling your brain with an expansive and slightly heavy lifted sense. As your happiness grows, your eyes and head will start to feel heavy as you're overcome with a stoney cerebral sedation. This stoney feeling will soon work its way throughout your entire body, locking you to the couch and leaving you fully relaxed from head to toe. Thanks to these effects and its high 20-33% average THC level, Zkittlez ZOZ is often chosen to treat those patients suffering from conditions such as chronic pain, insomnia, depression or mood swings, cramps or muscle spasms and appetite loss or nausea. This bud has fat and dense heart-shaped forest green nugs with lots of thin orange hairs and a coating of frosty, blue-tinted white crystal trichomes.", "effects": ["Body High", "Cerebral", "Giggly", "Happy", "Hungry", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Diesel", "Flowery", "Gas", "Pungent", "Sour", "Spicy"], "flavors": ["Berry", "Citrus", "Fruity", "Lemon", "Sour", "Sweet"], "relieves": ["Berry", "Citrus", "Fruity", "Lemon", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zlushie": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zlushie", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zlushie/Pww98Ee2/28475807-a259-4361-94d8-9b508b2a63d0jpe.jpg?t=c16c725026f09c8200ef0c8ba999065cc1fb8eb394316d4b70612850dacf4dcf", "name": "Zlushie", "description": "Zlushie is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the delicious Ice Cream Cake X Grape Zkittlez X Gelato 41 strains. If you're looking for a well-balanced bud with a super delicious flavor, you've found it with Zlushie. This bud brings on amazing tastes with each and every toke, blending sweet fruits, sour grapefruit and fresh vanilla. The aroma is just as delicious, with a bouquet of fresh berries and sour citrus accented by flowery woods, sharp cherry and spicy vanilla. The Zlushie high hits you a few minutes after your final toke, filling your mind with a stimulating euphoria that gently strokes the mood, lifting it into an almost arousing calm and happiness. This heady state quickly turns hazy, leaving you unfocused but pretty happy about it. At the same time, a heavy body stone will suddenly drop into your physical form, leaving you fully immovable and ready to kick back for hours on end. Combined with its super high 20% + average THC level, these effects make Zlushie a great choice for treating those suffering from conditions such as chronic pain, inflammation, chronic stress or anxiety, cramps or muscle spasms and depression. This bud has small and dense spade-shaped forest green nugs with dark olive undertones, thin dark amber hairs and a coating of frosty, dark amber crystal trichomes.", "effects": ["Body High", "Calming", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Berry", "Earthy", "Flowery", "Fruity", "Grape", "Spicy", "Woody"], "flavors": ["Berry", "Cherry", "Citrus", "Fruity", "Grapefruit", "Sour", "Sweet"], "relieves": ["Berry", "Cherry", "Citrus", "Fruity", "Grapefruit", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zoink": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/zoink", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zoink/x2osaj3R/zoinkjpg.jpg?t=324fb6d6f184ad80cb74f19b5afe26ff5850cbf49a3fa326d530b4936dc4c26d", "name": "Zoink", "description": "Zoink is a sativa dominant hybrid strain (70% sativa/30% indica) created through an unknown combination of other sativa dominant strains. Although its parent strains are kept a closely guarded secret and are highly debated in the community, Zoink is still highly sought after for its energizing and lifted daytime effects. The high will come on fast and hard, rushing through your mind with a cerebral euphoria that instantly energizes your brain and has you feeling focused and motivated. You’ll be lifted and filled with an expansive happiness that allows your creativity to flow without being bogged down by negative moods or racing thoughts. At the same time, a relaxing body high will settle in, keeping you anchored without affecting your energy level. Combined with its super high 26-27% average THC level, these effects make Zoink a great choice for treating a variety of conditions including inflammation, irritable bowel syndrome, chronic fatigue, depression or mood swings and nausea. This bud has a sweet and sour citrusy lemon flavor with a sugary sweet minty exhale. The aroma is very similar, with a spicy menthol overtone accented by fresh fruity citrus and earthy fruits. Zoink buds have dense and fluffy popcorn-shaped bright neon green nugs with amber undertones, lots of thin orange hairs and tiny amber crystal trichomes.", "effects": ["Body High", "Creative", "Energizing", "Euphoria", "Motivation", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Fruity", "Lemon", "Menthol", "Sour", "Spicy"], "flavors": ["Citrus", "Lemon", "Menthol", "Sour", "Sugary", "Sweet"], "relieves": ["Citrus", "Lemon", "Menthol", "Sour", "Sugary", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zoinks!": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zoinks", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Zoinks!", "description": "Zoinks!, also known as “Zoinks,” is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the potent Z X Scooby Snacks strains. One taste of this bud and you'll be shouting its name, wondering why you didn't indulge in it any sooner. The Zoinks! taste has been described as a creamy, nutty sugar cookie with a hint of spicy cinnamon. The aroma is just as intriguing, with a spicy cinnamon overtone accented by pungent dank and gassy diesel. The Zoinks! high will hit you a few minutes after your final exhale, creeping up on you and beginning with a light tingle in the back and the limbs. This tingle will slowly inch its way forward, suddenly taking hold of your entire body and dropping you off into a state of pure relaxation. At the same time, this tingle will wash over your brain, boosting your spirits, making your eyes droop and leaving you with a smile on your face. With these effects and its high 21-22% average THC level, Zoinks! is often said to be perfect for treating conditions such as chronic pain, neuropathy, inflammation and cramps or muscle spasms. This bud has fluffy grape-shaped oversized emerald-green nugs with dark blue undertones, thin orange hairs and tiny, bright white crystal trichomes.", "effects": ["Body High", "Euphoria", "Happy", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Dank", "Diesel", "Gas", "Nutty", "Pungent", "Spicy"], "flavors": ["Creamy", "Dank", "Diesel", "Nutty", "Spicy"], "relieves": ["Creamy", "Dank", "Diesel", "Nutty", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zombie Cookies": {"url": "https://www.allbud.com/marijuana-strains/hybrid/zombie-cookies", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zombie-cookies/9AJV2W2E/296c3ee8-7b74-4a27-82c0-6d9291cef1e4jpe.jpg?t=6b3909d3795dc014eca1ee1ec705a4f37ce8131c2ff6d0f7c6bafdf799c62fc6", "name": "Zombie Cookies", "description": "Zombie Cookies is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic Gorilla Glue #4 X Animal Cookies strains. Best known for its surprisingly energetic high, Zombie Cookies is the perfect bud to have you flying high for hours on end. You'll feel it hit you a few minutes after your final toke, hitting your brain with a lifted cerebral energy that will activate your mental gears and get you up and running on any task at hand. At the same time, a soothing body high will wash over you, lulling you into a state of pure relaxation and ease that's free of any aches or pains. This calming state won't cause any sedation or affect your energy level in the slightest. Thanks to these effects and its high 21-22% average THC level, Zombie Cookies is often chosen to treat those suffering from conditions such as chronic stress, depression, headaches or migraines, chronic pain and cramps or muscle spasms. This bud has a spicy chocolatey mocha coffee flavor with a peppery nutty exhale. The aroma is earthy and spicy with a mocha coffee overtone that intensifies with a punch of diesel as you continue to toke. Zombie Cookies buds have fat grape-shaped minty green nugs with purple undertones, thin yellow-orange hairs and a coating of frosty, blue-tinted white crystal trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Energizing", "Euphoria", "Uplifting"], "aromas": ["Chocolate", "Coffee", "Earthy", "Herbal", "Nutty", "Peppery", "Spicy"], "flavors": ["Chocolate", "Coffee", "Diesel", "Nutty", "Spicy"], "relieves": ["Chocolate", "Coffee", "Diesel", "Nutty", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zombie Haze": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/zombie-haze", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zombie-haze/8nDAjawV/16115965932056247651374253096538jpg.jpg?t=e2744e1aa3c65555990d517ad6c6b0eeb0b7c95716793bfbbfb776f03768fb0f", "name": "Zombie Haze", "description": "Zombie Haze is a sativa dominant hybrid strain (70% sativa/30% indica) created through crossing the classic Amnesia Ganja Haze X White Widow strains. Looking for a long-lasting high that will hit hard in the head and stay? You've found it. Zombie Haze packs super heady effects that will leave you dazed and flying for hours on end. It starts with a lifted feeling, launching through your brain and shoving out any negative or racing thoughts, replacing them with unfocused introspection and bliss. This quickly turns psychoactive, leaving your mind flying higher and higher through crazed visions as your body settles into a deeply relaxing state of couch lock. With these super heady effects and its high 11-30% average THC level and 1% CBD level, Zombie Haze is said to be perfect for treating glaucoma, headaches or migraines, chronic fatigue, stress and chronic pain. This bud has a classic woody flowery flavor with a sweet diesel exhale. The aroma is very spicy and earthy with a rich diesel overtone that is accented by herbs and woods upon exhale. Zombie Haze buds have airy pepper-shaped neon green nugs with bright orange hairs and a thick blanket of glittering bright white crystal trichomes.", "effects": ["Body High", "Cerebral", "Energizing", "Uplifting"], "aromas": ["Diesel", "Earthy", "Floral", "Spicy", "Woody"], "flavors": ["Diesel", "Pine", "Spicy", "Sweet", "Woody"], "relieves": ["Diesel", "Pine", "Spicy", "Sweet", "Woody"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zombie Rasta": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zombie-rasta", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zombie-rasta/eODSAPkR/silver-hazejpg.jpg?t=37d306c98cd03fe26138ca523ba9506195a0879715ea1da96d2f4fb19f8767f4", "name": "Zombie Rasta", "description": "Zombie Rasta is a rare indica dominant hybrid strain (80% indica/20% sativa) created through crossing the classic White Widow X Silver Haze X Black Domina strains. The perfect bud for kicking back with friends after a long and stressful day, Zombie Rasta packs a relaxing and sociable high that will have you feeling good in no time at all. The perfect bud for kicking back and enjoying tunes with friends, this bud stimulates the mind while relaxing the body, keeping your spirits high and your physical state totally pain-free. You may get sleepy as you start to come down, so mind your dosage if you're out and about. In combination with its super high 20-23% average THC level, these effects make Zombie Rasta the perfect choice for treating those suffering from conditions such as chronic pain, depression, appetite loss or nausea, insomnia and cramps or muscle spasms. This bud has a classic sweet and spicy earthy flavor with light touches of rich berries. The aroma is fruity and earthy with a sweet overtone that turns spicy as the nugs are broken apart and burned away. Zombie Rasta buds have spade-shaped bright neon green airy nugs with lots of light orange hairs and a coating of frosty tiny white crystal trichomes.", "effects": ["Body High", "Euphoria", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Earthy", "Fruity", "Herbal", "Spicy"], "flavors": ["Berry", "Fruity", "Herbal", "Spicy", "Sweet"], "relieves": ["Berry", "Fruity", "Herbal", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zombie Stomp": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zombie-stomp", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zombie-stomp/9032/aicxvo6wojpot9jnsn9u.jpg?t=62377347cd925f78d6609f6428762c7dfcb0b4f55fb940f6950151906af6272d", "name": "Zombie Stomp", "description": "Zombie Stomp is a rare indica dominant hybrid strain of unknown parentage due to a high level of breeder secrecy about its background. It is thought to be a descendant of the classic Grape Stomper based on the name alone, although this has never been confirmed. Even with the lack of information about it, Zombie Stomp is one tasty bud that's sought after for its lifted clear-headed high and long-lasting effects. The Zombie Stomp high starts with a rush of euphoria that infuses your mind with a focused sense of clarity and a slight increase in energy. As your mind brightens, your body will start to drift off into a relaxing state that leaves you slightly sedated and immovable. Soon your mind will drop off into a stoney state, leaving you unfocused and sleepy for hours on end. Thanks to these potent effects and its high 17-20% average THC level, Zombie Stomp is often chosen to treat conditions such as chronic fatigue, depression, chronic stress, and migraines or headaches. This bud has a mellow and sweet herbal pine flavor with hints of tangy lemon. The aroma is woody and fragrant with an earthy overtone that's very floral and sweet. Zombie Stomp buds have round minty green nugs with long thin dark amber hairs and a coating of tiny minty green crystal trichomes.", "effects": ["Cerebral", "Focus", "Happy", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Fragrant", "Mellow", "Sweet", "Woody"], "flavors": ["Herbal", "Lemon", "Pine", "Woody"], "relieves": ["Herbal", "Lemon", "Pine", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zombie Virus": {"url": "https://www.allbud.com/marijuana-strains/indica/zombie-virus", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zombie-virus/tN6rJM3T/c67db61b-98df-4c81-bec9-fb0b68efd6fejpe.jpg?t=adaee67e7d19e7bf038a72e062f62ff6d82d2951d9a9c30e7f1cc8bf503c0a79", "name": "Zombie Virus", "description": "Zombie Virus is a rare 100% pure indica hybrid strain created through crossing the classic Pure Indica X an unknown Diesel strain. A favorite of indica lovers around the world, Zombie Virus packs a super relaxing high that will have you feeling settled and at ease after even the most stressful of days. It starts in the head with a cerebral lift that fills your mind with an almost giddy unfocused euphoria, leaving you feeling hazy and often falling victim to fits of laughter. As your mind settles, a relaxing body high will wash over you, lulling you into a light couchlock that's incredibly relaxing in nature. With these effects and its super high 21-23% average THC level, Zombie Virus is often said to be perfect for treating those suffering from conditions such as chronic pain, depression or mood swings, chronic stress, insomnia and nausea or appetite loss. This bud has a sweet yet sour spicy grape flavor with a savory diesel exhale. The aroma is very pungent and heavy with a sour diesel overtone that has hints of sour herbs and grapes. Zombie Virus buds have oversized spade-shaped olive green nugs with sparse orange hairs and a coating of tiny minty white crystal trichomes.", "effects": ["Body High", "Euphoria", "Giggly", "Happy", "Relaxing", "Uplifting"], "aromas": ["Diesel", "Earthy", "Grape", "Herbal", "Spicy"], "flavors": ["Diesel", "Grape", "Sour", "Spicy", "Sweet"], "relieves": ["Diesel", "Grape", "Sour", "Spicy", "Sweet"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zprite": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/zprite", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zprite/fuabqIl6/18jpg.jpg?t=724172040bfd86d6cf5a95454a4128513a43632226c4624a63b0c149f642e135", "name": "Zprite", "description": "Zprite is a slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the delicious Zkittlez X another unknown hybrid strain. Named for its super tasty flavor and bubbly high, Zprite is the perfect bud to brighten any sativa lover's day. Like its namesake soda, Zprite packs a sweet and sour lemony lime flavor that's pretty sugary at times. The aroma is very similar, with a sour lemon-lime overtone accented by fresh ripe berries and a touch of spice. Almost as soon as you exhale this tasty bud, you'll start to experience the Zprite high. It starts with an immediate cerebral energy that boosts your mood and pulls your mind up into a state of motivation and creativity. Negative thoughts and moods will vanish as you work away on your to-do list with ease, only stopping to chat with friends around you. Combined with its moderately high 14-18% average THC level, these effects make Zprite a great choice for treating conditions such as chronic fatigue, depression, chronic stress or anxiety and mood swings. This bud has dense and tight grape-shaped dark forest green nugs with deep purple undertones, lots of thin orange hairs and a coating of frosty tiny white crystal trichomes.", "effects": ["Cerebral", "Creative", "Energizing", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Berry", "Citrus", "Fruity", "Lemon", "Lime", "Sour"], "flavors": ["Citrus", "Lemon", "Lime", "Sour", "Sugary"], "relieves": ["Citrus", "Lemon", "Lime", "Sour", "Sugary"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zurcules": {"url": "https://www.allbud.com/marijuana-strains/indica/zurcules", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zurcules/605ng5am/20-cjpg.jpg?t=47b1eaea450e2fe9a04a63da81234d5558b3c1d2fd4cca9e846a0aa1fe5a83fd", "name": "Zurcules", "description": "Zurcules is a rare 100% pure indica hybrid strain created through crossing the potent Zkittlez X Goliath strains. Hard to find outside of the west coast, Zurcules is one indica that is made for those who love a deeply relaxing and sedative high. This powerhouse of a bud starts with a creeping effect, sneaking through your physical and mental forms with a growing sense of calm and ease, washing away any aches and pains. As you settle into pure bliss, a heavy sense of couch-lock will wash over you as well as a case of the munchies, so be sure to have some snacks on hand before you're too stoned to move. This combination quickly turns sleepy, leaving you dozing off before you even realize what's happening. In combination with its high 15-18% average THC level, these long-lasting effects give Zurcules an edge in treating those suffering from conditions such as chronic stress or anxiety, depression, appetite loss or nausea and insomnia. Zurcules has a super sour citrusy flavor with a notable spicy black pepper exhale. The aroma follows the spicier profile, with a peppery overtone that's accented by sour citrus and sweet herbs. Zurcules buds have grape-shaped minty green nugs with long thin reddish-orange hairs and a coating of tiny golden amber crystal trichomes.", "effects": ["Body High", "Calming", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Sour", "Spicy"], "flavors": ["Citrus", "Peppery", "Sour", "Spicy", "Sweet"], "relieves": ["Citrus", "Peppery", "Sour", "Spicy", "Sweet"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Zwarte Jan": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/zwarte-jan", "img": "https://media.allbud.com/resized/350x242/media/images/strain/zwarte-jan/RrPgAxCu/jack-hererjpg.jpg?t=c26323eee6b2b99584a0a4665a4bab19a7f1fef32b3fb45c1791dc20d10897b3", "name": "Zwarte Jan", "description": "Zwarte Jan is a rare slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the classic Jack Herer X Black Domina strains. If you're searching for a bud that will have you feeling both lifted and relaxed, you've found it with Zwarte Jan. This lovely lady brings on the full-bodied high, with mind-zapping energetic effects and super calming physical effects that will have you feeling stimulated yet kicked back at the same time. The high starts with a rush of cerebral effects that suddenly fill your mind with a high-flying euphoria. This is accompanied by an influx of creative energy and motivation that quickly fades into a heady case of the giggles. As you fall further and further into this giddy state, a relaxing body high will sneak over you, easing away any aches and pains without causing too much couchlock or sedation. Thanks to these effects and its high 15-18% average THC level, Zwarte Jan is often chosen to treat those suffering from conditions such as chronic pain, depression, chronic stress or anxiety and mood swings. This bud has a classic sweet and sour lemony pepper flavor with a touch of pine upon exhale. The aroma is very similar, with a lemony pine overtone that's accented by harsh black pepper and spices. Zwarte Jan buds have dense grape-shaped dusty green nugs with lots of orange hairs, dark leaves and a coating of frosty golden amber crystal trichomes.", "effects": ["Creative", "Euphoria", "Giggly", "Happy", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Sour", "Spicy"], "flavors": ["Citrus", "Herbal", "Sour", "Spicy", "Sweet"], "relieves": ["Citrus", "Herbal", "Sour", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}}