{"M&M": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/m-m", "img": "https://media.allbud.com/resized/350x242/media/images/strain/m-m/ovCmDPob/13b15088-9fd0-403f-9a4b-200bf76d48a4jpe.jpg?t=6cd2f76e673dabe5f343bb7a66bfb5d7d9de4642ceb9910671a89193c99586ed", "name": "M&M", "description": "M&M is an indica dominant hybrid strain (70% indica/30% sativa) created through an unknown combination of other hybrid strains. Named for the iconic candy, M&M packs a delicious flavor and soothing high that will have you soaring for hours and hours on end. Much like its namesake, this bud packs a sweet chocolately flavor with light touches of spicy skunk and woody pine. The aroma is on the heavier side of things, with a super skunky overtone that’s accented by woody pine and a touch of earthy chocolate. The M&M high will settle in a few minutes after your final exhale, filling your brain with an expansive happiness that pushes out any negative or racing thoughts. A light physical tingle accompanies this heady lift, filling your body with a deep relaxation that drops you into a heavy state of calm. In combination with its high 15-20% average THC level, these full-bodied effects make M&M a great choice for treating those suffering from conditions such as chronic pain, muscle spasms or cramps, chronic stress or anxiety and insomnia. This bud has hand-shaped super dense forest green nugs with thin orange hairs, dark amber undertones and a coating of frosty, amber-tinted white crystal trichomes.", "effects": ["Body High", "Calming", "Happy", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Earthy", "Herbal", "Skunky", "Spicy", "Woody"], "flavors": ["Herbal", "Pine", "Skunky", "Spicy", "Woody"], "relieves": ["Herbal", "Pine", "Skunky", "Spicy", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "M-Con": {"url": "https://www.allbud.com/marijuana-strains/hybrid/m-con", "img": "https://media.allbud.com/resized/350x242/media/images/strain/m-con/DIF76mSd/m-conjpg.jpg?t=74c9cb99c300e31c364441a8b7813a3f148dbea3c8ddf936f680b6f70dadc437", "name": "M-Con", "description": "M-Con, also known as “Afrinomicon,” is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic LA Confidential X Heirloom Malawi strains. The perfect well-balanced hybrid for any discerning patient, M-Con packs full-bodied effects that will have you feeling mentally lifted and physically relaxed for hours on end. You'll feel the mental effects first a few minutes after your final exhale as your brain is filled with a happy lift and a boost of creativity. You'll feel focused and ready to jump on any artistic task at hand or carry on conversations with friends and strangers alike. But you'd better hurry – an enveloping sense of calm comes next, filling both mind and body with a light sedation that will have you falling off the face of the planet if you're not careful with your dosage. Thanks to these effects and its high 17-19% average THC level, M-Con is often chosen to treat a variety of conditions including chronic pain, headaches or migraines, chronic stress and depression. This bud has a sweet and fruity woody pine flavor with a punch of sour lemony citrus upon exhale. The aroma is of sour skunky citrus with a spicy woody overtone that lingers long after your final toke. M-Con buds have oversized and heavy dark olive green pepper-shaped nugs with bright orange hairs and chunky purple-tinted white crystal trichomes.", "effects": ["Creative", "Focus", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Citrus", "Lemon", "Pine", "Skunky", "Sour", "Spicy", "Woody"], "flavors": ["Citrus", "Fruity", "Lemon", "Pine", "Sour", "Sweet", "Woody"], "relieves": ["Citrus", "Fruity", "Lemon", "Pine", "Sour", "Sweet", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "M.I.L.F.": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/milf", "img": "https://media.allbud.com/resized/350x242/media/images/strain/milf/4401/xyd7bgji6tivkwo7qcqi.jpg?t=3589cd3fa9797221b729719f3c507c08436b3f457ccbd4ec13a43316be832d33", "name": "M.I.L.F.", "description": "MILF is a sativa dominant hybrid (80% sativa/20% indica) strain created as a cross between the insanely powerful Trainwreck X White Widow strains. This potent bud has a THC level of up to 19% and a well-balanced combination of strong and penetrating indica and sativa effects. The MILF high starts with a physical relaxing effect that is first felt as a heavy indica feeling that weighs your head down and causes heavily droopy red eyes. You'll feel insanely uplifted with a sense of utter serenity and ease and a slight feeling of couch-lock and the munchies. The exact effects of the MILF high vary based on the breeder, but hold a common thread of heavy body effects and a cerebral high. Because of this powerful combination of effects, MILF is perfect for treating chronic stress or anxiety, mild to moderate cases of depression, nausea, and chronic pain. This bud has an aroma of earthy woody sage and a taste of sage with a hint of pungent earth and pine upon exhale that becomes more intense as you smoke. MILF buds have small airy leafy bright green pebble-shaped nugs with lots of twisty olive green leaves and a thick spattering of fiery orange hairs and sweet sticky resin.", "effects": ["Body High", "Cerebral", "Energizing", "Euphoria", "Hungry"], "aromas": ["Earthy", "Pungent", "Sage", "Woody"], "flavors": ["Nutty", "Pine", "Sage", "Sweet"], "relieves": ["Nutty", "Pine", "Sage", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "M.O.A.B.": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/mob", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mob/Onq9BDtQ/15659190535112852808172561795811jpg.jpg?t=d66d2f46b274077650acb2a8a2d6d47255835896e003ee601a5e283e954edefa", "name": "M.O.A.B.", "description": "M.O.A.B., also known as “Mother of All Buds,” is a sativa dominant hybrid strain (80% sativa/20% indica) created through crossing the classic Hindu Kush X Blueberry X Blue Dream X Chem Dawg strains. This celebrity child brings on the potent high with a THC level that falls between 20-30% on average and a myriad of long-lasting effects. You'll feel a cerebral lift at the start of the high that fills you with a sense of tingly euphoria, erasing any negative or racing thoughts. This pure sense of happiness quickly turns stoney, leaving you hazy and unfocused as your mind soars higher and higher. A relaxing body high comes next, washing over you and dropping you into a state of couch-lock and slight sedation that won't affect your mental state. With these effects and its high THC level, M.O.A.B. is often chosen to treat those suffering from conditions such as headaches or migraines, depression, mood swings, nausea or appetite loss, glaucoma, and mood swings. This bud has a sweet berry diesel flavor with a rich spicy earthy exhale. The aroma is of spicy earth and fresh fruity berries with a notable hit of pungent diesel as the nugs are broken apart and burned. M.O.A.B. buds have small rounded minty green nugs with thick orange hairs and a coating of tiny frosty amber crystal trichomes.", "effects": ["Body High", "Cerebral", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Diesel", "Earthy", "Fruity", "Herbal", "Spicy", "Sweet"], "flavors": ["Blueberry", "Diesel", "Fruity", "Herbal", "Spicy", "Sweet"], "relieves": ["Blueberry", "Diesel", "Fruity", "Herbal", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "M.T.F.": {"url": "https://www.allbud.com/marijuana-strains/hybrid/mtf", "img": "https://media.allbud.com/resized/350x242/media/feature/strain/mtf.jpg?t=1529d4ffe9abe7974904a87d0147f45047fcfb8ac3bf3555a9201859be750daf", "name": "M.T.F.", "description": "M.T.F. is also popularly known as Matanuska Thunder Fuck. It is a hybrid strain, which is recognized for being extremely potent for even the experienced marijuana user. Coming from Alaska, it smells quite musky with earthy undertones. But its taste is something that will keep you coming back for more, during the inhale the strain will leave a chocolaty aftertaste in your mouth for hours. As for the nugget itself, it is covered by icy white hairs that should remind you of its snowy homeland. After smoking the strain, the effects will kick in slowly and gradually, but then reaches a point where you will get a strong body buzz. Its dirty name gives you more than enough reason to stay clear of it if you are a first time medical marijuana user. But then again, it is excellent for patients suffering from a variety of medical conditions including migraines, stress, nausea, anxiety and even an upset stomach. But that is not all, as it is just as effective at calming a patient and can help individuals suffering from anorexia.", "effects": ["Creative", "Euphoria", "Happy", "Relaxing"], "aromas": ["Chocolate", "Earthy", "Fruity", "Pungent", "Sweet"], "flavors": ["Chocolate", "Nutty", "Sweet", "Vanilla"], "relieves": ["Chocolate", "Nutty", "Sweet", "Vanilla"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "M1": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/m1", "img": "https://media.allbud.com/resized/350x242/media/images/strain/m1/5qGQ8waV/3f6748f0-4349-4508-a2e4-68941cfe643aweb.jpg?t=a8cdf9d72ffa1c58d43ac659945fea062a8c317b361d2ef4e5a994cadfe209e8", "name": "M1", "description": "M1 is a rare slightly indica dominant hybrid strain (55% indica/45% sativa) created through a backcross of the potent Titan OG. This bud may be hard to come by on your average market, but it's definitely a breeder and patient favorite thanks to its well balanced effects and insanely high THC level that bottoms out at about 22-23% on average. The M1 high starts with a lift of the spirits, infusing your mind with a sense of hazy euphoria that immediately erases any negative or racing thoughts. As your mind lifts, your body will begin into a deeply relaxing tingly state that leaves you totally couch-locked and immovable with a sharp pang of hunger. Thanks to these effects and its high THC level, M1 is said to be perfect for treating those suffering from conditions such as mood swings, appetite loss or nausea, chronic stress, and chronic pain. This bud has a super spicy and herbal flavor with a notable mouthful of pine upon exhale. The aroma is of woody earth and pine with a touch of spicy herbs that intensifies as the nugs are broken apart and burned. M1 buds have grape-shaped bright neon green nugs with lots of thin orange hairs and a coating of frosty sandy amber crystal trichomes.", "effects": ["Body High", "Euphoria", "Hungry", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Herbal", "Pine", "Spicy", "Woody"], "flavors": ["Herbal", "Pine", "Spicy"], "relieves": ["Herbal", "Pine", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "M2": {"url": "https://www.allbud.com/marijuana-strains/sativa/m2", "img": "https://media.allbud.com/resized/350x242/media/images/strain/m2/WnnoamKR/20230228_201107jpg.jpg?t=4251013a8abd1260f08dac06d76548103f0cce600826b7242d87aecc57d8c6b8", "name": "M2", "description": "M2 is a 100% pure sativa strain created through crossing a variety of landraces, Sri Lankan X Original Thai Acapulco Gold X (South African X Original Haze) to be specific. Known for its super delicious flavor and surprisingly anxiety-free effects, M2 is perfect for any sativa lover who appreciates a classic high. This bud has a sweet and sour spicy lemony citrus flavor with a flowery and hazy exhale. The aroma is of earthy herbs with flowery haze and spicy sharp citrus that intensify the more that you toke. The M2 high comes rushing in almost as soon as you exhale, slamming into your mind with has been described as an intensely euphoric lift that's free of any anxiety whatsoever. You'll feel focused with a creative intensity and motivation that gets your running on any artistic or mental task at hand. From start to finish, you'll feel energized in both mind and body without feeling too frenzied. With these effects and its high 19-20% average THC level, M2 is the perfect wake-and-bake strain for treating chronic fatigue, ADD or ADHD, depression, chronic stress and mood swings. This bud has long tapered spade-shaped forest green nugs with thin orange hairs and a coating of frosty blue-tinted white crystal trichomes.", "effects": ["Creative", "Energizing", "Euphoria", "Focus", "Sociable", "Uplifting"], "aromas": ["Citrus", "Earthy", "Flowery", "Sour", "Spicy"], "flavors": ["Citrus", "Herbal", "Lemon", "Sour", "Spicy", "Sweet"], "relieves": ["Citrus", "Herbal", "Lemon", "Sour", "Spicy", "Sweet"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "M7": {"url": "https://www.allbud.com/marijuana-strains/hybrid/m7", "img": "https://media.allbud.com/resized/350x242/media/images/strain/m7/dWCuGkzN/m7jpg.jpg?t=b4befa276f97f4db1ffc8588d4d03532ac37f7baf1b1f7754b0d36bc50125a37", "name": "M7", "description": "M7 is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic Master OG X Sour Diesel strains. Although hard to find on your average market, M7 is often sought after for its insanely high 19-25% average THC level and powerful effects that are perfect for any hybrid lover. The high starts with a lifted effect that launches through your mind with a sense of pure euphoria and ease, filling you with creative energy and motivation that lends itself well to any artistic task that you have at hand. As your mind lifts higher and higher, a touch of motivation will settle in, giving you the oomph that you need to take on your to-do list with ease. With these long-lasting effects and its high THC level, M7 is often chosen to treat those suffering from conditions such as mood swings, chronic stress, depression, chronic fatigue, and nausea. M7 has a fresh sweet and sour diesel flavor with a hint of skunky earth and herbs upon exhale. The aroma is of earthy diesel and skunky herbs with a touch of spicy sour pine as the nugs are broken apart and burned. M7 buds have oversized dense spade-shaped bright neon green nugs with vivid orange hairs and a coating of chunky amber crystal trichomes.", "effects": ["Creative", "Energizing", "Euphoria", "Giggly", "Happy", "Motivation", "Uplifting"], "aromas": ["Diesel", "Earthy", "Pine", "Skunky", "Sour"], "flavors": ["Diesel", "Herbal", "Pine", "Sour", "Sweet"], "relieves": ["Diesel", "Herbal", "Pine", "Sour", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "M8 Blue": {"url": "https://www.allbud.com/marijuana-strains/sativa/m8-blue", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-sativa.1445e20d7ce4.png", "name": "M8 Blue", "description": "M8 Blue is a 100% pure sativa strain that is said to be a landrace from unknown regions. A favorite in Northern California, M8 Blue packs a gorgeous appearance and an energizing high that will have you feeling fine from head to toe. Like its name suggests, M8 Blue has super fat and heavy oversized pepper-shaped olive green nugs with bright blue undertones, thin orange hairs and a coating of tiny, milky blue-tinted crystal trichomes. As you pull apart each sticky little nugget, aromas of fruity chemicals and sour, lemony citrus are released, intensifying in potency the more that you toke. The flavor is on the sweeter side of the spectrum, with a sugary strawberry taste accented by sour lemony citrus and earthy herbs. The M8 Blue high will hit you almost as soon as you experience your first tasty exhale, rushing into your mind with a lifted sense of giddy energy. Your mind will feel stimulated with a light tingly sense that serves to numb the brain rather than to activate it. While your euphoria grows to endless heights, a sharp pang of hunger will overtake your body, leaving you reaching for anything and everything in sight to quell your uncontrollable munchies. Thanks to these effects and its high 20-23% average THC level, M8 Blue is often chosen to treat those suffering from conditions such as chronic stress or anxiety, depression, chronic fatigue, headaches or migraines and chronic pain.", "effects": ["Energizing", "Happy", "Hungry", "Tingly", "Uplifting"], "aromas": ["Berry", "Citrus", "Earthy", "Lemon", "Sour", "Strawberry"], "flavors": ["Berry", "Citrus", "Fruity", "Lemon", "Sour", "Sweet"], "relieves": ["Berry", "Citrus", "Fruity", "Lemon", "Sour", "Sweet"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "MAC1": {"url": "https://www.allbud.com/marijuana-strains/hybrid/mac1", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mac1/8z9RNjCZ/20190918_211828jpg.jpg?t=814323a48ac8e49a33895f08a2701cb394d89dc68ed07303ae81f6a3878fc31c", "name": "MAC1", "description": "MAC 1, also known as “Miracle Alien Cookies X1.” Is an evenly balanced hybrid strain (50% indica/50% sativa) created as a backcross of the iconic MAC strain. This celebrity child takes the beloved effects of MAC and amps it up a notch to a whole new level, with a super lifted feeling that will have you flying higher and higher the more that you toke. The high starts in the head with a rushing euphoria that fills your mind with an expansive happiness, gently easing away negative or racing thoughts and replacing them with creative motivation and pure happiness. A relaxing body high accompanies this cerebral lift, keeping you tethered to the world below as your mind soars higher and higher into outer space. In combination with its super high 20-23% average THC level, these heavy effects make MAC 1 perfect for treating those suffering from conditions such as chronic pain, mood swings, chronic fatigue, depression and chronic stress. This bud has a classic sour diesel flavor with a spicy herbal overtone that's accented by sweet citrus. The aroma is very similar, although with a heavy pungent overtone that lingers long after your final toke. MAC 1 buds have rounded fluffy dark olive green nugs with rich purple undertones, thin orange hairs and a coating of tiny white crystal trichomes.", "effects": ["Creative", "Euphoria", "Happy", "Motivation", "Relaxing", "Uplifting"], "aromas": ["Diesel", "Herbal", "Pungent", "Sour", "Spicy"], "flavors": ["Diesel", "Herbal", "Sour", "Sweet"], "relieves": ["Diesel", "Herbal", "Sour", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "MAC 10": {"url": "https://www.allbud.com/marijuana-strains/hybrid/mac-10", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mac-10/V79YHhBy/c154jpg.jpg?t=02fba2c61e53881d1b1e4d652c6f543c94b442761155e58c3a4b6b0f3b618642", "name": "MAC 10", "description": "MAC 10, also known as “Miracle Alien Cookies 10,” is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the infamous MAC F2 X (Unknown Colombian Landrace X Starfighter). With parents like these, you know you're in for one crazy ride with MAC 10. This bud brings on the high-flying euphoria, with heavily cerebral effects that launch you into outer space and leave you there. This effect hits you almost instantly, smashing into your brain and leaving you insanely happy with a slightly unfocused and hazy sense. A deeply relaxing body high accompanies this heady lift, keeping you anchored as your mind flies higher and higher. Thanks to these effects and its super high 32% average THC level, MAC 10 is often chosen to treat patients suffering from conditions such as headaches or migraines, chronic pain, depression and chronic stress. This bud has a super spicy fruity berry flavor with a heavily gassy exhale. The aroma is very pungent and gassy with a diesel overtone that has touches of sweet and spicy berries to it, too. MAC 10 buds have fluffy oversized forest green nugs with dark green undertones, lots of furry orange hairs and a coating of frosty blueish-green tinted white crystal trichomes.", "effects": ["Cerebral", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Diesel", "Earthy", "Pungent", "Spicy", "Sweet"], "flavors": ["Berry", "Diesel", "Fruity", "Herbal", "Spicy"], "relieves": ["Berry", "Diesel", "Fruity", "Herbal", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "MAC Burger": {"url": "https://www.allbud.com/marijuana-strains/hybrid/mac-burger", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mac-burger/O6Hq7oO1/mac-burgerjpg.jpg?t=0ca058e8799e7ee767f81d98e6603eb80e2817773a7f850a1bd3eb2856596878", "name": "MAC Burger", "description": "MAC Burger, also known as “M.A.C. Burger,” is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the iconic (MAC X Tropicana Cookies) X Donny Burger strains. If you're looking for a classic hybrid with full-bodied effects that can actually knock you flat out, you've found it with MAC Burger. This bud has a super high potency level that can leave the less experienced among us spinning, so mind your dosage if you have plans other than sleeping! The high will hit you almost immediately, slamming into your brain with a high-flying sense of giddy euphoria that has you free of any mental aches or pains. A soothing sense of calm comes next, washing over you and dropping you off into a state of pure physical and mental relaxation that can be heavily sedative for some. Combined with its super high 26-29% average THC level, these hard-hitting effects make MAC Burger a great choice for experienced patients suffering from chronic stress or anxiety, depression or mood swings, chronic fatigue, insomnia and appetite loss or nausea. This bud has a sweet yet sour citrusy lemon diesel flavor with a super dank exhale. The aroma is heavy and pungent with a. sour citrusy lemon overtone accented by gassy diesel and hearty dank. MAC Burger buds have dense and long spade-shaped forest green nugs with golden undertones, thin dark orange hairs and tiny, golden-amber crystal trichomes.", "effects": ["Calming", "Giggly", "Happy", "Hungry", "Sociable", "Uplifting"], "aromas": ["Citrus", "Dank", "Diesel", "Gas", "Lemon", "Pine", "Sour", "Woody"], "flavors": ["Citrus", "Lemon", "Pine", "Sour", "Spicy", "Sweet", "Woody"], "relieves": ["Citrus", "Lemon", "Pine", "Sour", "Spicy", "Sweet", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Machine gun": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/machine-gun", "img": "https://media.allbud.com/resized/350x242/media/images/strain/machine-gun/5462/ue7zopm5oevbq8zjvfjq.jpg?t=65eec82e7a18bd3b64511fff92776000357da4e0f7acb6645447c11d3bd3069a", "name": "Machine gun", "description": "Machine Gun, also known as “Machine Gun Funk,” is a sativa dominant hybrid strain created through a four-way cross of the infamous Pure Haze X Skunk X G-13 X AK Confidential strains. With a powerful 22% average THC level and a funky flavor, Machine Gun is one hard-hitter that you'll want in your arsenal. The flavor of Machine Gun is definitely one for the ages – it is said to have a super dense and deep herbal taste that has a skunky lemon aftertaste that hangs around for hours, sticking to your tongue with a notable pungency that just won't leave. The aroma is a little mellower, with a spicy skunky effect that's accented by sweet lemon and subtle spices. The high of Machine Gun is just as funky as the flavor, with long-lasting effects that hit you like a freight train and just won't quit for hours on end. It starts with an immediate effect, slamming into your mind with an uplifted and slightly stoney cerebral rush. As this effect builds, your body will start to go numb from a slight body high that leaves you feeling relaxed and lazy. Coupled with its powerful 22% average THC level, these effects make Machine Gun perfect for treating mood swings, depression, chronic pain, and muscle spasms or cramps. Machine Gun buds have chunky bright neon green nugs with sparse long twisty amber hairs and oversized chunky white crystal trichomes.", "effects": ["Uplifting"], "aromas": ["Lemon", "Pungent", "Skunky", "Spicy"], "flavors": ["Herbal", "Lemon"], "relieves": ["Herbal", "Lemon"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Maclato": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/maclato", "img": "https://media.allbud.com/resized/350x242/media/images/strain/maclato/2f23cKoi/maclatojpg.jpg?t=a6084d9eefbd8ce9045361992f9efd4fac032a85745e26dbcef8d1a33202e0c4", "name": "Maclato", "description": "Maclato, also known as “MAC Lato” or “MAClato,” is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the classic Gelato X Grape MAC strains. The perfect celebrity child for any high-powered indica lover, Maclato packs a punch of delicious flavors and effects. Like its parent strains, Maclato has a sweet and fruity citrusy flavor with a lightly lemony and woody exhale. The aroma is very similar, with an earthy flowery overtone accented by fresh berries and sour citrusy diesel. The Maclato settles in a few minutes later, filling your brain with a lifted sense of pure heady euphoria. You'll feel insanely happy and totally unfocused, mentally calmed and free of any rushing thoughts or negative moods. The physical effects come next, washing over your body and dropping you into a state of pure relaxation and ease that will eventually leave you fully locked to the couch, although not quite sedated. Combined with its high 21-29% average THC level, these effects make Maclato a great choice for treating conditions such as chronic pain, cramps or muscle spasms, arthritis, hypertension, depression and chronic stress. This bud has oversized and heavy hand-shaped bright emerald-green nugs with dark purple undertones, orange hairs and a coating of tiny, white crystal trichomes.", "effects": ["Body High", "Calming", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Diesel", "Flowery", "Grape", "Lemon", "Sour", "Spicy", "Woody"], "flavors": ["Citrus", "Diesel", "Flowery", "Lemon", "Sour", "Spicy", "Sweet"], "relieves": ["Citrus", "Diesel", "Flowery", "Lemon", "Sour", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mac N Cookies": {"url": "https://www.allbud.com/marijuana-strains/hybrid/macn-cookies", "img": "https://media.allbud.com/resized/350x242/media/images/strain/macn-cookies/dit1kAYs/1642574953597103187917708766496jpg.jpg?t=3e7e2eb0ea09e368fbb25c85f24807d9a87d06eb38f44ed070880d3aa4b13c34", "name": "Mac N Cookies", "description": "Mac'N Cookies, also known as “Mac N Cookies,” is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic Miracle Alien Cookies (MAC) X Alien Cheese strains. Famous for its unique yet super delicious flavor, Mac'N Cookies is perfect for any hybrid lover who loves a high level of potency to their medicine. This bud has a sweet and creamy cheesy flavor accented by touches of nutty cookies and peppery earth. The aroma is heavier, with a pungent gassy overtone accented by spicy herbs and creamy cheese. The Mac'N Cookies high settles in a few minutes after your final toke, filling your mind and body with a light tingly sense. This tingle quickly intensifies, taking hold of your entire being and leaving you feeling super aroused. Your mind will be filled with an expansive creativity and happiness while your body settles into a stimulated yet relaxing physical high. Combined with its super high 23-29% average THC level, these effects make Mac'N Cookies perfect for treating chronic pain, appetite loss or nausea, chronic fatigue, depression or mood swings and chronic stress. This bud has long pepper-shaped bright neon green nugs with lots of thin orange hairs and a coating of frosty white crystal trichomes.", "effects": ["Aroused", "Creative", "Euphoria", "Hungry", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Diesel", "Earthy", "Herbal", "Pepper", "Pungent", "Sour", "Spicy"], "flavors": ["Flowery", "Herbal", "Peppery", "Sour"], "relieves": ["Flowery", "Herbal", "Peppery", "Sour"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "MAC N Jack": {"url": "https://www.allbud.com/marijuana-strains/hybrid/mac-n-jack", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mac-n-jack/8T6rE8Xv/50jpg.jpg?t=17bb3bcef651feb2939ca3cce1b351b5794ad674e06a89771f3a6cfb823d1d30", "name": "MAC N Jack", "description": "MAC N Jack is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the potent MAC1 X Jack Herer strains. This celebrity child packs a super heavy high with soothing effects that are definitely best-suited for experienced patients due to its high level of potency. The high starts with a creeping effect, sneaking into your mind slowly before suddenly taking hold. Out of nowhere, you'll find your brain lifted into a heady unfocused state that's filled with vibrant artistic visions and happy bliss. A relaxing body high comes next, working its way slowly into your limbs and weighing them down, leaving you feeling calm and kicked back from head to toe, unable to move for hours on end. In combination with its super high 25-30% average THC level, these potent effects give MAC N Jack an edge in treating experienced patients suffering from chronic stress or anxiety, PTSD, depression or mood swings, chronic pain and muscle spasms or cramps. This bud has a classic sour citrusy flavor with a punch of woody pine upon exhale. The aroma takes after its Jack Herer parentage, with a punch of potent PineSol. MAC N Jack buds have fat and fluffy spade-shaped dusty green nugs with dark leaves, thick orange hairs and a coating of tiny milky amber crystal trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Creative", "Relaxing"], "aromas": ["Citrus", "Earthy", "Lemon", "Nutty", "Pine", "Sour", "Woody"], "flavors": ["Citrus", "Lemon", "Sour", "Woody"], "relieves": ["Citrus", "Lemon", "Sour", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mad Max": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/mad-max", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mad-max/Tdu9p2DS/20220905_190525jpg.jpg?t=fab5ec1dad5e766da056c73c7fea359ea9875e038c51f545ca9efabc9158ab3e", "name": "Mad Max", "description": "Mad Max, also known as “Mad Max #33,” is a slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the classic Amnesia Haze X Top44 strains. If you're after a well-balanced hybrid with effects that will have you feeling energized and outgoing, Mad Max is the perfect choice for you. The high hits you fast and hard, filling your brain with a lifted sense that increases your energy levels exponentially while also infusing you with increased sociability. You'll be creative and slightly focused in this state, helping you to easily take on your to-do list or jump on any artistic task at hand. Combined with its high 18-21% average THC level, these effects make Mad Max a great choice for treating those suffering from conditions such as depression, chronic stress, mood swings, chronic fatigue and chronic pain. This bud has a sour citrusy flavor with a lightly flowery and hazy exhale that intensifies in spiciness the more that you continue to toke. The aroma is of fresh lemony haze with a flowery lavender overtone that's pleasantly mild. Mad Max buds have small rounded olive green nugs with thin red-orange hairs and a coating of tiny, amber white crystal trichomes.", "effects": ["Creative", "Energizing", "Euphoria", "Happy", "Sociable", "Uplifting"], "aromas": ["Citrus", "Earthy", "Flowery", "Lavender", "Lemon", "Sour", "Spicy"], "flavors": ["Citrus", "Flowery", "Fruity", "Herbal", "Lemon", "Sour", "Spicy"], "relieves": ["Citrus", "Flowery", "Fruity", "Herbal", "Lemon", "Sour", "Spicy"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Madness": {"url": "https://www.allbud.com/marijuana-strains/indica/madness", "img": "https://media.allbud.com/resized/350x242/media/images/strain/madness/5465/emcyz9pcw6eodwywg3rg.jpg?t=f8af8638f6b731cc3d30021b03bba4572e83431f6031ac2424b3315cf98fe493", "name": "Madness", "description": "Madness is a 100% indica hybrid strain created through crossing the classic Bubba Kush X G-13 strains. Although there are many iterations of the Madness variety, this particular mix is the true first Madness strain. Don't let the name scare you – this powerful bud isn't one to cause madness - that is unless you go mad for another taste of this bud. The flavor is said to be like that of a classic kush, with a spicy herbal overtone accented by tart lemons. The aroma is a little more pungent, with a skunky effect that hits first followed by a sour lemon smell that's accented by notable black pepper. The Madness high starts with a cerebral euphoric rush that numbs your mind and leaves you feeling happy and unaware of anything really going on around you. As you fall further and further into introspection, your body will be hit with a creeping body high that suddenly takes hold, pulling you down into a heavy-couch lock and leaving you yawning, practically begging for sleep. With these effects and its THC level that bottoms out at 14%, Madness is perfect for treating chronic pain, insomnia, muscle spasms or tremors, and chronic depression. Madness buds have lumpy light minty green spade-shaped nugs with lots of furry orange hairs and a dusting of tiny milky white crystal trichomes.", "effects": ["Body High", "Cerebral", "Happy"], "aromas": ["Citrus", "Kush", "Pungent", "Skunky", "Spicy"], "flavors": ["Herbal", "Lemon", "Spicy"], "relieves": ["Herbal", "Lemon", "Spicy"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Magic Bullet": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/magic-bullet", "img": "https://media.allbud.com/resized/350x242/media/images/strain/magic-bullet/98tq39hM/2jpg.jpg?t=971b48075699ad3d5029d337cb11f97b7dba624f9953845e1604d54030ee197f", "name": "Magic Bullet", "description": "Magic Bullet, also known as “Magic Bullet CBD,” is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the potent Otto II X Wife strains. If you're looking for the perfect high-powered and highly medicinal bud to really help you feel some sweet relief, Magic Bullet is the perfect choice for you. This bud packs calming and lifted effects that will have you flying high yet feeling soothed from head to toe. You'll feel these effects in both mind and body for hours on end, which helps you feel a high level of relief from any physical or mental aches and pains. With these calming effects and its high 21-23% average THC level and super high 17-20% CBD level, Magic Bullet is the perfect highly medicinal option to kill the effects of chronic stress or anxiety, inflammation, chronic pain, depression and insomnia. This bud has a sweet and sour citrusy fruity flavor with a lightly spicy and flowery exhale. The aroma is very similar, with a spicy flowery overtone accented by peppery skunk and fresh fruity citrus. Magic Bullet buds have oversized spade-shaped olive green nugs with dark amber-orange hairs and a coating of frosty chunky amber crystal trichomes.", "effects": ["Body High", "Calming", "Euphoria", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Dank", "Fruity", "Herbal", "Skunky", "Spicy", "Sweet"], "flavors": ["Berry", "Flowery", "Sour", "Sweet"], "relieves": ["Berry", "Flowery", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Magic Dragon": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/magic-dragon", "img": "https://media.allbud.com/resized/350x242/media/images/strain/magic-dragon/8540/qgnjofg1ipgy109jw1l0.jpg?t=df59d1d881aa3ca7523cb9545bb5a51a43c5012da142340f6e9b8cee4fd312d3", "name": "Magic Dragon", "description": "Magic Dragon is a rare indica dominant hybrid strain created through crossing the infamous Magic Bud X Godzilla Grape strains. Along with its insanely happy and lifted high, Magic Dragon brings on a truly magical flavor that will leave you begging for more. This bud has as sweet minty candy flavor with hints of fresh and fruity grape on each smooth exhale. The aroma is very spicy and herbal with a minty berry overtone and a touch of grape. Magic Dragon buds have small round olive green nugs with lots of thin amber hairs and a coating of matching crystal amber trichomes. The Magic Dragon high is just as otherworldly as its flavor, with relaxing and happy effects that are better suited for the late afternoon or nighttime. The high starts with a happy uplifted state that infuses you with a sense of euphoria without affecting your energy level. Your mind will start to feel hazy as the high builds, dropping you off into a sleepy sedated state of blissful happiness. Thanks to these effects and its high 15-17% average THC level, Magic Dragon is often chosen by patients suffering from conditions such as chronic stress or anxiety, nausea, chronic pain, insomnia, and nausea or appetite loss.", "effects": ["Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Fruity", "Grape", "Herbal", "Sweet"], "flavors": ["Candy", "Fruity", "Grape", "Mint"], "relieves": ["Candy", "Fruity", "Grape", "Mint"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Magic Johnson": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/magic-johnson", "img": "https://media.allbud.com/resized/350x242/media/images/strain/magic-johnson/q9uGm8wE/20200211_200646jpg.jpg?t=17a8b968295d937340e6638cad0411d9a3b1526be7176d5486483ed693d2749b", "name": "Magic Johnson", "description": "Magic Johnson is a rare sativa dominant hybrid strain (75% sativa/25% indica) created through crossing the classic Durban Poison X The White strains. Whether you're a fan of the OG Magic Johnson or just appreciate a clever name for a bud, this one's for you. Magic Johnson packs a truly dreamy high that's perfect for kicking back at the end of a long day with friends when you're not ready to hit the hay just yet. You'll feel an influx of giddy euphoria at the onset of the high that lifts your spirits and leaves you feeling slightly unfocused and totally giggly. You'll be completely relaxed in this state, both physically and mentally, with a light couch-lock that keeps you anchored. With these lifted effects and its high 22%+ average THC level, Magic Johnson is the perfect choice for treating conditions such as chronic fatigue, depression, mood swings, nausea, and migraines or headaches. This bud has as classic sweet woody pine flavor with a light sour citrus exhale. The aroma is earthy and pungent with a woody overtone that turns sour as the nugs are broken apart and burned. Magic Johnson buds have super frosty fluffy forest green heart-shaped nugs with bright orange hairs scattered throughout.", "effects": ["Cerebral", "Euphoria", "Giggly", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Pungent", "Sour", "Woody"], "flavors": ["Citrus", "Herbal", "Pine", "Sweet", "Woody"], "relieves": ["Citrus", "Herbal", "Pine", "Sweet", "Woody"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Magic Mango": {"url": "https://www.allbud.com/marijuana-strains/hybrid/magic-mango", "img": "https://media.allbud.com/resized/350x242/media/images/strain/magic-mango/uFKX52JZ/04235767-be70-49cd-88a8-cf61f2955fe2jpe.jpg?t=e15664d3569b77d8e6f1f9302a6fc7981b3f6db11cf60b2a72d8212aec92aa23", "name": "Magic Mango", "description": "Magic Mango is a rare evenly balanced hybrid strain created through crossing Somango with the infamous AK-47 strain. With a potent THC level that bottoms out at 20% on average and a mouthwateringly delicious tropical flavor, this bud won't have to perform any tricks to have you falling in love with it. Magic Mango has a sweet fruity tropical flavor with a spicy mango bouquet that lingers long after you toke. The aroma is very sweet and earthy with a spicy hash overtone that's accented by fresh tropical fruits. As soon as you exhale, your mind will be filled with happy hazy thoughts that lift it to a euphoric state without causing anxiety or an increase in energy. As your mind grows in spacey bliss, your body will start to fall into a tingly buzzy state that will leave you completely relaxed and pretty aroused. In combination with its high 20% average THC level, these effects make Magic Mango perfect for treating conditions such as chronic pain, depression, chronic fatigue, inflammation, and chronic stress. This bud has lumpy popcorn-shaped minty green nugs with sparse dark orange hairs and a coating of frosty light amber crystal trichomes.", "effects": ["Body High", "Cerebral", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Fruity", "Hash", "Sweet", "Tropical"], "flavors": ["Dank", "Spicy", "Tropical"], "relieves": ["Dank", "Spicy", "Tropical"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Magic Melon": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/magic-melon", "img": "https://media.allbud.com/resized/350x242/media/images/strain/magic-melon/nkwhTa57/15848324938395980650665064355859jpg.jpg?t=a2a17f923c1199a28af552ae5528b20c69958f8ccfecb3520ff522da5ad4033e", "name": "Magic Melon", "description": "Magic Melon is a slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the infamous Mango Trees X Honeydew Melon X Mango Sherbet strains. Love a great fruity flavor and a well-balanced high? Look no further than Magic Melon. This lovely lady brings on the sweet fruity flavors, mixing ripe melon with sweet tropical mango and berries. The aroma takes a turn for the pungent, with a notable punch of gassiness to it. The Magic Melon high leans more towards the bright side of things, with full-bodied and energizing effects that are great for a lazy afternoon spent relaxing with friends or hitting the great outdoors. You'll feel lifted with a lightly tingly effect in the back of the brain that fills you with a sense of tranquil euphoria, pushing out any negative or racing thoughts. A physical energy accompanies this giggly lift, getting you moving and keeping you active for hours on end. Thanks to these effects and its high 15-25% average THC level and 1-2% CBD level, Magic Melon is often chosen to treat those suffering from conditions such as chronic stress, glaucoma or eye pressure, chronic fatigue, migraines or headaches and depression. This bud has oversized and super heavy minty green nugs with long thin light orange hairs and a coating of tiny milky white crystal trichomes.", "effects": ["Cerebral", "Energizing", "Euphoria", "Giggly", "Tingly", "Uplifting"], "aromas": ["Diesel", "Sour", "Sweet", "Tropical"], "flavors": ["Berry", "Fruity", "Sour", "Sweet", "Tropical"], "relieves": ["Berry", "Fruity", "Sour", "Sweet", "Tropical"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Magic Merlin": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/magic-merlin", "img": "https://media.allbud.com/resized/350x242/media/images/strain/magic-merlin/gZR9UtOH/20210510_203702jpg.jpg?t=cc68a707a6f5d0e0e67456f77df817b441b35c0a82427e49c92f5c4f0d92a126", "name": "Magic Merlin", "description": "Magic Merlin is a rare indica dominant hybrid strain created through crossing the classic Purple Urkle X Double Purple Doja strains. Known for its super stoney and heady high, Magic Merlin will totally have you kicking back and laughing the night away in no time flat. The high comes on with a subtle lifting effect that slowly builds behind the eyes, filling you with an expansive and heady euphoria that pushes out any negative or racing thoughts. A giggly sense comes next, leaving you easily laughing at anything and everything around you that's even remotely funny. With these potent high-flying effects and its super high average THC level that typically bottoms out at about 20%, Magic Merlin is often suggested to treat those suffering from conditions such as mood swings, depression, chronic stress and glaucoma or eye pressure. This bud has as sweet and spicy grape flavor with a lightly herbal earthy exhale. The aroma is of flowery herbs and earth with a spicy fragrant overtone that sweetens as the nugs are burned away. Magic Merlin buds have rounded oversized fluffy dark olive green nugs with rich purple leaves, matching undertones, vivid orange hairs and a coating of frosty thick white crystal trichomes.", "effects": ["Euphoria", "Giggly", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Earthy", "Floral", "Grape", "Herbal", "Spicy"], "flavors": ["Flowery", "Grape", "Herbal", "Spicy", "Sweet"], "relieves": ["Flowery", "Grape", "Herbal", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Magic Night": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/magic-night", "img": "https://media.allbud.com/resized/350x242/media/images/strain/magic-night/SqREpVGk/magic-nightjpg.jpg?t=ac06e657a79144672409dfd2dc7982392dbd2d76373dc2ca4e29bd5edff7f0b6", "name": "Magic Night", "description": "Magic Night, also known as “Magic Night Kush,” “MNK” or “Magic Night CBN,” is an indica dominant hybrid strain (70% indica/30% sativa) created through an unknown combination of other hybrid strains. Even with the lack of information about its parent strains, Magic Night is often sought out by breeders and patients alike for its euphoric, dreamy effects and delicious flavor. One taste of this bud and you’ll be in for one amazing evening. The high settles in a few minutes after your final exhale, filling your mind with a lifted sense of happiness that has you feeling euphoric and tranquil with an unfocused sense of bliss. You’ll be relaxed from head to toe and without a care in the world. A soothing sedation comes next, washing over you and dropping you into a sleepy state. Combined with its moderate 1-4% average THC level and high 5-12% CBD level, these effects make Magic Night the perfect medicinal strain for treating conditions such as depression or mood swings, chronic stress or anxiety, insomnia and chronic pain. This bud has a sweet and fruity sour pineapple mango flavor with a lightly spicy hash exhale. The aroma is of sour citrusy pineapple with a punch of black pepper and spicy hash. Magic Night buds have small and tight diamond-shaped minty green nugs with dusty undertones, thin amber hairs and tiny, purple-tinted white crystal trichomes.", "effects": ["Calming", "Euphoria", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Mango", "Peppery", "Sour", "Spicy", "Tropical"], "flavors": ["Fruity", "Hash", "Mango", "Pineapple", "Sour", "Sweet", "Tropical"], "relieves": ["Fruity", "Hash", "Mango", "Pineapple", "Sour", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Magic Potion": {"url": "https://www.allbud.com/marijuana-strains/hybrid/magic-potion", "img": "https://media.allbud.com/resized/350x242/media/images/strain/magic-potion/yNviQg3w/magic-potionjpg.jpg?t=60a7582621a599a2f2f50b4ed93571bb1adc66ed0844be2ce305614b8193ff19", "name": "Magic Potion", "description": "Magic Potion, also known as “Magic Potion CBD,” is an evenly balanced hybrid strain (50% indica/50% sativa) created through an unknown combination of other high CBD strains. If you’re after the magic treatment to kill any of your mental or physical aches and pains, you’ve found it with Magic Potion. With its super high CBD level, Magic Potion is the perfect soothing choice for any patient. The effects are pretty minimal, serving more to calm and soothe rather than lift or sedate. You’ll feel a light tingly sense accompany this high from start to finish, helping you to settle down and relax with a tingly sense of warmth and happiness. This mellow high will help you to feel calm but not sedated, simply happy to exist within the world. Thanks to these effects and its low 0-1% THC level and super high 15-22% average CBD level, Magic Potion is often chosen to treat a wide variety of conditions including inflammation, chronic pain, seizures or epilepsy, cramps or muscle spasms and the effects of PMS. This bud has a sweet and spicy flowery sage flavor with a sour lemon-lime exhale. The aroma is very similar, with a citrusy lemon-lime overtone accented by spicy herbs and fresh earthiness. Magic Potion buds have airy spade-shaped forest green nugs with deep purple undertones, thick orange hairs and frosty, dark amber crystal trichomes.", "effects": ["Body High", "Calming", "Happy", "Mellow", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Lemon", "Lime", "Sage", "Sour"], "flavors": ["Citrus", "Flowery", "Herbal", "Lemon", "Sage", "Sour", "Spicy", "Sweet"], "relieves": ["Citrus", "Flowery", "Herbal", "Lemon", "Sage", "Sour", "Spicy", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Magilla Gorilla": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/magilla-gorilla", "img": "https://media.allbud.com/resized/350x242/media/images/strain/magilla-gorilla/5WyCJerE/95jpg.jpg?t=4b47b0cd3b9e9142048bc0cde6d47d1b479233c36eccdcbc6fc45b1397657cb9", "name": "Magilla Gorilla", "description": "Magilla Gorilla is an indica dominant hybrid strain (65% indica/35% sativa) created through crossing the potent Grape Ape X Space Ghost strains. If you're after a super relaxing high that will help prime you to get the best sleep of your life, you've found it with Magilla Gorilla. This bud boosts the spirits and soothes the body before gently helping you fade away into a long-lasting and peaceful sleep. You'll feel lifted from start to finish with this bud, free of both mental and physical aches or pains. An overall calm will accompany this high, too, helping you really kick back before you finally fall into a heavy sedation. These sleepy effects combined with its super high 15-20% average THC level make Magilla Gorilla a great choice for treating those suffering from conditions such as insomnia, chronic pain, cramps or muscle spasms, arthritis and spasticity. This bud has a classic sour yet sweet fruity citrus flavor with a lightly savory berry diesel exhale. The aroma is of spicy diesel with a light touch of earthy herbs and sweet fruity berries galore. Magilla Gorilla buds have small rounded forest green nugs with deep purple undertones, thin orange hairs and a coating of tiny clear crystal trichomes.", "effects": ["Body High", "Calming", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Diesel", "Earthy", "Fruity", "Herbal", "Spicy"], "flavors": ["Citrus", "Diesel", "Fruity", "Grape", "Sour", "Sweet"], "relieves": ["Citrus", "Diesel", "Fruity", "Grape", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Magna Rosa": {"url": "https://www.allbud.com/marijuana-strains/sativa/magna-rosa", "img": "https://media.allbud.com/resized/350x242/media/images/strain/magna-rosa/mIXIGPtB/manga-rosajpg.jpg?t=34833fe113a49f7259f87e6214ee654a3e391f219c3e9b69086fa0a8fb1821c9", "name": "Magna Rosa", "description": "Magna Rosa, also known as “Manga Rosa,” is a 100% pure sativa strain that is native to the Brazilian regions. Known for its long-lasting and heady high, Magna Rosa is the perfect bud for when you need a quick kick of energy to get you up and moving. You'll feel an instant influx of cerebral energy that gets you moving and focused on anything and everything on your to-do list. This is accompanied by a sense of pure euphoria that lasts for hours and hours on end without relief. Thanks to these effects and its high 15-21% average THC level, Magna Rosa is often said to be perfect for treating those suffering from conditions such as headaches or migraines, glaucoma or eye pressure, chronic fatigue, depression and chronic stress. This bud has a classic sweet and spicy tropical citrus flavor with a notable punch of mango upon exhale. The aroma is of spicy herbs and sour tropical citrus with an earthy overtone that lingers long after the nugs are burned away. Magna Rosa buds have fat long bright neon green nugs with reddish-orange hairs and a coating of chunky frosty white crystal trichomes that are practically dripping with sweet syrupy resin.", "effects": ["Cerebral", "Energizing", "Focus", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Sour", "Tropical"], "flavors": ["Citrus", "Sour", "Spicy", "Sweet", "Tropical"], "relieves": ["Citrus", "Sour", "Spicy", "Sweet", "Tropical"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Magnum OG": {"url": "https://www.allbud.com/marijuana-strains/hybrid/magnum-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/magnum-og/bHT4NZTo/16612978566481535421665365058431jpg.jpg?t=90773b4dfcdd719b69b7ec11a92a975aeb067363bc223fb55ed521afc956877c", "name": "Magnum OG", "description": "Magnum, also known as “Magnum OG,” is an evenly balanced hybrid (50% indica/50% sativa) strain that is a blend of Ruderalis X Indica X Sativa, although the exact parent strains are unknown. Even with the lack of information about this bud, it is thought to be a member of the OG Kush family and maybe the AK-47, although neither can be confirmed. The Magnum high is said to be perfect for quelling social anxieties when getting ready for a night out with friends. It gives you a euphoric boost that's perfect for giving you social energy and encouraging interaction and laughter with anyone and everyone around you. This state won't cause you anxiety, as the THC level of this bud is generally pretty low, topping out at about 15%, and you will feel calm throughout the duration of the high. With these effects, Magnum is often chosen by patients suffering from chronic stress, insomnia, depression, and glaucoma. This bud has an appearance that's actually very underwhelming – it has long piecey leafy olive green nugs with sparse light amber hairs and matching trichomes. Even with the disappointing appearance, the flavor and aroma make up for all of it – it has a sweet floral effect that's accented by fresh pine and earth for a smooth sweet smoke that is perfect every time.", "effects": ["Creative", "Happy", "Relaxing", "Sociable"], "aromas": ["Floral", "Fragrant", "Pine", "Sweet"], "flavors": ["Sweet", "Woody"], "relieves": ["Sweet", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Magnum Opus F2": {"url": "https://www.allbud.com/marijuana-strains/hybrid/magnum-opus-f2", "img": "https://media.allbud.com/resized/350x242/media/images/strain/magnum-opus-f2/JCn5usMP/magnum_opus_f2-removebg-previewpng.jpg?t=79e94ce87813365da06ce6a9847aa09f9742fdac228e8c69e482febc0a547a07", "name": "Magnum Opus F2", "description": "Magnum Opus F2 is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the powerful Magnum Opus X Magnum Opus strains. The perfect potent hybrid for a day when you have things to do but not much to focus on, Magnum Opus F2 packs high-powered effects and a high level of potency into each and every toke. The high comes on with a rush of effects, filling your brain with an instant sense of lifted euphoria and cerebral energy. You'll be sociable and outgoing in this state, easily chatting with friends and strangers alike for hours on end. At the same time, a light sense of relaxation will wash over your body, helping to keep you anchored. With these effects and its high 20-30% average THC level, Magnum Opus F2 is often chosen to treat a variety of conditions including chronic pain, depression or mood swings, chronic stress or PTSD and chronic fatigue. This bud has a sweet and fruity flowery grape flavor with hints of rich anise upon exhale. The aroma is very similar, with an earthy herbal overtone accented by spicy flowers and sweet fruity grapes. Magnum Opus F2 buds have fluffy spade-shaped olive green nugs with bright purple undertones, dark amber hairs and a coating of dark amber crystal trichomes.", "effects": ["Cerebral", "Creative", "Energizing", "Euphoria", "Hungry", "Uplifting"], "aromas": ["Earthy", "Flowery", "Herbal", "Lavender", "Pine", "Spicy"], "flavors": ["Flowery", "Fruity", "Lavender", "Spicy", "Woody"], "relieves": ["Flowery", "Fruity", "Lavender", "Spicy", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mail Order Bride": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/mail-order-bride", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mail-order-bride/5467/jatgfhmt9s3cesnbsclb.jpg?t=3403e88cec765ac30d7e917af5178b520046f57e95710c5b256ece99f18023ba", "name": "Mail Order Bride", "description": "Mail Order Bride is a super rare indica dominant hybrid strain created through crossing the just as rare Bubba Love X Taskenti strains. When you find this gorgeous lady, you better snap her up ASAP before someone else comes along and takes her home. Mail Order Bride brings heavy-hitting nighttime effects that are fueled by a powerful THC level that bottoms out at about 20% on average and can hit as high as 29%. And with its sweet minty lemon flavor, you'll be hard-pressed to find someone who won't want a piece of this Mail Order Bride. The aroma is just as addicting, with a hashy coffee effect that's accented by tangy lemon and a kick of sharp menthol that's surprisingly sweet smelling. And the high? You'll immediately fall in love. The Mail Order Bride high starts with a creeping effect that slowly sneaks up on you before taking hold of your entire body and dropping you into a deeply sedative state of complete couch-lock. As your body melts into wherever you happen to be sitting, a buzzing effect will wash over you, slowly pulling you down into a deep and peaceful sleep. With these heavy effects, Mail Order Bride is the perfect nighttime choice for those suffering from chronic pain, depression, muscle spasms, and insomnia. This bud has gorgeous heavy dense bright neon green nugs with sparse orange hairs and a dusting of clear trichomes that sometimes have a slightly gold tint to them, making for one beautiful lady all the way around.", "effects": ["Body High", "Relaxing", "Sleepy"], "aromas": ["Hash", "Lemon", "Spicy"], "flavors": ["Coffee", "Lemon", "Sweet"], "relieves": ["Coffee", "Lemon", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mai Tai": {"url": "https://www.allbud.com/marijuana-strains/hybrid/mai-tai", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mai-tai/wavIi6Hn/b9d852aa-ebd4-46bb-a266-fc08accec4abjpe.jpg?t=e5ad1bfbc6e5e98a894c9fcb4e17d17c5a8fe622025b9f116ce3922bbab8aa28", "name": "Mai Tai", "description": "Mai Tai is an evenly balanced hybrid strain (50% indica/50% sativa) created through a delicious cross of the potent Maui Waui X Tutti Frutti strains. Love a great Mai Tai? This bud brings the best of its insanely delicious flavor to a super lifted full-bodied high, creating the perfect recipe for a lazy afternoon spent with friends or family. You'll feel an almost immediately energetic onset, buzzing through your mind like an electrical current and leaving you feeling euphoric, lifted and pretty sociable and outgoing. As you find yourself dropping into deep conversation with those around you, a heavily sedative body buzz will creep over your physical form, leaving you deeply relaxed and immovable. Combined with its super high 26-32% average THC level, these effects make Mai Tai perfect for treating chronic pain, depression, chronic stress, inflammation and cramps or muscle spasms. Mai Tai has a sweet and citrusy tropical fruity flavor with a touch of sharp mint to it, too. The aroma is just as delicious, with a fruity berry overtone accented by sweet and sour citrus and sharp flowery mint. Mai Tai buds have fluffy dense oversized bright neon green nugs with golden amber undertones, orange hairs and a coating of golden amber crystal trichomes.", "effects": ["Body High", "Energizing", "Euphoria", "Sociable", "Tingly", "Uplifting"], "aromas": ["Citrus", "Earthy", "Flowery", "Sour", "Tropical"], "flavors": ["Berry", "Citrus", "Fruity", "Sour", "Tropical"], "relieves": ["Berry", "Citrus", "Fruity", "Sour", "Tropical"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mai Tai Cookies": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/mai-tai-cookies", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mai-tai-cookies/6390/hvokicg4ty8fx2euzt0u.jpg?t=107e6813a2a4a81f0aa1e921cf6e5f04260857d17303dd8164078b47719860ff", "name": "Mai Tai Cookies", "description": "Mai Tai Cookies is a sativa dominant hybrid strain created through crossing the delicious Alien Orange Cookies X ACDC strains. This bud took home 1st Place for Best CBD Flower at the 2016 High Times Cannabis Cup in Los Angeles, and for good reason. With a powerful CBD level that typically bottoms out at about 12%, a moderate THC level of 8-14%, and a myriad of uplifting mellow effects, Mai Tai Cookies has definitely earned that title! The Mai Tai Cookies high starts with a euphoric boost of uplifted energy that infuses you with a sense of focus and motivation that's not overwhelming. As your mind tackles any task you put forward, your body will fall into a deeply relaxing state that can be slightly sedative at times. In combination with its high CBD level, these effects give Mai Tai Cookies a distinct advantage in treating a variety of conditions including headaches or migraines, chronic pain, fatigue, and depression, among others. This bud has a sweet tangy cherry flavor with a sharp citrus exhale. The aroma is of earthy sweet citrus with a surprisingly strong hint of cherry. Mai Tai Cookies buds have super dense and chunky light minty green nugs with a super frosty coating of bright white crystal trichomes.", "effects": ["Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Cherry", "Citrus", "Orange", "Sour", "Sweet"], "flavors": ["Berry", "Cherry", "Sweet", "Tangy"], "relieves": ["Berry", "Cherry", "Sweet", "Tangy"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Malana": {"url": "https://www.allbud.com/marijuana-strains/sativa/malana", "img": "https://media.allbud.com/resized/350x242/media/feature/flower/violator-kush.jpeg?t=ae3306134d9b39840d1e852e15d5e138bc91af3260c45c43e41e6f70bde74036", "name": "Malana", "description": "Malana, also known as “Pure Highland Sativa Chavras,” is a rare 100% sativa strain that is native to the Malana Village in the Himachal Pradesh region of Northern India. This beautiful bud packs a bright and heady high that's perfect for a wake-and-bake when you just can't seem to get up and going. You'll feel almost instantly energized with a vibrant cerebral effect that has you feeling creative and in an almost frenzied state. This is accompanied by a giggly sense that has you laughing at anything and everything around you before you fade completely away into psychedelic thought and visions. With these effects and its high 10-25% average THC level, Malana is often chosen to treat those suffering from conditions such as chronic fatigue, depression, chronic stress, migraines or headaches and eye pressure or glaucoma. This bud has a sweet fruity mango flavor with a rich creamy caramel exhale. The aroma is of sweet toffee and spicy florals with a fruity overtone that becomes more and more sugary as the nugs are broken apart and burned. Malana buds have super sticky oversized rock-hard spade-shaped nuggets that are bright neon green in color with spatterings of vivid orange hairs throughout.", "effects": ["Cerebral", "Creative", "Giggly", "Sociable"], "aromas": ["Coffee", "Earthy", "Floral", "Fruity", "Spicy", "Sweet"], "flavors": ["Creamy", "Flowery", "Fruity", "Sweet"], "relieves": ["Creamy", "Flowery", "Fruity", "Sweet"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Malawi Gold": {"url": "https://www.allbud.com/marijuana-strains/sativa/malawi-gold", "img": "https://media.allbud.com/resized/350x242/media/images/strain/malawi-gold/3141/ezvnin1lc61cwxqhuqde.jpg?t=c0b664abfd387f477f999cfe2f90712a4dd5bd5422f796807aee513aa19265b9", "name": "Malawi Gold", "description": "Malawi Gold is a 100% pure sativa strain native to the region of Malawi in Africa that is a favorite of breeders and users alike. This classic bud offers a moderate THC level between 9-13% and a mild aroma of banana, as it is traditionally cured wrapped in layers of banana leaves. Malawi Gold is prized among cannabis users for its uplifting clear-headed high that won't weight you down or leave you feeling anxious or paranoid. This high hits you fast with a crashing wave of cerebral energy that leaves you laser-focused with a sense of motivation and purpose. Because of its moderate THC level, the cerebral effects are not too overpowering and are perfect for any level of cannabis user. Because of these cerebral sativa effects, Malawi Gold is often a choice for treating fatigue, mild cases of depression, chronic stress, and nausea. This bud has pyramid-shaped bright neon green super leafy nugs with red hairs and frosty amber hued trichomes and sweet sticky resin. Malawi Gold has a classic sativa aroma of sweet and spicy fresh herbs with just a hint of banana and an enticing taste of sweet and spicy herbal tea with just a touch of earth upon exhale.", "effects": ["Cerebral", "Energizing", "Happy", "Uplifting"], "aromas": ["Earthy", "Herbal", "Pungent", "Spicy", "Sweet"], "flavors": ["Herbal", "Spicy", "Sweet", "Tea"], "relieves": ["Herbal", "Spicy", "Sweet", "Tea"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Malibu Pure Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/malibu-pure-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/malibu-pure-kush/DBb7QIXD/20200305_160347jpg.jpg?t=497a91b23c8e20bd64aada3b1a969a41b6456b618317f9eae521740070192c36", "name": "Malibu Pure Kush", "description": "Malibu Pure Kush, not to be confused with “Pure Kush,” is a rare indica dominant hybrid strain created as a phenotype of the infamous OG Kush, although the breeders keep its exact heritage as a closely guarded secret. Malibu Pure Kush is a local strain to the Malibu region and is infamous for its classic flavor and effects. Malibu Pure Kush as a rich sweet and sour woody pine flavor with hints of sharp citrus and eye-opening mint upon exhale. The aroma takes a slightly pungent herbal turn, with rich earthy citrus and sharp menthol released as the nugs are burned. The Malibu Pure Kush high is just as addictive as the flavor, with classic effects that are peaceful and uplifting throughout the duration of the high. You'll feel peaceful and lifted throughout, with a clear mind and relaxed body. Thanks to these effects and its super high 18-29% average THC level, Malibu Pure Kush is said to be perfect for treating conditions such as depression, mood swings, chronic fatigue, depression, ADD or ADHD, and chronic stress or anxiety. This bud has fluffy piecey bright neon green nugs with fiery orange hairs and a coating of sparkling amber crystal trichomes.", "effects": ["Body High", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Lemon", "Mint", "Pine"], "flavors": ["Citrus", "Menthol", "Pine", "Sour", "Sweet", "Woody"], "relieves": ["Citrus", "Menthol", "Pine", "Sour", "Sweet", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Malonica": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/malonica", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Malonica", "description": "Malonica is a sativa dominant hybrid strain (75% sativa/25% indica) created through an unknown combination of hybrid strains. On the hunt for a great wake-and-bake strain for a weekend morning afternoon when you have plans later in the day? This bud is totally made for you. Malonica packs energy, happiness and a sense of motivation into each and every tasty toke. The high comes on fast and hard with a rush of cerebral effects that instantly boost your energy and your spirits, filling you with a giddy euphoria that gets you up and out of bed or off of the couch in no time at all. You’ll feel ready to tackle anything that comes your way with an increased sense of creativity and sociability that lends itself well to conversations and other social situations. With these effects and its high 18-25% average THC level, Malonica is often chosen to treat those suffering from conditions such as chronic fatigue, depression, chronic stress, appetite loss or nausea and headaches or migraines. This bud has a sweet and fruity citrusy skunk flavor with an earthy and herbal aroma to match. Malonica buds have dense rounded bright neon green nugs with long thin dark amber hairs and a coating of frosty chunky white crystal trichomes.", "effects": ["Creative", "Energizing", "Euphoria", "Happy", "Sociable", "Uplifting"], "aromas": ["Citrus", "Earthy", "Lemon", "Skunky", "Sour"], "flavors": ["Citrus", "Fruity", "Herbal", "Skunky", "Spicy", "Sweet"], "relieves": ["Citrus", "Fruity", "Herbal", "Skunky", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Malverde": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/malverde", "img": "https://media.allbud.com/resized/350x242/media/images/strain/malverde/b1oAQKQQ/20220909_111749jpg.jpg?t=63cf9166885d13993ec90e40846ff1b63e59b8434234f67bf68d0e2673296cee", "name": "Malverde", "description": "Malverde, also known as “Mexican Survivor,” is a heavily sativa dominant hybrid strain (90% sativa/10% indica or 95% sativa/5% indica) with unknown parentage but is said to be a strain native to the Michoacán regions of Mexico. This bud is best known for its delicious flavor, which is said to be like enjoying a fresh margarita, with tastes of sweet and sour citrus accented by fresh lemon and lime and just a touch of spice. The aroma is just as delicious, with a spicy citrus overtone and sweet lemon-lime scents galore. The Malverde high is one that will have you feeling just as happy as if you've enjoyed a margarita, with uplifting and energizing effects that hit fast and hard, almost as soon as you exhale. You'll feel energized with a sense of creative motivation that's perfect for jumping on any artistic task that you may have at hand. A light tingly physical sense accompanies this heady lift, getting your muscles moving and you up and off the couch. These effects combined with its super high 28-29% average THC level make Malverde perfect for treating experienced patients suffering from chronic fatigue, depression, chronic stress or PTSD and appetite loss or nausea. This bud has fluffy spade-shaped dark olive green nugs with amber undertones, bright orange hairs and frosty purple-tinted white crystal trichomes.", "effects": ["Cerebral", "Creative", "Energizing", "Euphoria", "Happy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Lemon", "Lime", "Sour", "Spicy"], "flavors": ["Citrus", "Lemon", "Lime", "Sour", "Spicy", "Sweet"], "relieves": ["Citrus", "Lemon", "Lime", "Sour", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mamasan": {"url": "https://www.allbud.com/marijuana-strains/indica/mamasan", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mamasan/PRC9Xk7S/mamasanjpg.jpg?t=bc0257ecc19e74d692089200acb71f69a2b0e241c25d0114f1a4322184048e73", "name": "Mamasan", "description": "Mamasan is a 100% pure indica hybrid strain with unknown parentage that was originally grown in the mountains of Colorado. Even with the lack of information about its heritage, Mamasan is a favorite of breeders and patients alike thanks to its full-bodied relaxing effects and super easy grow. The high starts with a subtle boost of the spirits, filling your mind with a lifted sense of happiness and ease. You'll find yourself slowly fading in and out of focus as your mental state reaches new levels of bliss. Your body will begin to follow suit, fading into a sense of deep calm that has you totally couch-locked and immovable before dropping you off into a purely sedative and sleepy state. With these heavy effects and its high 17-19% average THC level, Mamasan is said to be perfect for treating conditions such as chronic pain, depression, insomnia and chronic stress or PTSD. This bud has a sweet fruity pine flavor with a lightly skunky and spicy exhale. The aroma is of earthy herbs and woods with a heavy skunky pungency to it that intensifies the more that you toke. Mamasan buds have fat rounded spade-shaped neon green nugs with lots of light orange hairs and a coating of frosty tiny white crystal trichomes.", "effects": ["Body High", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Earthy", "Pine", "Pungent", "Skunky", "Woody"], "flavors": ["Berry", "Fruity", "Pine", "Skunky", "Sweet"], "relieves": ["Berry", "Fruity", "Pine", "Skunky", "Sweet"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mama Thai": {"url": "https://www.allbud.com/marijuana-strains/sativa/mama-thai", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mama-thai/w2hPTGHt/mama-thaijpg.jpg?t=bd3db4c8a21126cf1c16437182008413ea0e439cfe092209e902bc3188113c2a", "name": "Mama Thai", "description": "Mama Thai is a 100% pure sativa strain that is a native landrace found throughout the regions of Thailand. Known for its strong cerebral high and psychedelic nature, Mama Thai is highly recommended for lovers of high-powered sativas who don’t suffer from anxiety or paranoia when they toke. You’ll feel the effects almost as soon as you exhale, rushing through your mind with an energizing euphoria. This effect immediately pushes out any negative or racing thoughts, replacing them with pure heady bliss. You’ll feel creative with an increase in sociability, easily carrying on conversations with those around you about anything and everything at all. In combination with its high 22% average THC level, these happy, bright effects make Mama Thai a great choice for treating those suffering from conditions such as headaches or migraines, chronic fatigue, eye pressure or glaucoma, chronic stress and depression. This bud has a spicy and flowery flavor with a punch of sweet citrus upon exhale. The aroma is very similar, although earthier and more herbal in nature. Mama Thai buds have skinny airy forest green nugs with minty green undertones, matching leaves, thin dark orange hairs and a coating of frosty chunky white crystal trichomes.", "effects": ["Cerebral", "Creative", "Energizing", "Euphoria", "Sociable"], "aromas": ["Citrus", "Earthy", "Herbal", "Sour", "Spicy", "Woody"], "flavors": ["Citrus", "Flowery", "Orange", "Sour", "Spicy"], "relieves": ["Citrus", "Flowery", "Orange", "Sour", "Spicy"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "ManBearPig": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/manbearpig", "img": "https://media.allbud.com/resized/350x242/media/images/strain/manbearpig/LFsKNEL1/101jpg.jpg?t=32a4476432f07027695fa9d5adf4e27c84558a413abb53d8b51ed187ac4167b0", "name": "ManBearPig", "description": "ManBearPig, also known as “Man Bear Pig” or “ManBearPig OG,” is a slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the powerful Animal Cookies X Lemon OG strains. Named for the iconic character in South Park, ManBearPig packs a punch of legendary effects that hit both mind and body for hours on end. You'll feel a rush of effects hit you almost as soon as you exhale, filling your brain with a lifted sense of euphoria that instantly washes away any negative or racing thoughts. You'll feel lifted with a tingly sense that soon works its way throughout your entire body, leaving you feeling super relaxed and at ease. This tingle can turn arousing at times, so beware if you have anything to do. In combination with its high 22-24% average THC level, these effects make ManBearPig a great choice for treating those suffering from conditions such as chronic pain, depression, chronic stress, mood swings and nausea or appetite loss. This bud has a sweet nutty vanilla flavor with a lightly sour and citrusy exhale. The aroma is of fresh sour citrus and flowery woods with touches of fresh nutty vanilla, too. ManBearPig buds have oversized spade-shaped dense neon green nugs with thin yellow-orange hairs and a coating of chunky white crystal trichomes.", "effects": ["Aroused", "Euphoria", "Happy", "Hungry", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Citrus", "Earthy", "Flowery", "Herbal", "Nutty", "Sour", "Spicy", "Vanilla"], "flavors": ["Citrus", "Nutty", "Sour", "Sweet", "Vanilla"], "relieves": ["Citrus", "Nutty", "Sour", "Sweet", "Vanilla"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mandarin Confectionery": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/mandarin-confectionery", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mandarin-confectionery/deiM6jfh/mandarinpng.jpg?t=05d5390876fdc31bfa010aa154c8eb49019a03afc94f9bf460976e2a5da55952", "name": "Mandarin Confectionery", "description": "Mandarin Confectionery is a sativa dominant hybrid strain (70% sativa/30% indica) created through crossing the iconic California Black Rose X Mandarin Sunset strains. A vibrant bud with an electrifying high, Mandarin Confectionery is the perfect sativa to get you out of bed in the morning with a smile on your face. You'll feel the effects hit you instantly, slamming into your brain with an influx of cerebral energy that activates your senses, filling you with focus and motivation galore. You'll feel creative and euphoric in this state, ready to work on any artistic task at hand or simply tackle your to-do list with ease. A light physical tingle accompanies this heady boost, which can have you feeling pretty aroused. Combined with its high 20-21% average THC level, these effects make Mandarin Confectionery a great choice for treating chronic fatigue, insomnia, headaches or migraines and chronic stress or anxiety. This bud has a sweet and sour fruity grape flavor with a potent punch of tangy tangerine upon exhale. The aroma is very similar, with a bouquet of sour citrus accented by fruity grapes and sweet yet spices earthiness. Mandarin Confectionery buds have oversized and airy spade-shaped forest green nugs with purple undertones, thick orange hairs and tiny, bright white crystal trichomes.", "effects": ["Aroused", "Cerebral", "Creative", "Energizing", "Euphoria", "Motivation", "Tingly", "Uplifting"], "aromas": ["Citrus", "Diesel", "Earthy", "Herbal", "Sour", "Spicy", "Tangerine"], "flavors": ["Berry", "Fruity", "Orange", "Sour", "Spicy", "Sweet"], "relieves": ["Berry", "Fruity", "Orange", "Sour", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mandarin Glue": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/mandarin-glue", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mandarin-glue/gwhX06kT/madi-gluejpeg.jpg?t=f656f63c9973eee90c5ef9dbfcac8d5e794a04eac87274540396a7c89f4f792f", "name": "Mandarin Glue", "description": "Mandarin Glue is a sativa dominant hybrid strain (85% sativa/15% indica) created through crossing the classic NYC Diesel Mandarin Cut X Original Glue strains. Named for is OG parentage, Mandarin Glue packs a heavy heady high that will have you feeling energized, motivated and ready to take on the world. It starts almost as soon as you exhale, slamming into your eyes with an almost dizzying sense of high-flying euphoria. You'll feel instantly focused with a cerebral sense of energy and motivation that gets your mental juices flowing. A creative feeling accompanies this heady lift, helping you jump on any artistic task at hand with ease. In combination with its super high 21-23% average THC level, these energizing effects make Mandarin Glue a great choice for treating conditions such as chronic fatigue, depression or mood swings, chronic stress, PTSD and headaches or migraines. This bud has a sweet and sour citrusy tangerine flavor that intensifies with a punch of black pepper upon exhale. The aroma is of sour oranges, spicy black pepper and earthy diesel, intensifying the more that you toke. Mandarin Glue buds have dense popcorn-shaped emerald green nugs with long thin orange hais and a coating of frosty, tiny golden-white crystal trichomes.", "effects": ["Cerebral", "Creative", "Energizing", "Euphoria", "Focus", "Uplifting"], "aromas": ["Citrus", "Diesel", "Earthy", "Orange", "Sour", "Spicy"], "flavors": ["Citrus", "Diesel", "Lemon", "Orange", "Sour", "Sweet"], "relieves": ["Citrus", "Diesel", "Lemon", "Orange", "Sour", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mandarin Mints": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/mandarin-mints", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mandarin-mints/8543/b7pglnlqes0kompdl9si.jpg?t=927633f8a0d9401896821d99092e6069b8fa162e571f33c11f8f91e0446734e5", "name": "Mandarin Mints", "description": "Mandarin Mints, also known as “Mandarin Cookies,” is a rare sativa dominant hybrid (70% sativa/30% indica) strain created through crossing the classic Tangerine Power X Girl Scout Cookies Thin Mint strains. This bud packs a super intriguing flavor, blending together the tastes of your favorite Thin Mint cookies with sharp citrus and diesel. The aroma is very earthy and kushy with a lemony overtone that's accented by diesel and menthol. The Mandarin Mints high is just as delectable as the flavor, with lifted and relaxing effects that leave you happy and heavy at the same time. You'll feel the onset behind your eyes and in the back of your head with a growing sense of heaviness. As your eyes and head begin to droop, your spirits will be launched into pure happiness with a touch of physical energy. In combination with its super high 27-28% average THC level, these effects give Mandarin Mints an edge in treating conditions such as chronic fatigue, depression, migraines or headaches, inflammation, nausea, and chronic pain. This bud has thin neon green nugs with long amber hairs and a coating of bright amber crystal trichomes.", "effects": ["Cerebral", "Happy", "Relaxing", "Uplifting"], "aromas": ["Diesel", "Earthy", "Lemon", "Spicy"], "flavors": ["Citrus", "Diesel", "Lemon", "Mint"], "relieves": ["Citrus", "Diesel", "Lemon", "Mint"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mandarin Sunset": {"url": "https://www.allbud.com/marijuana-strains/hybrid/mandarin-sunset", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mandarin-sunset/QUM4wH4D/15953048582731548845728355126275jpg.jpg?t=f008182edead1b16b0e6223b159453cc15b808bb3995f808e3dd1a7aeaed9c7b", "name": "Mandarin Sunset", "description": "Mandarin Sunset is a perfect strain choice for those of you looking to replicate a smell similar to that of Cuties Clementine. This marijuana strain is a cross of Herojuana and Orange Skunk. It is an indica dominant strain that carries hints of fresh citrus combined with subtle notes of five-spice powder. Mandarin Sunset carries aromas that are primarily orange-like and fruity. The hairs present on Mandarin Sunset are more towards a reddish hue but most users are typically drawn towards the lime green and purple leaves of this strain and the dash of beautiful trichomes present on them. Typically sweet and spicy flavors are associated with Mandarin Strain. A large amount of lightness is associated with the taste and smell of this indica, hence a user is generally unprepared for the severe indica zone a person enters upon consuming this strain. Almost immediately numbness descends across the entire body and almost instantly deep pain and muscles spasms are alleviated. Mandarin Sunset is an effective strain for pain management and a lack of appetite and it helps in relieving a number of symptoms such as muscle pains and insomnia. This medicinal marijuana strain carries effects are long lasting and provides a sufficient buzz.", "effects": [], "aromas": ["Citrus", "Pepper", "Skunky", "Spicy"], "flavors": ["Peppery", "Spicy", "Sweet"], "relieves": ["Peppery", "Spicy", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mandarin Zkittlez": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/mandarin-zkittlez", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mandarin-zkittlez/jl2zUDjc/20200626_180012jpg.jpg?t=809164716429bac41e9b0523041157c50d8f5bddae19bd2a5ccd17300bcfe68f", "name": "Mandarin Zkittlez", "description": "Mandarin Zkittlez is a rare slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the delicious California Black Rosé X Mandarin Sunset strains. Known for its super tasty flavor, Mandarin Zkittlez is perfect for any hybrid lover who appreciates well-balanced effects and a mouthwatering taste. Mandarin Zkittlez packs a sweet citrusy and fruity grape flavor into each and every toke. The aroma takes a spicier turn, with peppery grapefruit and herbs blending together beautifully. The Mandarin Zkittlez high isn't quite as bright as the flavor, with effects that are best suited for a lazy day when you don't need much mental capacity to get what you need to do done. You'll feel lifted and relaxed with a giggly overtone that has you laughing at anything and everything with ease. This is all wrapped up with a touch of energy that won't cause any anxiety or paranoia. In combination with its high 20-22% average THC level, these effects give Mandarin Zkittlez an edge in treating those suffering from chronic pain, autism, spasticity, cramps or muscle spasms depression and chronic stress. Mandarin Zkittlez buds have spade-shaped dark olive green nugs with thick amber hairs and a coating of tiny frosty white crystal trichomes.", "effects": ["Body High", "Euphoria", "Giggly", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Sour", "Spicy"], "flavors": ["Citrus", "Grape", "Grapefruit", "Orange", "Sour", "Spicy"], "relieves": ["Citrus", "Grape", "Grapefruit", "Orange", "Sour", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mandy's Dream": {"url": "https://www.allbud.com/marijuana-strains/hybrid/mandys-dream", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mandys-dream/8546/crv4kz3pcrarrhheeezw.jpg?t=f72348d1db51666e44fc0ab7cc448ed98462834c2240ffd20ed9d640fd1174a5", "name": "Mandy's Dream", "description": "Mandy's Dream is a rare evenly balanced hybrid (50% indica/50% sativa) strain created through crossing the classic Mandarin Kush with the infamous Blue Dream strain. This well-balanced hybrid brings together the eye-opening effects of its Mandarin Kush parent and blends them perfectly with the dreamy happiness of Blue Dream. You'll feel an uplifted and euphoric onset a few minutes after your last toke, pulling your mind into a state of tingly happiness and ease. This effect is accompanied by a touch of focus and motivation and a lot of creative inspiration. Almost as quickly as it begins, it will start to fade into a hazy and dreamy happiness that will leave you slightly sedated and unable to focus on much of anything while your mind wanders. Thanks to these effects and its high 15-20% average THC level, Mandy's Dream is often chosen to treat conditions such as chronic pain, depression, chronic fatigue, migraines or headaches, and chronic stress. This bud has a classic sweet citrusy blueberry flavor and an earthy herbal aroma to match. Mandy's Dream buds have small round bluish green nugs with purple undertones, lots of long thin orange hairs, and a coating of super frosty bright white tiny crystal trichomes.]", "effects": ["Cerebral", "Happy", "Relaxing", "Uplifting"], "aromas": ["Berry", "Citrus", "Earthy", "Herbal", "Orange"], "flavors": ["Berry", "Citrus", "Fruity", "Sweet"], "relieves": ["Berry", "Citrus", "Fruity", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mandy Purple": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/mandy-purple", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mandy-purple/8545/o73h24yqcuvjfz9ixme4.jpg?t=33f7e71e81e719af308648c00400a3bfbf331f4feb16c5941c809f69c77e5a8c", "name": "Mandy Purple", "description": "Mandy Purple, also known as “Mandarin Purple,” is an indica dominant hybrid strain created through crossing the classic Tangerine Kush with an unknown purple strain. This bud packs an insanely addictive flavor that blends together the best of both purple and orange strains, with a super spicy grape and citrus flavor that drips off of your tongue. The aroma is just as amazing, with a fruity grape overtone that's accented by pungent spicy orange as the nugs are burned. The Mandy Purple high isn't quite as eye-opening as the flavor, but it does pack a pretty potent punch. The high hits you fast and hard in the head with red eye inducing haziness that leaves you happy and completely at ease. As your spirits lift, your mind will fall deeper and deeper into introspective relaxation, soon pulling your body in afterwards. These hard-hitting effects combined with its high 15-19% average THC level give Mandy Purple an edge in treating conditions such as chronic pain, depression, muscle spasms or cramps, migraines or headaches, and nausea. This bud has long fluffy olive green nugs with rich purple undertones, long reddish orange hairs, and a coating of tiny frosty white crystal trichomes.", "effects": ["Body High", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Earthy", "Fruity", "Grape", "Herbal", "Sweet"], "flavors": ["Fruity", "Grape", "Orange", "Spicy"], "relieves": ["Fruity", "Grape", "Orange", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mango Berry": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/mango-berry", "img": "https://media.allbud.com/resized/350x242/media/feature/strain/mango-berry.jpg?t=00570d19e4aa8fc1f41110ddb8ea95832174cdd70bf32a384fc000a298132def", "name": "Mango Berry", "description": "Mango Berry, also known more commonly as “Mango Kush,” is an indica dominant hybrid (65% indica/35% sativa) strain with unknown parentage, although it is thought to be a cross of Mango X Hindu Kush. This bud is infamous for its production of dense softball-sized buds and its heavily mango flavor with hints of sweet earthy pine. The aroma is of sweet juicy mangos topped with heavy skunky pungency. Mango Berry hits hard and fast immediately after toking with a tingly heavy feeling in the face that immediately causes droopy eyelids before moving throughout the rest of your head and leaving you completely mentally pain free. Over the next few minutes, the high will spread throughout the rest of your body in warming waves, leaving you lazy, couch-locked, and completely sedated. Make sure you have some snacks ready, because a heavy case of the munchies comes next. Because of these effects and its up to 20% THC level, Mango Berry is perfect for treating a variety of conditions, including inflammation, chronic stress or anxiety, nausea, and appetite loss. Mango Berry buds have dense and oversized forest green nugs with sparse bright orange hairs and a thick coating of tiny amber hued crystal trichomes.", "effects": ["Body High"], "aromas": ["Mango", "Pungent", "Skunky", "Sweet"], "flavors": ["Pine", "Sweet"], "relieves": ["Pine", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mango Crush": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/mango-crush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mango-crush/Pv8BYrr3/downloadjpg.jpg?t=7eea14ddbd0cca9607954c372f235f61e3fac6d3c52f6b0a4845fc1895e0fdb9", "name": "Mango Crush", "description": "Mango Crush is a super rare sativa dominant hybrid strain created through an unknown combination of sativa-dominant tropical strains. If you’re a fan of tropical flavors and a super lifted heady high, Mango Crush is totally for you. Like the name suggests, this lovely lady packs a super sweet tropical mango flavor into each and every tasty little toke. The aroma is just as intoxicating, with a hint of earthy herbs to it, too, as the nugs are broken apart and burned. The Mango Crush high comes blasting in almost as soon as you experience your first exhale, slamming into your head with unmatched potency and launching it into a state of pure cerebral bliss. As your mind soars higher and higher, a deeply relaxing effect will wash over you, keeping your physical state anchored to the world below with a deeply peaceful feeling overall. Thanks to these hard-hitting effects and its super high 20-23% average THC level, Mango Crush is said to be perfect for treating those suffering from conditions such as chronic stress or anxiety, depression, chronic fatigue, and mood swings. This bud has small dusty green spade-shaped nugs with vibrant orange hairs and a thick frosty white coasting of giant crystal trichomes.", "effects": ["Creative", "Energizing", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Fruity", "Herbal", "Sour", "Tropical"], "flavors": ["Fruity", "Herbal", "Sweet", "Tropical"], "relieves": ["Fruity", "Herbal", "Sweet", "Tropical"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mango Durban": {"url": "https://www.allbud.com/marijuana-strains/sativa/mango-durban", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mango-durban/J2QM6GRD/leafjpg.jpg?t=89494cd4cc557a1da8cf37071699fa92311463bc949344111cadf249636b9b22", "name": "Mango Durban", "description": "Mango Durban, also known as “Durban Mango,” is a 100% pure sativa strain created through crossing the delicious Mangobiche X Durban strains. Best known for its super strong and long-lasting high, Mango Durban is great for any sativa lover who doesn't suffer from anxiety due to its psychedelic effects. You'll feel energized and lifted from start to finish with Mango Durban, filled with an almost rushing get-up-and-move feeling that has you positively filled with creative motivation and pure bliss. You'll soon find yourself fading in and out of introspective racing visions, which can be overwhelming if you're not careful, especially if you tend to suffer from anxiety or paranoia when you toke. Pair these heady effects with its high 15-19% average THC level and you have the perfect vibrant recipe for treating depression, chronic fatigue, headaches or migraines, eye pressure or glaucoma and chronic stress. This bud has a super sweet and fruity tropical mango flavor with an exhale that turns heavy and sour. The aroma is very earthy and sour with a spicy yet sweet tropical mango overtone. Mango Durban buds have dense grape-shaped dark forest green nugs with minty undertones, thin amber hairs and a coating of milky crystal trichomes.", "effects": ["Body High", "Cerebral", "Creative", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Fruity", "Mango", "Sour", "Spicy"], "flavors": ["Citrus", "Fruity", "Mango", "Sour", "Spicy", "Tropical"], "relieves": ["Citrus", "Fruity", "Mango", "Sour", "Spicy", "Tropical"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mango G-13": {"url": "https://www.allbud.com/marijuana-strains/hybrid/mango-g-13", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mango-g-13/HJC19Ncy/16682069876416399332858859004489jpg.jpg?t=173a31f022f26f577e8d4b78393b0f5b3ef9bff3576146a58bc386786d53db47", "name": "Mango G-13", "description": "Mango G-13, also known as “Mango G13” or “G-13 Mango,” is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic Mango Haze X G-13 strains. A favorite among breeders and patients alike, Mango G-13 packs a super-powered high with a high THC level and an amazing flavor, too. The high hits you fast and hard, charging through your mind with an energizing and lifted sense. You'll feel creatively inspired with a happy focus that gets you working on your to-do list with ease. A relaxing body high accompanies this heady state, pulling you further and further into the couch before leaving you pretty sleepy and sedated. With these effects and its high 14-24% average THC level, Mango G-13 is often chosen to treat those suffering from conditions such as depression, chronic stress, insomnia, chronic fatigue, mood swings and chronic pain. This bud has a super sweet and fruity tropical mango flavor with a lightly sour and citrusy exhale. The aroma is very similar, with a spicy diesel overtone accented by a punch of sharply sour pineapple and mango. Mango G-13 buds have fat and fluffy popcorn-shaped minty green nugs with thin orange hairs and a coating of frosty milky golden white crystal trichomes.", "effects": ["Creative", "Energizing", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Fruity", "Sour", "Spicy", "Tropical"], "flavors": ["Citrus", "Fruity", "Mango", "Sour", "Sweet", "Tropical"], "relieves": ["Citrus", "Fruity", "Mango", "Sour", "Sweet", "Tropical"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mangolian Indica": {"url": "https://www.allbud.com/marijuana-strains/indica/mangolian-indica", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mangolian-indica/8357/dbyfrhyy3ntfgeeidqm4.jpg?t=e92235114545fe0e85699ec40fe91368ded38f37e6b467a8f44c0f6230f0961f", "name": "Mangolian Indica", "description": "Mangolian Indica, not to be confused with “Mongolian,” is a rare 100% pure indica hybrid strain created as a cross of the infamous Afghan Skunk X Afghani X Northern Lights #5 strains. This bud took home the bronze medal at the 2005 HighLife Cup in Amsterdam, snagging 3rd Place overall for Best Indica. Mangolian Indica packs all of the classic flavors and effects of your favorite indica strains into one tasty little bud. It has a sweet flavor of fresh mine and lemon with a touch of sage and mint upon exhale. The aroma is very fresh and herby with a floral overtone that has a touch of fresh mango that can be detected as the nugs are broken apart. Mangolian Indica buds have leafy brownish red nugs with long thin amber hairs and a coating of sandy amber colored crystal trichomes. The Mangolian Indica high packs relaxing and lethargic effects that are long-lasting and best suited for late night when you need a little help sleeping. The high comes on with a creeping effect, building its way into your mind before pulling you down into sleepy introspection and hazy waking dreams. As your mind falls further and further, your body will follow suit, ending with a deep and peaceful nap that can last for hours. In combination with its high 10-16% average THC level, these effects make Mangolian Indica perfect for treating chronic stress, depression, insomnia, chronic fatigue, and migraines.", "effects": ["Body High", "Cerebral", "Long Lasting", "Sleepy"], "aromas": ["Citrus", "Earthy", "Floral", "Herbal", "Mango", "Mint"], "flavors": ["Lemon", "Mint", "Pine", "Sweet"], "relieves": ["Lemon", "Mint", "Pine", "Sweet"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mango Mac": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/mango-mac", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mango-mac/8547/rd56xmlenki2j2yeijfv.jpg?t=aeb79ec8a524d038edb1d42d81b77ec62441d4b5c9ad5d4c1147ee263740ec1a", "name": "Mango Mac", "description": "Mango Mac is a super rare sativa dominant hybrid strain created through crossing Mango Kush with the classic AMG Haze strain. This bud is hard to find on your average market, but is infamous for its mouthwateringly delicious mango flavor and bright cheery effects. Mango Mac has a flavor of your classic haze strain that has been dropped into a bowl of fresh ripe mangos. The aroma is just as addictive with a tropical spicy overtone that plays well with the sweet ripe mango. Almost as soon as you finish you first smooth fruity exhale, your mind will start to succumb to the effects of Mango Mac, lifting into a state of happiness that is stimulating and euphoric. You'll find yourself drifting into a hazy giggly state soon after that leaves you spacey and distant, although still sociable at times. Thanks to these heady effects and its high 15-16% average THC level, Mango Mac is often chosen to treat conditions such as chronic pain, depression, fatigue, migraines or headaches, nausea, and glaucoma. This bud has small piecey bright neon green nugs with long thin orange hairs and a coating of bright amber crystal trichomes.", "effects": ["Cerebral", "Giggly", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Herbal", "Mango", "Spicy", "Tropical"], "flavors": ["Herbal", "Mango", "Spicy", "Sweet"], "relieves": ["Herbal", "Mango", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mango Punch": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/mango-punch", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mango-punch/IVBKgizO/mango-punchjpg.jpg?t=40b88168319c15eedd74862517141b7f5f4bf5e54ab46a4b8ee4c8abf23e2d05", "name": "Mango Punch", "description": "Mango Punch is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the delicious Mango X another unknown hybrid strain. Although it has never been confirmed officially, many seem to agree that the likely second parent of Mango Punch is, in fact, the beloved Purple Punch strain. Nonetheless, if you're after a sweet and fruity bud with a soothing nighttime high, you've found it with Mango Punch. This bud packs a head-spinning flavor of fresh juicy mangoes accented by sour citrusy pineapple and tropical tree fruits. The aroma is just as vibrant, with a sweet mango overtone accented by citrusy pineapple and sweet tropical fruits. The Mango Punch high will slam into your brain almost as soon as you exhale, launching your mind into a lifted state of focus and motivation. But you'd better hurry – this focus will soon disappear, replaced with pure sleepy sedation that can have you feeling pretty stoned at times. Thanks to these effects and its high 18-24% average THC level, Mango Punch is often chosen to treat a variety of conditions such as arthritis, depression or mood swings, chronic stress or PTSD, headaches or migraines and chronic pain. This bud has super dense and small triangle-shaped emerald green nugs with furry orange hairs, golden undertones and frosty matching crystal trichomes.", "effects": ["Calming", "Focus", "Happy", "Relaxing", "Sleepy", "Tingly", "Uplifting"], "aromas": ["Citrus", "Mango", "Pineapple", "Sour", "Tree Fruity"], "flavors": ["Citrus", "Fruity", "Mango", "Pineapple", "Sour", "Sweet"], "relieves": ["Citrus", "Fruity", "Mango", "Pineapple", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mango Sherbet": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/mango-sherbet", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mango-sherbet/kB9WoHWa/16784372373614797708835641933505jpg.jpg?t=8cc296ae1e8c06c36ebfcd1952a3a18d0544279fe3158b93869a211340d01f2d", "name": "Mango Sherbet", "description": "Mango Sherbet, also known as “Mango Sherbert,” is an indica dominant hybrid strain crated through a delicious cross of Mango Trees X Mango Kush X Sherbet. Best known for its insanely tasty flavor, Mango Sherbet brings on the mouthwatering tastes, with hints of sugary berries and fresh sweet mango with a rich tropical overtone. The aroma follows the same profile, although with a touch of earthiness to it as well. The Mango Sherbet high isn't quite as bright as the flavor, with effects that are mentally stimulating yet physically relaxing in nature. It starts with a relaxing cerebral build in the back of the head, tingly and slightly numbing. You'll feel an influx of creative energy and focus just before your body drops away into a heavy, long-lasting physical high. A touch of the giggles comes next, leaving you laughing at anything and everything around you with ease. Thanks to these effects and its super high 24-28% average THC level, Mango Sherbet is often chosen to treat those suffering from chronic pain, cramps or muscle spasms, chronic stress or anxiety and chronic fatigue. This bud has fluffy rounded forest green nugs with long thin orange hairs and a frosty thick coating of tiny dusty amber crystal trichomes.", "effects": ["Body High", "Creative", "Euphoria", "Giggly", "Relaxing", "Uplifting"], "aromas": ["Berry", "Earthy", "Fruity", "Tropical"], "flavors": ["Fruity", "Mango", "Sugary", "Sweet", "Tropical"], "relieves": ["Fruity", "Mango", "Sugary", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mango Taffy": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/mango-taffy", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mango-taffy/Rifdt2AK/61-cjpg.jpg?t=e99137c8f412a56b52672495ca69ddc1d86b7d5f371ca9b79810bd6c6563dc24", "name": "Mango Taffy", "description": "Mango Taffy, more commonly known as “MangoTaffie,” is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the delicious Mango Kush X Taffie strains. With this bud, the name says it all in the flavor department. Mango Taffy packs a super sweet tropical mango flavor with hints of sour citrus and light spices, too. The aroma is very similar, with an herbal woody effect that turns spicy and citrusy as the nugs are broken apart and burned away. The Mango Taffy high settles in a few minutes after your final toke, starting with a slow build of euphoric energy. You'll feel an influx of focus and sociability that lends itself well to conversations with friends and family alike. A touch of creativity accompanies this focused motivation, which can get you moving on any artistic task that you may have at hand. A touch of physical relaxation will keep you anchored throughout this lifted high without causing you to feel sedated in the slightest. With these effects and its high 18-22% average THC level and 2-3% CBD level, Mango Taffy is often chosen to treat conditions such as chronic pain, depression, chronic stress or anxiety and chronic fatigue. This bud has oversized fluffy spade-shaped bright neon green nugs with thin orange hairs and a coating of frosty golden amber crystal trichomes.", "effects": ["Aroused", "Calming", "Energizing", "Focus", "Happy", "Sociable", "Uplifting"], "aromas": ["Citrus", "Earthy", "Fruity", "Sweet", "Tropical", "Woody"], "flavors": ["Citrus", "Fruity", "Mango", "Sweet", "Tropical"], "relieves": ["Citrus", "Fruity", "Mango", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mango Trainwreck": {"url": "https://www.allbud.com/marijuana-strains/hybrid/mango-trainwreck", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mango-trainwreck/AF2l4J32/img_20220507_124141778jpg.jpg?t=5a10e5b1fe558e73350ae53cb31aa4d7690e2214748b779fceaa34492184789d", "name": "Mango Trainwreck", "description": "Mango Trainwreck is an evenly balanced hybrid strain (50% indica/50% sativa) created through a deliciously potent cross of Mango Kush X Trainwreck strains. Insanely delicious flavors and hard-hitting effects combine for the ultimate celebrity child in this potent bud. Mango Trainwreck brings together the best of both of its parents, all wrapped up with a super potent 22-29% average THC level. The Mango Trainwreck high comes on with a rush of cerebral energy, slamming into your head almost as soon as you exhale, lifting your mind into a pure euphoric state that is super relaxing in nature. As your mind settles, your body will begin to fade away into a heavily sedative physical high that leaves you hopelessly couch-locked and ravenously hungry, reaching for anything and everything in sight to snack on. This effect quickly turns sleepy, leaving you dozing on and off as you settle into a state of pure peace and happiness. Thanks to these heavy effects and its high THC level, Mango Trainwreck is said to be perfect for treating conditions such as nausea or appetite loss, chronic stress, migraines or headaches, chronic fatigue, and chronic pain. This bud has spade-shaped fluffy olive green nugs with dark orange hairs and a coating of frosty tiny white crystal trichomes.", "effects": ["Body High", "Cerebral", "Energizing", "Hungry", "Relaxing"], "aromas": ["Earthy", "Fruity", "Herbal", "Sour", "Tropical"], "flavors": ["Citrus", "Mango", "Sour", "Spicy", "Sweet", "Tropical"], "relieves": ["Citrus", "Mango", "Sour", "Spicy", "Sweet", "Tropical"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Manna": {"url": "https://www.allbud.com/marijuana-strains/hybrid/manna", "img": "https://media.allbud.com/resized/350x242/media/images/strain/manna/tVsC8pO7/mannajpg.jpg?t=15fa60c7bec77bc2b929b59a808c0b34378f98a6a0381bb06bff043231d9b114", "name": "Manna", "description": "Manna is a rare evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the infamous Jack Herer X Allen Wrench strains. Perfect for any patient who loves a delicious flavor and a potent high, Manna packs a punch of well-balanced effects that hit both mind and body with a high level of power that lasts for hours and hours on end. The high starts with a lifted effect that fills your cerebral state with a sense of euphoria and a touch of relaxation. This effect will quickly begin to spread throughout the rest of your body, dropping you into a slightly couch-locked state that can leave you feeling ravenously hungry, too. In combination with its high 23% average THC level, these effects give Manna the perfect edge in treating those suffering from conditions such as nausea, chronic fatigue, depression, chronic pain, and chronic stress. This bud has a sweet tropical pineapple flavor with a hint of sour cherry candies upon exhale. The aroma is of fresh earthy fruits with a sour tropical overtone that's accented by rich berries and spices. Manna buds have airy neon forest green nugs with rich gold undertones, amber hairs, and a coating of sparkling crystal trichomes.", "effects": ["Body High", "Cerebral", "Hungry", "Relaxing", "Uplifting"], "aromas": ["Berry", "Earthy", "Grapefruit", "Sour", "Sweet", "Tropical"], "flavors": ["Candy", "Cherry", "Pineapple", "Sour", "Sweet", "Tropical"], "relieves": ["Candy", "Cherry", "Pineapple", "Sour", "Sweet", "Tropical"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Man O War": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/man-o-war", "img": "https://media.allbud.com/resized/350x242/media/images/strain/man-o-war/Bus8gJzb/33-cjpg.jpg?t=344d656316522b12f5fba0b191139a6be441e588890282ed12e78144290987d4", "name": "Man O War", "description": "Man O War, also known as “Man ‘O War,” is a slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the powerful Bruce Banner #3 X Alien Rift #6 strains. The perfect bud for a lazy day spent at home when you may have some stuff to get done, Man O War packs an energizing and stimulating high that's bright and happy. The high comes on quickly, first electrifying your mind with a blissful heady lift that's accompanied by a warming tingly feeling in the back of the head and neck. This tingle will soon work its way throughout the rest of your body, slipping into your limbs and leaving them feeling lightly energized but totally relaxed from head to toe. This effect isn't sedative but rather will help ease away aches and pains to get you up and moving and ready to clean, go for a walk or just settle in for a conversation with friends. Combined with its high 15-18% average THC level, these effects give Man O War an edge in treating conditions such as chronic fatigue, depression, chronic stress, headaches or migraines and nausea or appetite loss. This bud has a classic sour citrus flavor with hints of fruity blueberries, too. The aroma is of fresh ripe blueberries with a touch of spicy yet sour citrusy lemon. Man O War buds have fat popcorn-shaped minty green nugs with lots of thin orange hairs and a coating of tiny milky white trichomes.", "effects": ["Cerebral", "Energizing", "Happy", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Blueberry", "Citrus", "Fruity", "Sour"], "flavors": ["Berry", "Citrus", "Fruity", "Sour", "Sweet"], "relieves": ["Berry", "Citrus", "Fruity", "Sour", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mantis": {"url": "https://www.allbud.com/marijuana-strains/hybrid/mantis", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mantis/i6W5uWVh/81-cjpg.jpg?t=138855ed7c52e31fb27054538c0722980638efdbdaaad9848d77e09e6add9f3a", "name": "Mantis", "description": "Mantis is a rare evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic Nap X (Santa Maria X Haze) strains. Perfect for any hybrid lover, Mantis brings on a full-bodied high that will lift you up before helping you slowly settle down and get to sleep after the most stressful of days or weeks. The high starts a few minutes after your final toke, hitting the brain first. You'll feel a light lift of the spirits that turns into full-blown euphoria, pushing out any negative or racing thoughts immediately. As your reach new heights of happiness, you'll feel your limbs begin to relax with a soothing physical high. This combination quickly turns sedative, leaving you dozing off before you know it. With these sleepy effects and its super high 20% + average THC level, Mantis is often chosen to treat those suffering from conditions such as chronic stress or PTSD, depression, insomnia and chronic fatigue. This bud has a sweet and spicy lemon-lime flavor, almost like a fresh Sprite. The aroma is very similar, although it does have hints of earthy herbs to it, too. Mantis buds have oversized heart-shaped blue-green nugs with dark amber hairs and a coating of blue-tinted white crystal trichomes.", "effects": ["Euphoria", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Earthy", "Herbal", "Lemon", "Lime", "Sour", "Spicy"], "flavors": ["Citrus", "Lemon", "Lime", "Sour", "Spicy", "Sweet"], "relieves": ["Citrus", "Lemon", "Lime", "Sour", "Spicy", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Maple Syrup": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/maple-syrup", "img": "https://media.allbud.com/resized/350x242/media/images/strain/maple-syrup/VfoapDP4/16645665115874844160107121200671jpg.jpg?t=f916885d61c3e59b77445c55ee070d4315f759a55476aa03eaf722a377a649ce", "name": "Maple Syrup", "description": "Maple Syrup, also known as “Maple Leaf” or “Maple Leaf Indica,” is an extremely indica dominant hybrid (90% indica/10% sativa) strain created by crossing the classic Skunk #1 X Blue Black strains. It's called Maple Syrup for an apparent reason – it tastes exactly like what you'd expect! The flavor is very sweet and sugary with a notable vanilla undertone. The aroma takes a hit of citrus to the maple effect, mixing sharp orange with sweet sugary maple and adding a dash of spicy skunkiness that'll fill a room. And if you weren't hungry before smoking this bud, you'd better get some pancakes ready. The high definitely brings out a ravenous state of munchies that will leave you insatiable and dying for snacks. It starts first with a euphoric lift that leaves you feeling giddy and giggly, falling into bouts of uncontrollable laughter over almost anything and everything. A body stone comes next, pulling you into a hazy state before kicking in with the munchies. With these effects and its high average THC level of 17%, Maple Syrup is said to be perfect for treating nausea, appetite loss, chronic stress, and insomnia. This bud has piecey light minty green nugs with bright orange hairs and a coating of tiny white crystal trichomes that looks almost frosty.", "effects": ["Relaxing", "Sociable"], "aromas": ["Orange", "Pungent", "Skunky", "Spicy", "Sweet", "Vanilla"], "flavors": ["Spicy", "Sweet", "Vanilla"], "relieves": ["Spicy", "Sweet", "Vanilla"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Maple Wreck": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/maple-wreck", "img": "https://media.allbud.com/resized/350x242/media/images/strain/maple-wreck/LkaSV8WR/maple-wreckjpg.jpg?t=b67567360c967802713c80380e3f891f09310dce90afa87b8e304e067b5e1364", "name": "Maple Wreck", "description": "Maple Wreck is a heavily sativa dominant hybrid strain (90% sativa/10% indica) created as a phenotype of the infamous Trainwreck strain. Named for its insanely delicious flavor, Maple Wreck packs tastes of sweet maple syrup and rich sugary woods into each and every toke. The aroma follows the same profile, although with a light touch of earth and herbs as the nugs are burned. The Maple Wreck high comes blasting in almost as soon as you exhale, launching your mind into a purely lifted state of heady euphoria. As your mind soars higher and higher, you'll start to feel an influx of creative energy and motivation with a touch of focus that will help you get going on any artistic undertakings that you have at hand. This effect does build without a ceiling, so mind your dosage if you're inclined to anxiety at all. Thanks to these hard-hitting effects and its high 18-25% average THC level, Maple Wreck is often chosen to treat those suffering from conditions such as chronic fatigue, ADD or ADHD, chronic stress, depression, mood swings, and chronic pain. This bud has long minty green spade-shaped nugs with thin clear amber hairs and a coating of sandy amber crystal trichomes dotted with sweet sticky resin.", "effects": ["Energizing", "Euphoria", "Focus", "Motivation", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Pine", "Sweet"], "flavors": ["Pine", "Sugary", "Sweet", "Woody"], "relieves": ["Pine", "Sugary", "Sweet", "Woody"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Maraschino Cherry": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/maraschino-cherry", "img": "https://media.allbud.com/resized/350x242/media/images/strain/maraschino-cherry/DCm24Zyt/kosher-tangiejpg.jpg?t=76b0231f308ddbbf004d3eb104c06e623bd52f955e7e390466539e87fc50947a", "name": "Maraschino Cherry", "description": "Maraschino Cherry is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the delicious Kosher Tangie X Cherry Pie strains. Named for its mouthwatering flavor and celebrity parentage, Maraschino Cherry is the perfect choice for any fruity indica lover. Like its namesake treat, Maraschino Cherry has a sweet and fruity cherry flavor with a spicy yet sugary exhale. The aroma is of freshly picked spicy cherries with hints of earthy flowers and sharp menthol, too. The Maraschino Cherry high hits you just after your final toke, filling your mind with an expansive and heavy euphoria that leaves you with no room for any negative or racing thoughts. A sense of calm accompanies this happiness, filling your body with a soothing sense of relaxation. This combination can turn sedative, which will leave you dozing off before you realize what's happening. Thanks to these effects and its high 20-23% average THC level, Maraschino Cherry is often chosen to treat those suffering from conditions such as insomnia, depression, chronic pain, arthritis, muscle spasms or cramps and chronic stress. This bud has fat heart-shaped emerald green nugs with lots of thin light orange hairs and a coating of frosty, tiny golden white crystal trichomes.", "effects": ["Body High", "Calming", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Earthy", "Fruity", "Menthol", "Spicy", "Sweet"], "flavors": ["Berry", "Cherry", "Flowery", "Fruity", "Grape", "Spicy", "Sweet"], "relieves": ["Berry", "Cherry", "Flowery", "Fruity", "Grape", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Maraschino Gold": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/maraschino-gold", "img": "https://media.allbud.com/resized/350x242/media/images/strain/maraschino-gold/HdxY14Fm/80-cjpg.jpg?t=707f69d3235671585bb3983b872f430df56f8f29d3679546cc6c443f87e17d8f", "name": "Maraschino Gold", "description": "Maraschino Gold is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the delicious Kosher Tangie X Cherry Pie strains. Love the taste of maraschino cherries? This bud packs that and more into each and every tasty little toke. Maraschino Gold is said to have a flavor of sweet fruity cherries accented by touches of lightly sour citrus. The aroma follows the same profile, although with hints of skunkiness to it, too. The Maraschino Gold isn't quite as bright, with relaxing effects that start with a vibrancy before fading away. You'll feel an almost immediate rush of clear-headed focus and energy as soon as you experience your final tasty exhale, leaving you feeling lifted and motivated, ready to jump on anything from homework to household chores to a quick run around the block. While your mind is stimulated, your body will soon begin to drop away into a deeply calming state that keeps you slightly couch-locked and pain-free without causing too much sedation. Combine these effects with its high 16-19% THC level and you get the perfect tasty recipe for treating chronic fatigue, depression, ADD or ADHD, chronic stress and headaches or migraines. Maraschino Gold buds have fluffy popcorn-shaped minty green nugs with long thin orange hairs and tiny white trichomes.", "effects": ["Cerebral", "Energizing", "Focus", "Motivation", "Uplifting"], "aromas": ["Cherry", "Citrus", "Earthy", "Fruity", "Skunky", "Sour"], "flavors": ["Cherry", "Citrus", "Fruity", "Skunky", "Sour", "Sweet"], "relieves": ["Cherry", "Citrus", "Fruity", "Skunky", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Marathon OG": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/marathon-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/marathon-og/Qmfb08hC/1df4e6dd-28a7-4ee4-9a44-27ff00b59f10jpe.jpg?t=ba59ca5a2b0dd19e924e9171e59d039272ec3c4d94bce8a936845c4733c84394", "name": "Marathon OG", "description": "Marathon OG, also known as “Marathon Kush,” is an indica dominant hybrid strain created as a phenotype of the potent OG Kush strain. Made for rap superstar Nipsey Hu$$le and named after a series of his famous mix tapes, Marathon OG packs a heavy high that will lift you up mentally before knocking you flat on your back physically for hours and hours on end. The high starts in the head with a subtle euphoric build, lifting your spirits and giving you a touch of mental energy and focus. This quickly becomes fully overshadowed by a heavy, all-encompassing body high that knocks you flat down and locks you to the couch with a high level of potency. This quickly turns stoney and sedative, leaving you dozing off before you know it. With these effects and its high 20% + average THC level, Marathon OG is often chosen to treat conditions such as chronic fatigue, depression, chronic stress or anxiety, muscle spasms or cramps and chronic pain. This bud has a super spicy lemony earth flavor with a rich sour herbal aroma to match. Marathon OG buds have fluffy oversized popcorn-shaped minty green nugs with thick orange hairs interspersed throughout, light amber undertones and a frosty thick coating of tiny sparkling white crystal trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Earthy", "Herbal", "Lemon", "Spicy"], "flavors": ["Citrus", "Herbal", "Sour", "Spicy"], "relieves": ["Citrus", "Herbal", "Sour", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Margo Kush": {"url": "https://www.allbud.com/marijuana-strains/hybrid/margo-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/margo-kush/dWYixGsG/margo-kushjpg.jpg?t=6a3c302383cae253a8fc4bb69f2519d27213a68e6c7c6af227fcf175e7750392", "name": "Margo Kush", "description": "Margo Kush is a rare evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic Sour Diesel X OG Kush strains. Not to be confused with the like-named “Mango Kush,” this bud packs a super delicious sweet and sour lemon diesel flavor that will leave you begging for more. The aroma follows the same profile, with a citrusy pine overtone accented by savory diesel and sweet lemons as the nugs are burned. The Margo Kush high comes on soon after your first exhale, filling your mind with a lifted sense of calm and happiness that eases away any mental aches or pains with ease. Soon, a relaxing body high will begin to settle into your limbs, locking you to any couch or chair and leaving you in a state of pure happiness and ease. As both mind and body drift away, you'll start to feel pretty sleepy, dropping into a dozy state on and off as the high progresses before you finally pass out. Thanks to these effects and its super high 25% THC level, Margo Kush is often chosen to treat conditions such as depression, insomnia, chronic stress, chronic pain, and chronic fatigue. Margo Kush buds have fluffy dense grape-shaped forest green nugs with bright orange hairs and a coating of amber sandy crystal trichomes.", "effects": ["Body High", "Calming", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Diesel", "Herbal", "Pine", "Spicy", "Woody"], "flavors": ["Diesel", "Lemon", "Pine", "Sour", "Sweet"], "relieves": ["Diesel", "Lemon", "Pine", "Sour", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Marilyn Jane OG": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/marilyn-jane-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/marilyn-jane-og/4nX6uAu9/49-cjpg.jpg?t=f92471937cd591494e8f33a588015708fce3f3c8c82608e973856a6167868bf1", "name": "Marilyn Jane OG", "description": "Marilyn Jane OG, also known as “Marilyn Jane” or “Marilyn Jane Kush,” is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through a three-way cross of the potent Mother's Finest X Juicy Fruit X AK-47 strains. This delicious combination yields a super-powered bud that is packed full of classic effects and a 24-28% THC level. The high has an almost immediate effect, hitting right between and behind the eyes almost as soon as you exhale with a buzzing energy. You'll suddenly feel laser-focused with a build in creativity and euphoria that has you jumping from mental task to mental task with ease. This buzzing will soon spread throughout the rest of your body, lulling you into a relaxed state that doesn't damper your mental energy too much. These effects with its high THC level make Marilyn Jane OG perfect for treating experienced patients suffering from conditions such as chronic pain, muscle spasms or cramps, migraines or headaches and chronic fatigue. Marilyn Jane OG has a classic strawberry diesel flavor with a heavily gassy and citrusy aroma to match. This bud has heart-shaped olive green nugs with dark orange hairs and a coating of tiny amber-tinted white crystal trichomes.", "effects": ["Cerebral", "Creative", "Energizing", "Euphoria", "Focus", "Uplifting"], "aromas": ["Diesel", "Earthy", "Fruity", "Spicy", "Sweet"], "flavors": ["Berry", "Diesel", "Fruity", "Herbal", "Spicy", "Strawberry", "Sweet"], "relieves": ["Berry", "Diesel", "Fruity", "Herbal", "Spicy", "Strawberry", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Marilyn Monroe": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/marilyn-monroe", "img": "https://media.allbud.com/resized/350x242/media/images/strain/marilyn-monroe/74rVu5Zi/4d072825-506a-44f2-80ec-1fef79897066jpe.jpg?t=f65919fdd690dc7b239ec2c977c96cdc42e8105a10ef516980e877eee750ec9b", "name": "Marilyn Monroe", "description": "Marilyn Monroe, also known as “Marilyn Monroe OG,” is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the iconic JFK X Mother's Finest strains. Named for the iconic movie star, Marilyn Monroe is the perfect choice for any indica lover who's after a soothing high and a great flavor. This bud has a super sweet and fruity strawberry berry flavor with a light touch of woodiness upon exhale. The aroma is very similar, with a fruity strawberry overtone that's accented by earthy woody pine and hints of light pungency. The Marilyn Monroe high hits you almost as soon as you exhale, filling your mind with a lifted sense of happiness and ease. A physical sensation comes next, washing over your body in tingly waves, lulling you into a state of stimulating relaxation and ease. A sharp pang of hunger comes next, leaving you with a pretty hefty case of the munchies. In combination with its super high 27-33% average THC level, these effects make Marilyn Monroe a great choice for treating those suffering from conditions such as chronic pain, headaches or migraines, cramps or muscle spasms and nausea or appetite loss. This bud has fat heart-shaped emerald green nugs with dark orange hairs and a coating of tiny, milky white crystal trichomes.", "effects": ["Body High", "Euphoria", "Happy", "Hungry", "Relaxing", "Uplifting"], "aromas": ["Berry", "Earthy", "Fruity", "Pungent", "Sour", "Strawberry", "Sweet", "Woody"], "flavors": ["Berry", "Fruity", "Sour", "Strawberry", "Sweet", "Woody"], "relieves": ["Berry", "Fruity", "Sour", "Strawberry", "Sweet", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Marmalade": {"url": "https://www.allbud.com/marijuana-strains/hybrid/marmalade", "img": "https://media.allbud.com/resized/350x242/media/images/strain/marmalade/xMPtBOYK/marmaladejpg.jpg?t=edc6b30308aa44866022f0861aa8d96425a67919a4287487792541a9b13a6aae", "name": "Marmalade", "description": "Marmalade is a rare evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the delicious Blueberry Cheesecake X Sour Tsunami strains. With Marmalade, the flavor is everything. This lovely lady packs a super sweet berry honey flavor into each and every toke. The aroma is a different story, with a rich skunky overtone that's accented by pungent cheese and herbs. The Marmalade high is one that's perfect for a lazy afternoon kicking back with friends or working on artistic undertakings. You'll feel a light touch of euphoria begin to build in the back of your mind after your first toke, turning quickly into a happy tingle that spreads from back to front, easing away any negative or racing thoughts. Soon, you'll feel an influx of creativity and energy fill your cerebral state, helping you to take on any artistic task on your to-do list with ease. With these effects and its high 12-23% average THC level and 1-6% CBD level, Marmalade is said to be perfect for treating those suffering from chronic stress, depression, mood swings, chronic fatigue, and nausea or appetite loss. This bud has oversized piecey bright yellow-green nugs with rich blue leaves, amber hairs, and a coating of matching glittery crystal trichomes.", "effects": ["Creative", "Energizing", "Euphoria", "Tingly", "Uplifting"], "aromas": ["Berry", "Cheese", "Earthy", "Fruity", "Pungent", "Sour", "Sweet"], "flavors": ["Berry", "Fruity", "Honey", "Skunky", "Sour", "Sweet"], "relieves": ["Berry", "Fruity", "Honey", "Skunky", "Sour", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "marshmallow": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/marshmallow", "img": "https://media.allbud.com/resized/350x242/media/images/strain/marshmallow/fjjQ7Kxh/15587496891285772748502911005064jpg.jpg?t=4d93ea7f5478e4798ceebc4d970ef6322a54f531bd98d986ab2ae975ef2338b9", "name": "marshmallow", "description": "Marshmallow is an indica dominant hybrid strain created through a cross of the classic OG Kush X an unknown strain. Although its second parent is unknown due to breeder secrecy, Marshmallow is thought to be a descendent of the Bubble Gum family because of its sickly sweet sugary flavor and mellow indica effects. Like its name suggests, Marshmallow has a super sweet candy flavor accented by nutty honey and a touch of fruitiness. The aroma is just as sweet, with a slightly pungent rotting marshmallow overtone that can be a little overwhelming to some upon exhaling. The Marshmallow high definitely hits the balanced hybrid sweet spot with indica heavy effects that are complemented by a nice cerebral high. It hits first in the forehead and behind the eyes with an uplifted euphoria that leaves you happy but totally hazy and a little out of it. As this high builds, it'll spread throughout the rest of your body in warming waves, leaving you with a tingly feeling from head to toe that numbs away any aches or pains. This will lull you into a state of complete relaxation, which pulls you down slowly into a hungry yet very sleepy state that almost always ends in a nice nap. Because of these effects and its moderate 14% average THC level, Marshmallow is perfect to treat insomnia, appetite loss, chronic pain, muscle spasms, and nausea. This bud has fluffy yet dense popcorn-shaped olive green nugs with rich purple undertones and hairs and a white frosty coating of milky crystal trichomes.", "effects": ["Body High", "Relaxing", "Sleepy"], "aromas": ["Earthy", "Nutty", "Sweet"], "flavors": ["Honey", "Sweet"], "relieves": ["Honey", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mars OG Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/mars-og-kush", "img": "https://media.allbud.com/resized/350x242/media/feature/flower/mars-og_coOMumY.jpg?t=7f599f2d0a8b31d8a47beaecb270dba47c2756aadd7566198d3487c39efb3241", "name": "Mars OG Kush", "description": "This spacey indica-dominant hybrid is heavy on the body effects, perfect for late nights and dreary afternoons when little needs to be done. Mars OG is a California native out of the San Francisco Bay Area. A descendant of the original OG Kush, Marsh OG has a sativa/indica ratio of 20:80 and THC levels of up to 20%. That means an intense body high ideal for treating insomnia and other sleep disorders. CBD levels are relatively low, making this a less-than-ideal choice for disorders that respond to that form of cannabis therapy. This strain's extraterrestrial name is a reference to its status as a so-called \"planetary\" strain. These are marijuana strains that are planted indoors and later moved outdoors to complete the vegetative cycle. The smell is pungent and earthy, while the flavor is thick and fruity. This is a great choice for couch-lock and stress relief, as the body high is lazy and deeply relaxing. Feelings of euphoria and sleepiness are also common. Mars OG is best used to treat insomnia and anxiety, as well as chronic pain and appetite problems. Negative effects include dry mouth and red eyes, which are common, and paranoia and dizziness, which are not.", "effects": [], "aromas": ["Diesel", "Kush", "Pungent"], "flavors": ["Hash"], "relieves": ["Hash"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Martian Confidential": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/martian-confidential", "img": "https://media.allbud.com/resized/350x242/media/images/strain/martian-confidential/8548/rrxtuakkvmzjwqmjqya8.jpg?t=c96b4124282d255edc3957e5bffe1d88211a8307bc9c99dc3ec8652b9eebbf2d", "name": "Martian Confidential", "description": "Martian Confidential is a super rare indica dominant hybrid strain created through crossing the potent Martian Mean Green with the infamous LA Confidential strain. User beware – Martian Confidential is not to be underestimated! With its insanely high THC level that bottoms out at about 20-21% and hard-hitting effects, this potent powerhouse can easily overwhelm even the most experienced of users. The high slams into you mere moments after your last toke, launching your mind into a hazy sense of relaxation and happiness. You'll feel yourself falling deeper and deeper into your own mind as your body is slowly taken over by a heavy stone. As you drift in and out of focus, your body will be pulled down further into deep sedation, leaving you immovable and incredibly sleepy. These effects in combination with its powerful THC level make Martian Confidential perfect for treating conditions such as chronic pain, insomnia, muscle spasms or tremors, arthritis, and depression. This bud has a dank spicy herbal flavor and a heavy pungent aroma to match. Martian Confidential buds have small round piecey olive green nugs with long thin amber hairs and a coating of clear crystal trichomes dotted with sweet sticky resin.", "effects": ["Body High", "Creative", "Euphoria", "Relaxing", "Sleepy"], "aromas": ["Earthy", "Herbal", "Pungent", "Spicy"], "flavors": ["Dank", "Herbal", "Spicy"], "relieves": ["Dank", "Herbal", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Martian Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/martian-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/martian-kush/5477/ehk0mmhwkcgqzal8xztt.jpg?t=fea5adc906c1e389a70650e016e8899cb56cfacc4ddf7a4837402de3c6707ef8", "name": "Martian Kush", "description": "Martian Kush is a slightly indica dominant hybrid (60% indica/40% sativa) strain created through crossing the classic Martian Mean Green X The OG #18 strains. With parents like these, it is no wonder Martian Kush is a patient favorite across the western side of the country. Martian Kush packs a hefty punch of giggly indica effects that are well balanced with an uplifted creative cerebral high. It starts with a building sense of euphoria that hits you first in the back of your head and builds through your very being, offering artistic inspiration and a surprising sense of calm. This head high is balanced beautifully by a building body buzz that is slightly tingly and leaves you completely relaxed, although very prone to falling into uncontrollable fits of giggles. Because of these effects and its powerful 18-19% average THC level, Martian Kush is said to be perfect for treating conditions such as chronic pain, muscle spasms, chronic pain, and appetite loss. This bud has lumpy popcorn-shaped olive green nugs with purple undertones, thin amber hairs, and a frosty lavender coating of crystal trichomes. Martian Kush packs a classic musky flavor of fruity earth with a tinge of berry and pungent kush. The aroma is very dank with a musky kush overtone and a hint of earthy berry as the nugs are broken apart.", "effects": ["Giggly", "Happy", "Relaxing"], "aromas": ["Berry", "Dank", "Earthy", "Fruity", "Kush", "Musky"], "flavors": ["Berry", "Dank", "Fruity"], "relieves": ["Berry", "Dank", "Fruity"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Martian Muffin": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/martian-muffin", "img": "https://media.allbud.com/resized/350x242/media/images/strain/martian-muffin/ltNirKnb/20210529_120814jpg.jpg?t=6537565d99c510c3d549b669582e1a9b9b1cc3b28402de4070dd44dbd4ab7661", "name": "Martian Muffin", "description": "Martian Muffin is a rare heavily indica dominant hybrid strain (90% indica/10% sativa) created through crossing the classic Girl Scout Cookies X Romulan strains. An out of this world flavor and lifted effects will be yours with this deliciously potent bud. Martian Muffin has a sweet and spicy nutty flavor with hints of rich citrus and slightly pungent pine upon exhale. The aroma is very earthy and sweet with a nutty citrus overtone that's almost like a fresh lemon cookie that's been left out in the sun for a little too long. The Martian Muffin high is super relaxing and lifted in nature, with fast-acting sleepy effects that are perfect for kicking back after a stressful day when sleep just won't seem to come. You'll feel lifted and relaxed with this high, with a sleepy overtone that leaves you dozing mere minutes after taking your first tasty toke. With these effects and its high 22-26% average THC level, Martian Muffin is said to be perfect for treating conditions such as chronic stress or anxiety, insomnia, headaches or migraines, depression, and appetite loss or nausea. This bud has huge oversized neon green nugs with turquoise, pink, and purple undertones with long red hairs and a coating of frosty white crystal trichomes.", "effects": ["Euphoria", "Giggly", "Hungry", "Relaxing", "Sleepy"], "aromas": ["Citrus", "Earthy", "Pine", "Pungent", "Spicy", "Woody"], "flavors": ["Nutty", "Pine", "Spicy", "Sweet"], "relieves": ["Nutty", "Pine", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mary Chino": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/mary-chino", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mary-chino/radmHmPQ/mary-chinojpg.jpg?t=4f524c73bf4c59140985b0b0b352da3d9b2b24ae81301af0fe61d0f123b7d9d2", "name": "Mary Chino", "description": "Mary Chino is a rare slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the infamous Cherry Pie X Tahoe Orange Tahoe strains. If you're in the market for a high-powered lady who will hit you hard with no mercy, Mary Chino is totally it. The Mary Chino high packs a wallop of body and cerebral effects that are best suited for a lazy afternoon when you don't have much of anything to do. The high starts with a lifted effect that fills your mind with a sense of unfocused and hazy euphoria that quickly turns dreamy and artistic. Soon, you'll begin to feel mentally sleepy as your body settles into a deep sense of relaxation and ease. In combination with its super high 22-26% average THC level, these potent effects give Mary Chino an edge in treating those suffering from conditions such as depression, migraines or headaches, mood swings, insomnia, and nausea or appetite loss. This bud has a sweet berry citrus flavor with a slightly pungent minty exhale that turns earthier the more you toke. The aroma is of pungent sour herbs and earth with a diesel berry overtone that quickly turns to heavy fuel as the nugs are broken apart and burned. Mary Chino buds have forest green dense arrowhead-shaped nugs with bright orange hairs and a thick frosty amber coating of crystal trichomes.", "effects": ["Body High", "Euphoria", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Citrus", "Diesel", "Mint", "Pungent", "Sour"], "flavors": ["Citrus", "Diesel", "Pine", "Sour"], "relieves": ["Citrus", "Diesel", "Pine", "Sour"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Maryhill Skunkberry": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/maryhill-skunkberry", "img": "https://media.allbud.com/resized/350x242/media/images/strain/maryhill-skunkberry/5949/xkhw1xt0jm4c1bhxc8g0.jpg?t=e50f970bfee50d3a0cd7a302284ff62639f804773e8cefd52716bcbea5a2a069", "name": "Maryhill Skunkberry", "description": "Merryhill Skunkberry, also known simply as “Blueberry Skunk,” is an indica dominant hybrid strain created through crossing the infamous DJ Short Blueberry X Skunk #1 strains. This bud is an in-house special for Merryhill, bred to capture a higher THC level than its classic Blueberry Skunk sister, bottoming out at 22% on average. This insanely high THC level powers a very cerebral head high that could definitely prove to be too much for any user who suffers from anxiety of any kind. The high starts with an almost immediate rushing euphoric effect that instantly boosts your mood and infuses you with a sense of energy. As your happiness builds and builds, your energy will ebb and bottom out, leaving you relaxed and lazy although incredibly blissful. This potent combination of effects and its high THC level make Merryhill Skunkberry ideal for treating experienced users who suffer from depression, chronic stress, chronic fatigue, mood swings, and migraines or tension headaches. This bud has a super sweet berry flavor accented by a strong punch of pungent skunkiness upon exhale that lingers long after you finish smoking. The stench is incredibly pungent with a powerful skunky berry effect that will fill any room. Merryhill Skunkberry buds have super dense conical forest green nugs with bright blue undertones, amber hairs, and a fine coating of tiny amber colored crystal trichomes.", "effects": ["Cerebral", "Relaxing"], "aromas": ["Berry", "Fruity", "Pungent", "Skunky", "Sweet"], "flavors": ["Berry", "Blueberry", "Sweet"], "relieves": ["Berry", "Blueberry", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mary Jane": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/mary-jane", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mary-jane/5479/au7s0lrq8vsk26iexcwl.jpg?t=f54b015ba8181ba30a82da8a2210b99f100030eb9622af5c4f1003f8e9a4d769", "name": "Mary Jane", "description": "Mary Jane, also known as “Mary OG,” is an indica dominant hybrid strain that is a cross through OG Kush X an unknown high indica hybrid strain. Now you may think we're talking about MJ in general, but nope – there's an actual strain named after our favorite lady. Nevertheless, Mary Jane brings a classic flavor to the table, one that you'd expect from one with a name like this – sweet kush and spicy lemon accented by a touch of skunky earth. The aroma takes a pungent turn, with a dank kush effect and a punch of sour skunky lemon that can fill a room with its powerful stench. The Mary Jane high is definitely one to please, too, with powerful full-bodied effects that are both relaxing and uplifting in nature. It starts with a cerebral rush that hits you between the eyes and in the back of the head, numbing any mental pains instantly. As your mind falls into a happy uplifted state, your body will slowly become more and more relaxed, ending in a state of slight sedation that can end in sleep for the lesser experienced users. Coupled with its powerful THC level that typically bottoms out at 19%, these effects make Mary Jane perfect for taming the effects of mood swings, depression, irritability, and chronic pain. Mary Jane buds have small round piecey olive green nugs with furry amber hairs.", "effects": ["Cerebral", "Happy", "Relaxing"], "aromas": ["Earthy", "Herbal", "Kush", "Spicy", "Sweet"], "flavors": ["Spicy", "Sweet"], "relieves": ["Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Mary OG": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/mary-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mary-og/7gYdCC7H/89jpg.jpg?t=b26934261e27c605ec8fe22c80452e7aed99422e74f25c642b39ab921b89acd0", "name": "Mary OG", "description": "Mary OG, also known as “Mary Kush” or simply as “Mary,” is an indica dominant hybrid strain (70% indica/30% sativa) created through an unknown combination of indica strains. Even though its heritage is unknown, Mary OG is thought to be some sort of descendent of the famous OG Kush. That being said, the high is very similar to OG Kush, with full-bodied effects that start in the head before working their way throughout the rest of your body. You'll feel a tingly sense of growing euphoria at the onset of the high, filling you with a sense of well-being and a touch of sociable energy. As you find yourself carrying on conversations with those around you, a giggly sense will wash over you, leaving you laughing at anything and everything. The tingle will soon turn into a heavy buzz, leaving you fully relaxed and pretty aroused at times. Combined with its high 18-21% average THC level, these effects make Mary OG perfect for treating chronic stress, depression, appetite loss or nausea and chronic pain. This bud has a classic sweet and spicy flavor with a delicious flowery and earthy aroma to match. Mary OG buds have fluffy oversized spade-shaped forest green nugs with thin orange hairs and a frosty thick coating of chunky bright white crystal trichomes.", "effects": ["Body High", "Cerebral", "Euphoria", "Giggly", "Relaxing", "Sociable"], "aromas": ["Earthy", "Flowery", "Spicy", "Sweet"], "flavors": ["Flowery", "Herbal", "Spicy", "Sweet"], "relieves": ["Flowery", "Herbal", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Master Hemp": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/master-hemp", "img": "https://media.allbud.com/resized/350x242/media/images/strain/master-hemp/DHLdRWeU/master-hempjpg.jpg?t=4f578c92fe19c76037b2dff8acf11145cdee59da6279395d111ce3012815cc43", "name": "Master Hemp", "description": "Master Hemp is a rare sativa dominant hybrid strain (70% sativa/30% indica) created as a cross of the infamous CBD-1 X Swiss Line strains. Searching for a super medicinal high to help ease your day-to-day aches and pains? Look no further – Master Hemp totally has you covered. This baby packs a super relaxing and clear-headed high that almost instantly kills the effects of a wide variety of conditions without any psychedelic effects, especially considering its 0% THC level and super high 12-16% average CBD level. You’ll feel lifted and totally relaxed with a sense of mental clarity that lends itself well to any task at hand. This is all accented by a touch of focus and motivation that won’t cause any anxiety or paranoia in the slightest. Thanks to these mellow effects, Master Hemp is said to be the perfect highly medicinal strain for treating conditions such as inflammation, spasticity, autism, chronic pain, glaucoma or headaches and nausea or appetite loss. This bud has a classic sweet tropical citrus flavor with a lightly sour herbal exhale. The aroma is of fruity earth and sour citrus with an herbal overtone that becomes slightly spicy as the nugs are broken apart and burned. Master Hemp buds have oversized airy spade-shaped olive green nugs with rich purple undertones, dark amber hairs and a coating of dark frosty purple crystal trichomes.", "effects": ["Cerebral", "Focus", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Fruity", "Herbal", "Sour", "Tropical"], "flavors": ["Citrus", "Lemon", "Sour", "Sweet", "Tropical"], "relieves": ["Citrus", "Lemon", "Sour", "Sweet", "Tropical"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Master Kush Diesel": {"url": "https://www.allbud.com/marijuana-strains/hybrid/master-kush-diesel", "img": "https://media.allbud.com/resized/350x242/media/images/strain/master-kush-diesel/5482/j9d8jhso7clwcpyha4eq.jpg?t=835eda38fa0e38c944972de775a85b8f29f845c0c3309909b7ccdd1e5883663f", "name": "Master Kush Diesel", "description": "Master Kush Diesel is one of the most renowned indica strains in the marijuana world. This strain's origin will lead you back to the Hindu Kush region where many other prominent indicas have emanated. Master Kush is an 100% indica hybrid that is a cross between Hindu Kush and Skunk. You should not smoke Master Kush if you're anticipating a very busy day or one that requires a great amount of focus. This strain delivers an almost immediate, relaxing body high that comes complete with acute mental clarity; something that is not common amongst other Indica strains. While the initial high can be full of socially elevated spirits, you'll eventually settle down to a deep and relaxing sleep. Patients often choose Master Kush due to it's ability to alleviate stress, pain, depression and insomnia. In the looks department, master kush produces distinguishable ball-shaped buds covered in bright orange hairs. In addition, it's character look, you will encounter a very strong citrus aroma with a hint of pine. Upon smoking, you can anticipate a pleasant and smooth taste that miraculously mimics its smell.", "effects": ["Focus", "Happy", "Relaxing"], "aromas": ["Diesel", "Lemon", "Pine"], "flavors": [], "relieves": [], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Master Miyagi Og": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/master-miyagi-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/master-miyagi-og/5EKwLTQU/63b30348-66ab-40f2-a242-2e40bbbc77a2jpe.jpg?t=cd77ce71cd977a1882c1494ee08b695034fa210262e988eeb22e28f8f058792c", "name": "Master Miyagi Og", "description": "Master Miyagi OG, also known as “Master Miyagi” or “Miyagi OG,” is an indica dominant hybrid strain (80% indica/20% sativa) created through crossing the infamous Hindu Kush X Skunk strains. This powerhouse celebrity child packs a potent punch of effects that will knock you flat out thanks to its super high 25-27% average THC level. That being said, Master Miyagi OG is one bud that you shouldn't underestimate. The high comes on fast and hard, with cerebral effects that send you flying into a hazy state of unfocused euphoria. Soon, your body will fall victim to his potency, dropping off into a deeply relaxing physical state that leaves you slightly couch-locked and totally at ease with the world around you. These full-bodied effects quickly turn sedative, leaving you sleepy and dozing off and on for hours on end. In combination with its high THC level, these heavy effects give Master Miyagi OG an edge in treating conditions such as chronic pain, depression, insomnia, and muscle spasms or cramps. This bud has a skunky herbal flavor with a slightly sour earthy exhale. The aroma is of pungent sour earth and heavy dank skunk with a touch of spiciness as the nugs are broken apart and burned. Master Miyagi OG buds have spade-shaped forest green nugs with amber furry hairs and a coating of frosty thick amber crystal trichomes.", "effects": ["Body High", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Earthy", "Pungent", "Skunky", "Sour"], "flavors": ["Herbal", "Skunky", "Sour"], "relieves": ["Herbal", "Skunky", "Sour"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Master P": {"url": "https://www.allbud.com/marijuana-strains/indica/master-p", "img": "https://media.allbud.com/resized/350x242/media/images/strain/master-p/SP1gYXAK/master-kushjpg.jpg?t=364012e12cf13f7615810eaf34e63ef029644e91949bb7683c32f60ba215af83", "name": "Master P", "description": "Master P, also known as “MasterP,” is a rare 100% indica hybrid strain created through crossing the classic Master Kush X an unknown combination of indica strains. Known for its insanely potent high, Master P is perfect for any indica lover who wants a little power behind their high. The high starts with a lazy feeling that slowly washes over you and builds into a slow burn, keeping you totally couch-locked and slightly sedated. A calming body high accompanies this heavy physical state, lifting you into pure bliss and ease. A buzzing feeling comes next, dropping your body into full sedation and leaving you dozing before you know it. With these effects and its high 20-25% average THC level, Master P is often chosen to treat those suffering from conditions such as chronic stress, depression, nausea, insomnia and chronic pain. This bud has a classic spicy flowery flavor with a harsh peppery exhale that can leave you coughing. The aroma is of peppery herbs and flowery earth with a lightly sweet overtone that turns spicier and spicier the more that you toke. Master P buds have popcorn-shaped forest green nugs with lots of thin amber hairs and a thick frosty coating of tiny matching crystal trichomes.", "effects": ["Body High", "Calming", "Relaxing", "Sleepy"], "aromas": ["Earthy", "Floral", "Herbal", "Spicy"], "flavors": ["Flowery", "Herbal", "Spicy"], "relieves": ["Flowery", "Herbal", "Spicy"], "type": "Indica", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Master Permafrost": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/master-permafrost", "img": "https://media.allbud.com/resized/350x242/media/images/strain/master-permafrost/5950/bmy7yajmezahq75yricy.jpg?t=d4c0ba8f86da08334bed7d5f845b5260372a481a553a477556a72c38e5a1ea0c", "name": "Master Permafrost", "description": "Master Permafrost is an indica dominant hybrid strain created through a cross of the potent Master Kush X Permafrost strains. This bud takes the character and appearance of Permafrost and multiplies them times a billion. The appearance is what you'll notice about it first – it has oversized super dense grape-shaped dark olive green nugs with amber hairs and a coating of tiny crystal trichomes that glitter in the light. The scent comes next, with a heavy pungency that's still fragrant and floral although skunky and woody. Once you take a hit of Master Permafrost, you'll taste sweet smooth flavors of pine and citrus that are surprisingly mellow in nature and very pleasant overall. The Master Permafrost high is a full-bodied experience that everyone should have at least once in their lives. It hits you first with a punch of euphoria and focus that leaves you feeling like you can conquer the world with ease. As your head high builds, your focus will suddenly wane, leaving you stoney and hazy with no hope of concentrating on anything. A sleepy effect will eventually wash over both mind and body, leaving you sedated and utterly relaxed. With its high 17-22% THC level and heavy-hitting effects, Master Permafrost is perfect for treating conditions such as ADD/ADHD, chronic pain, insomnia, and headaches or migraines.", "effects": ["Relaxing", "Sleepy"], "aromas": ["Fragrant", "Mellow", "Pungent", "Skunky", "Sweet"], "flavors": ["Citrus", "Pine"], "relieves": ["Citrus", "Pine"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Master Purple": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/master-purple", "img": "https://media.allbud.com/resized/350x242/media/images/strain/master-purple/S6v4xgxU/20211008_171609jpg.jpg?t=b4c1c3090569ae5f6acc98dcc866cb8e070e3dbb151d2cfe0d2e755f12a47122", "name": "Master Purple", "description": "Master Purple is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the classic Master Kush X Purple Kush strains. This celebrity child is best known for its super potent high thanks to its heavy 20-24% average THC level and totally gorgeous appearance. Master Purple buds have dense grape-shaped bright neon green nugs with lots of thin yellow-orange hairs and a coating of golden amber crystal trichomes. As you pull apart each frosty little nugget, aromas of pungent grape and spicy berries are released with a touch of dank herbs as the nugs are burned. The flavor is of fresh grape and earth with a touch of spicy berries and rich herbs upon exhale. The Master Purple high is just as mouthwatering as the flavor, with long-lasting effects that will actually leave you feeling slightly energized, even with its indica dominance. It starts with a lift of the spirits, infusing you with a sense of happiness and ease that fills you with pure euphoria. A touch of mental energy accompanies this lift, leaving your mind active while your body settles into deep relaxation and peace. Thanks to these effects and its high THC level, Master Purple is perfect for treating chronic pain, insomnia, appetite loss or nausea, and chronic stress.", "effects": ["Energizing", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Berry", "Earthy", "Fruity", "Grape", "Herbal", "Spicy"], "flavors": ["Berry", "Fruity", "Grape", "Herbal", "Spicy", "Sweet"], "relieves": ["Berry", "Fruity", "Grape", "Herbal", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Masters'N Crime": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/mastersn-crime", "img": "https://media.allbud.com/resized/350x242/media/images/strain/mastersn-crime/9gXFEqwY/super-budjpg.jpg?t=17f6551438d2ef67b9b556e78c67dba5aac9c549a0136d1fb043a1901de8441a", "name": "Masters'N Crime", "description": "Masters ‘N Crime, also known as “Masters & Crime” or “Masters N Crime,” is an indica dominant hybrid strain (80% indica/20% sativa) created through crossing the classic Super Bud X (Jack Herer X Himalayan Gold) strains. If you're after a soothing bud that will help you settle down and relax before getting to sleep at night, you've found it with Masters ‘N Crime. It starts with a subtle boost that creeps into the brain and body, filling it with a lightly weighty happy sense that pushes out any negative or racing thoughts. You'll feel a sense of calm accompany this euphoric boost, helping you to settle down without any aches or pains to speak of. A sharp pang of hunger comes next, leaving you reaching for anything in sight to snack on. Combined with its super high 20-30% average THC level, these full-bodied effects make Masters ‘N Crime a great choice for treating those patients suffering from conditions such as chronic pain, depression, chronic stress, appetite loss or nausea and insomnia. This bud has a sweet and sour citrusy lemon flavor with a lightly spicy and flowery exhale. The aroma is very similar, with a woody flowery overtone accented by spicy herbs and fresh fruity citrus. Masters ‘N Crime buds have heavy conical forest green nugs with thick amber hairs and a frosty milky coating of tiny, amber tinted crystal trichomes.", "effects": ["Calming", "Creative", "Happy", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Flowery", "Lemon", "Spicy"], "flavors": ["Citrus", "Fruity", "Lemon", "Sour", "Sweet", "Woody"], "relieves": ["Citrus", "Fruity", "Lemon", "Sour", "Sweet", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Master Tuna": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/master-tuna", "img": "https://media.allbud.com/resized/350x242/media/images/strain/master-tuna/DqXwBX4Y/20-cjpg.jpg?t=5dc33cb85120f4d9433211cf95946743d0b394658e988792745bdd2c6c627412", "name": "Master Tuna", "description": "Master Tuna, also known as “Master Tuna Kush,” is an indica dominant hybrid strain (70% indica/30% sativa or 75% indica/25% sativa) created through crossing the classic Master Kush X Tuna Kush strains. This celebrity child boasts a super stimulating high that surprisingly hits a lot like a sativa rather than an indica. You'll feel an immediate increase in sensory awareness, filling your mind with a sense of thoughtful energy that goes well with your sharpened focus. You'll feel creative and inspired, ready to tackle anything on your to-do list. As your mind continues to sharpen, your body will start to fall off into a heavy relaxation that leaves you slightly sedated without causing too much sedation. Combined with its high 18-23% THC level, these full-bodied effects give Master Tuna an edge in treating conditions such as chronic fatigue, depression, chronic stress, arthritis, insomnia and chronic pain. Master Tuna has a classic spicy fishy pungent flavor with a super sour citrusy exhale. The aroma is heavier and more pungent than the taste, with hints of rotting fish and skunk that fill any room with a heavy stench. Master Tuna buds have oversized spade-shaped minty green nugs with amber undertones, lots of orange hairs and a coating of tiny golden amber crystal trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Energizing", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Pungent", "Skunky", "Sour", "Spicy"], "flavors": ["Citrus", "Peppery", "Skunky", "Sour", "Spicy"], "relieves": ["Citrus", "Peppery", "Skunky", "Sour", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Master x Blackberry": {"url": "https://www.allbud.com/marijuana-strains/hybrid/master-x-blackberry", "img": "https://media.allbud.com/resized/350x242/media/images/strain/master-x-blackberry/5483/xpzgav9zgyjtej3kvx44.jpg?t=f0859e9b7f20106477ce66e928dfcc8e12f0581ecb22b1a02dc22e88067c144f", "name": "Master x Blackberry", "description": "Master x Blackberry is basically an indica strain that is a made of Blackberry and Afghani strains. It comprises of striking dark purple buds that have orange hairs. The plant of this strain takes up to 7-8 weeks to blossom. It usually does not have high yields but its buds are dense and contain crystals. This specific strain has a strong, fuel-like smell and a balanced taste because of sweet berries. People have varied responses regarding the smell of Master x Blackberry but most agree on its taste and describe it as being sweet and fruity. It carries a flavor similar to that of eucalyptus leaves and is generally described as being smooth on the throat. The ancestry of the Master x Blackberry strain is a mystery. It has been popular especially in the dispensaries of California. Due to the fact that it is able to induce the body effects that can be attributed to the dominant indica gene, this strain is highly recommended for trying dealing with pain. It can be called a night time strain as it helps relax the body and induces sleep. It provides a relaxing effect to the user. Due to this, it is effective for people suffering from insomnia and pain but should not be consumed in the mornings as it can make a person tired and lazy.", "effects": ["Energizing", "Euphoria", "Happy"], "aromas": ["Sour", "Sweet"], "flavors": [], "relieves": [], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Matanuska Mint": {"url": "https://www.allbud.com/marijuana-strains/hybrid/matanuska-mint", "img": "https://media.allbud.com/resized/350x242/media/images/strain/matanuska-mint/2912/fxmgwlnfumnivlabde7m.jpg?t=8a5a8429a9b1fdad0e047e06c3f8e6622efaf4300d1b87a1420d247f58dfc403", "name": "Matanuska Mint", "description": "Matanuska Mint is an evenly balanced hybrid (50% sativa/50% indica) strain created as a cross of the delicious Matanuska Thunder X Gray Mist strains. This bud is named for its infamous minty taste and smell, and offers the user a moderate THC level between 14-16%. Both the aroma and taste have a sharp minty hit that transition into a deliciously smooth earthy spice. Matanuska Mint buds have long narrow cigar-shaped forest green nugs with a spattering of long thin minty hairs and minty undertones. Each nug is frosted with a fine layer of sugary white trichomes and sweet sticky resin. The Matanuska Mint high hits you hard and fast with a case of red droopy eyes and a hazy mind that is accompanied by a quickly building cerebral energy and motivation. This sativa based high will keep building as the high continues, outweighing the body effects completely until the comedown. As the high starts to fade, the body high will take hold and leave you completely sedated and couch-locked with an overwhelming sleepiness that will eventual knock you out cold. Because of these effects, Matanuska Mint is perfect for treating asthma, chronic pain, fatigue, and mild to moderate cases of depression.", "effects": ["Focus", "Uplifting"], "aromas": ["Earthy", "Spicy"], "flavors": ["Spicy"], "relieves": ["Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Matanuskan Mist": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/matanuskan-mist", "img": "https://media.allbud.com/resized/350x242/media/images/strain/matanuskan-mist/78tbkzqm/matanuskan-mistjpg.jpg?t=6df2341afda83dbb080f7fd4df7ce69b01c399bdb063baa231fba1b891e05bf1", "name": "Matanuskan Mist", "description": "Matanuskan Mist, also known as “Matanuska Mist,” is a sativa dominant hybrid strain created through crossing the infamous Matanuska Tundra X Grey Mist strains. Named for both of its parent strains, this celebrity child packs a super heavy high that will have you totally couch-locked and kicking back for hours on end. It starts with a subtle lift that fills you with a cerebral happiness that's accented by energy and focus. A deeply relaxing body buzz comes next, washing over you in warming waves and leaving you totally couch-locked and immovable for hours and hours on end. With these effects and its high 15-16% average THC level, Matanuskan Mist is said to be perfect for treating those suffering from conditions such as chronic stress, depression, chronic pain, mood swings and ADD or ADHD. This bud has a rich spicy herbal overtone with an earthy effect that turns pungent almost as soon as it hits the tongue. The aroma is of earthy pungency with a heavy skunky overtone that turns dank and spicy as the nugs are burned away. Matanuskan Mist buds have dense grape-shaped dusty green nugs with thin light amber hairs and a dusty coating of thick frosty amber crystal trichomes.", "effects": ["Aroused", "Body High", "Cerebral", "Energizing", "Happy", "Relaxing"], "aromas": ["Dank", "Earthy", "Herbal", "Pungent", "Spicy"], "flavors": ["Herbal", "Skunky", "Spicy"], "relieves": ["Herbal", "Skunky", "Spicy"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Matanuska Thunder": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/matanuska-thunder", "img": "https://media.allbud.com/resized/350x242/media/images/strain/matanuska-thunder/xsUHhi9r/15775831317517228111883379415748jpg.jpg?t=f064c4979e8278493c69619c293c753eb5c4002c1e00c178c247fa13cc03290f", "name": "Matanuska Thunder", "description": "Matanuska Thunder, also known as “Matanuska Thunder Fuck,” “Matanuskan Thunder” and “Matanuska Thunderfuck,” is a slightly sativa dominant hybrid strain (60% sativa/40% indica) created through an unknown combination of hybrid strains. Infamous for its super lazy high, Matansuka Thunder is the perfect bud for when you need a little extra help to really kick back and relax after a long and stressful day. You'll feel a lifted state of euphoria come rushing in first, filling your mind with pure happiness and a touch of giggly creativity. As your mind reaches new heights, your body will begin to settle into a deeply relaxing state that keeps you couch-locked and anchored. In combination with its high 13-16% average THC level and 1-2% CBD level, these effects give Matanuska Thunder an edge in treating those suffering from conditions such as chronic stress, nausea, chronic pain, depression and chronic fatigue. This bud has a super sweet chocolaty flavor with a lightly spicy earthy exhale. The aroma is of earthy herbs and spicy chocolate with a rich dark chocolate overtone that sweetens as the nugs are burned away. Matanuska Thunder buds have small thick heart-shaped bright neon green nugs with lots of orange hairs, bright amber undertones and a matching coating of crystal trichomes.", "effects": ["Body High", "Creative", "Euphoria", "Giggly", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Cheese", "Chocolate", "Earthy", "Herbal", "Spicy"], "flavors": ["Cheesy", "Chocolate", "Fruity", "Spicy", "Sweet"], "relieves": ["Cheesy", "Chocolate", "Fruity", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}}