{"Q3": {"url": "https://www.allbud.com/marijuana-strains/hybrid/q3", "img": "https://media.allbud.com/resized/350x242/media/images/strain/q3/5614/fqmi6vlpvyvcfgrlveiq.jpg?t=fc1791110e4c36c6ea956bf894f4c046ca5b2ac4819f183fc69c264688d2864e", "name": "Q3", "description": "Q3 is a rare sativa-dominant strain, though the precise ratio of sativa to indica genes isn't widely known. It's an ideal daytime selection, delivering a powerful cerebral high that comes with a boost of creativity, euphoria, giggling, happiness, and increased sociability. This strain's THC levels enhance those effects, bringing potency as strong as 21% in some tests. With numbers like that, Q3 is an effective medication for treating depression, chronic pain, insomnia, and everyday stress. But the amount of CBD found in this plant is much lower, much too low to recommend it for treatment of seizures and other conditions that can be alleviated with CBD concentrates. The smell and flavor of Q3 are both fruity with hints of lemon, while the small nugs are light green with numerous orange hairs and a dense layer of frosty trichome crystals. The only widely reported negative effects from this strain are dry eyes and dry mouth, though others may be possible. Q3 is far from popular, despite the substantial punch it packs, but it may be found in at least one Denver medical marijuana dispensary.", "effects": ["Creative", "Euphoria", "Focus", "Giggly", "Happy", "Hungry", "Sociable"], "aromas": ["Fruity", "Lemon"], "flavors": ["Apple", "Citrus", "Fruity", "Grapefruit", "Lemon"], "relieves": ["Apple", "Citrus", "Fruity", "Grapefruit", "Lemon"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Quadra": {"url": "https://www.allbud.com/marijuana-strains/hybrid/quadra", "img": "https://media.allbud.com/resized/350x242/media/images/strain/quadra/pzY9cgaU/20210401_000257jpg.jpg?t=174b0312832fbc2e14df3dc5879e685c80120a82a56bc5a45929b560d612c057", "name": "Quadra", "description": "Quadra is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic BC Kush X Burmese strains. If you're searching for the perfect well-balanced hybrid with classic effects, you've found it with Quadra. This bud brings on the potency, hitting both mind and body with soothing and lifting effects. The onset hits you a few minutes after your final toke, lifting your spirits suddenly and filling your cerebral state with a sense of creative introspection and happy thoughts. You'll be able to carry on conversations with those around you easily in this state, delving deeper and deeper into philosophical thought as you do so. While you carry on socially, your body will begin to relax into a calming state of soothing physical ease that has you fully relaxed from head to toe. With these effects and its moderately high 14-19% average THC level, Quadra is often chosen to treat chronic pain, insomnia, depression, chronic stress and chronic pain. This bud has a sweet and sour lemon-lime flavor with a lightly spicy exhale, almost like drinking a Sprite. The aroma is very similar, although with hints of black pepper to it, too. Quadra buds have small spade-shaped dark olive green nugs with thin amber hairs and a coating of tiny amber-tinted white crystal trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Creative", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Lemon", "Lime", "Sour", "Spicy"], "flavors": ["Citrus", "Lemon", "Lime", "Peppery", "Sour"], "relieves": ["Citrus", "Lemon", "Lime", "Peppery", "Sour"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Quantum Berry": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/quantum-berry", "img": "https://media.allbud.com/resized/350x242/media/images/strain/quantum-berry/l5ylRZyO/quantum-leapjpg.jpg?t=c51770dd582634ca8f554c4c3c426496fe467973cf549a94c606e25abdce8e48", "name": "Quantum Berry", "description": "Quantum Berry, also known as “QuantumBerry,” is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the iconic Quantum Leap X DJ Short Blueberry strains. If you're after a fast-hitting, full-bodied high with a delicious flavor, too, you've found it with Quantum Berry. This bud has a high that will hit you between the eyes a few minutes after your final exhale, launching your brain into a state of pure lifted happiness and unfocused bliss. You'll feel hazy and a little out of touch with reality, although totally happy about it, from start to finish. At the same time, a numbing body high will seep into your limbs, slowly dropping you off the face of the planet and into a state of pure couchlock and sleepy sedation. Combined with its high 16-20% average THC level, these effects make Quantum Berry a great choice for treating conditions such as chronic pain, depression or mood swings, insomnia, cramps or muscle spasms and appetite loss. This bud has a sweet and fruity berry blueberry flavor with hints of sour lemony citrus and skunky tropical fruits. The aroma is of skunky earthiness accented by fresh fruity berries, spicy cherries and super sour lemony citrus. Quantum Berry buds have fluffy oversized spade-shaped olive green nugs with blue undertones bright red hairs and frosty blue-tinted white crystal trichomes.", "effects": ["Body High", "Cerebral", "Happy", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Lemon", "Skunky", "Sour", "Tropical"], "flavors": ["Berry", "Cherry", "Citrus", "Fruity", "Sour", "Sweet", "Tropical"], "relieves": ["Berry", "Cherry", "Citrus", "Fruity", "Sour", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Quantum Leap": {"url": "https://www.allbud.com/marijuana-strains/hybrid/quantum-leap", "img": "https://media.allbud.com/resized/350x242/media/images/strain/quantum-leap/wDvYG1Bw/quantum-kushjpg.jpg?t=89981f832363238b086b887f29d3a18d68ecbac1b2e880bdebf338d8aa3cfa01", "name": "Quantum Leap", "description": "Quantum Leap is a rare evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the infamous Quantum Kush with another unknown hybrid strain. Even with the lack of information about Quantum Leap's heritage, this bud is infamous for its super lifted high that leaves you flying through psychedelic visions after just a single toke. The high starts with a rush of cerebral effects that fill your mind with a buzzy tingle and leave you feeling totally euphoric and insanely energized. Your mind will quickly begin to fade away into creative visions, leaving you spacey and unfocused as your mind flies higher and higher. A relaxing body high accompanies this state, keeping you anchored to the world below as your mind soars. Thanks to these effects and its super high 23-28% average THC level, Quantum Leap is often chosen to treat those suffering from conditions such as depression, chronic stress, nausea or appetite loss, chronic fatigue, and chronic pain. This bud has a sour tropical citrus flavor with a skunky berry exhale. The aroma is of rich spicy berries with a skunky overtone that's accented by sharp sour citrus as the nugs are broken apart and burned. Quantum Leap buds have oversized airy bright neon green nugs with dark amber hairs and a coating of golden amber crystal trichomes.", "effects": ["Body High", "Cerebral", "Giggly", "Relaxing", "Tingly"], "aromas": ["Berry", "Citrus", "Earthy", "Herbal", "Sour", "Tropical"], "flavors": ["Citrus", "Lemon", "Skunky", "Sour", "Spicy", "Tropical"], "relieves": ["Citrus", "Lemon", "Skunky", "Sour", "Spicy", "Tropical"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Queen Frostine": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/queen-frostine", "img": "https://media.allbud.com/resized/350x242/media/images/strain/queen-frostine/HqOQsjWS/candylandjpg.jpg?t=9260998e93c810f2acf2b7c750dcb4fe9e038b8143ba9d08755a70f73a6e926a", "name": "Queen Frostine", "description": "Queen Frostine is a heavily indica dominant hybrid strain (90% indica/10% sativa) created through crossing the delicious Candyland X The White strains. A hard-hitting indica that will have you feeling surprisingly energized, Queen Frostine is a favorite among breeders and patients alike for its unique high. It starts in the head with a cerebral boost that fills your mind with a lifted euphoria. You'll feel your senses activate as your happiness grows and expands, turning on your focus and upping your creative energy to new heights. You'll be social and giggly in this state as you fade in and out of focus. A tingly and arousing body high will accompany this heady boost, helping to keep you anchored. Thanks to these effects and its high 20-30% average THC level, Queen Frostine is often chosen to treat those suffering from conditions such as chronic pain, cramps or muscle spasms, depression, chronic fatigue, ADD or ADHD and chronic stress. This bud has a sweet yet sour apple flavor with hints of citrusy lemon upon exhale. The aroma is very similar, with a sour lemony citrus overtone accented by a punch of fruity chemicals and spicy earthiness. Queen Frostine buds have heavy spade-shaped bright emerald green nugs with thick dark orange hairs and a coating of frosty, golden-white crystal trichomes.", "effects": ["Aroused", "Creative", "Energizing", "Focus", "Relaxing", "Uplifting"], "aromas": ["Chemical", "Citrus", "Earthy", "Herbal", "Lemon", "Sour", "Spicy"], "flavors": ["Apple", "Citrus", "Fruity", "Lemon", "Sour", "Spicy", "Sweet"], "relieves": ["Apple", "Citrus", "Fruity", "Lemon", "Sour", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Queen Green": {"url": "https://www.allbud.com/marijuana-strains/hybrid/queen-green", "img": "https://media.allbud.com/resized/350x242/media/feature/strain/queen-green.jpg?t=7e41f7a19346980d94fc605fdf5ec33f1131012b77654d6fd6bbfb6a0eef0c7d", "name": "Queen Green", "description": "Queen Green is a strong marijuana strain that has a mushy green appearance. It is a cross between Green Crack and Space Queen, hence the name Queen Green. It has a very high THC level and an extremely powerful buzz that takes over your entire body immediately. It has a very interesting and pungent flavor, which has a good combination of nutty and spicy tastes. It also has that hint of earthy flavor that produces a nice, soothing effect on the body. Queen Green's aroma is a very nice as well. Its aroma is a blend of earthy, nutty, spicy and herbal odors. Queen Green mostly has positive effects on your body. It makes you feel extremely euphoric and happy as soon as you smoke it. It also energizes and makes you feel creative. Therefore, it is good for when you want to work on something that requires creativity. This marijuana strain is used for treating a number of conditions. It is excellent for curing anxiety, stress and depression, which is why anxiety patients often rely on Queen Green for mitigating their stress. It can also be used for soothing high blood pressure and can provide relief from terrible mood swings. Irregular and hard bowel movements can also be treated with Queen Green. You can also use it for nausea, insomnia and pain.", "effects": ["Creative", "Energizing", "Euphoria", "Happy"], "aromas": ["Earthy", "Herbal", "Nutty"], "flavors": ["Pine", "Spicy", "Sweet", "Woody"], "relieves": ["Pine", "Spicy", "Sweet", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Queen Haze": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/queen-haze", "img": "https://media.allbud.com/resized/350x242/media/images/strain/queen-haze/HPpV2kbw/haze-queenjpg.jpg?t=16b110360a50be93918fcaf27ffb7622727978baec02e6064dc40724856f8c2e", "name": "Queen Haze", "description": "Queen Haze, also known as “Haze Queen,” is a heavily sativa dominant hybrid strain (90% sativa/10% indica) created through crossing the iconic Haze X African Queen strains. If you're after true royalty in the Haze family, you've found it with Queen Haze. This bud packs a super heady high that will have you feeling insanely euphoric and pretty out of touch with reality for hours on end. You'll feel instant relief as soon as you exhale as your mind is filled with an expansive sense of euphoria that instantly pushes out any thought. Your mind will be filled with a light sense of weighty calm that leaves your eyes drooping and you feeling super giggly and sociable, laughing at anything and everything around you. A light physical relaxation accompanies this heady boost, keeping you feeling anchored without affecting your energy level. Combined with its super high 20-28% average THC level and 0-1% CBD level, these effects give Queen Haze an edge in treating conditions such as the effects of PMS, chronic stress or anxiety, PTSD, insomnia and chronic fatigue. This bud has a sweet and sour tropical lemon-lime flavor with a punch of spicy pineapple. The aroma is very similar, with a bouquet of sour citrusy pineapple and lemon-lime accented by spicy herbs and earthy flowers. Queen Haze buds have oversized hand-shaped minty green nugs with thin orange hairs and tiny, milky amber crystal trichomes.", "effects": ["Calming", "Euphoria", "Giggly", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Citrus", "Earthy", "Flowery", "Herbal", "Lemon", "Lime", "Spicy"], "flavors": ["Citrus", "Lemon", "Lime", "Pineapple", "Sour", "Tropical"], "relieves": ["Citrus", "Lemon", "Lime", "Pineapple", "Sour", "Tropical"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Queen Mary": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/queen-mary", "img": "https://media.allbud.com/resized/350x242/media/images/strain/queen-mary/dwBchJUa/queen-maryjpg.jpg?t=065903f43f92f109c1ac6a738ad8d612a17dbbe9b69080a3fdcf54dc1906d0b0", "name": "Queen Mary", "description": "Queen Mary is an indica dominant hybrid strain created through crossing the infamous Grand Daddy Purple X Blackberry Kush strains. Although hard to find on your average market outside of the West Coast, Queen Mary is a favorite among patients for its super heavy high and relaxing effects. The high starts with a slow burn, creeping up on you before taking hold of your mind with a heavy cerebral sedation. You’ll feel totally calm and lifted with an unfocused and hazy stone that has you blissfully unaware of everything happening around you. As your mind settles into oblivion, your body will begin to follow suit, relaxing into a lightly couch-locked state of pure ease that has you totally pain-free from head to toe. With these soothing effects and its high 22%+ average THC level, Queen Mary is often chosen to treat conditions such as chronic pain, muscle spasms or cramps, spasticity and inflammation. This bud has a sweet and fruity spicy grape flavor with a light touch of flowers upon exhale. The aroma is spicy and flowery with an earthy overtone that turns fruity as the nugs are burned away. Queen Mary buds have small rounded dark olive green nugs with purple undertones, dark purple hairs and a coating of matching crystal trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Happy", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Flowery", "Fruity", "Herbal", "Spicy"], "flavors": ["Flowery", "Fruity", "Grape", "Spicy", "Sweet"], "relieves": ["Flowery", "Fruity", "Grape", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Queen Sweet Pea": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/queen-sweet-pea", "img": "https://media.allbud.com/resized/350x242/media/images/strain/queen-sweet-pea/71jkslJg/96jpg.jpg?t=844b3aa64190db43cb35aa6072339560fa80f0752aff2e1dc4a53bf861262cb2", "name": "Queen Sweet Pea", "description": "Queen Sweet Pea is a rare indica dominant hybrid strain (75% indica/25% sativa) created through crossing the potent Cannatonic Perkins Cut X Nom Nom strains. Named for its sweet flavor and cute little nuggets, Queen Sweet Pea is a great bud for any indica lover who's looking for some sweet relaxation after a long and stressful day. The high starts with a subtle build of cerebral effects, working its way slowly into your mind and leaving you feeling lifted and unfocused, without a care in the world. A sense of happiness will wash over you in this state, rinsing away any negative or racing thoughts. As your mind settles, your body will begin to drop into a state of pure sedation and ease, relaxing aching or sore muscles and letting you really kick back. With these effects and its moderate 14-15% THC level and super high 4-5% CBD level, Queen Sweet Pea is often chosen to treat conditions such as inflammation, chronic pain, cramps or muscle spasms, arthritis and insomnia. This bud has a classic sweet and citrusy berry woody flavor. The aroma is spicier and earthier, with a sour citrus overtone that's accented by woody pine and herbs. Queen Sweet Pea buds have grape-shaped fluffy minty green nugs with thin orange hairs and a coating of tiny frosty white crystal trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Happy", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Fruity", "Herbal", "Pine", "Spicy", "Sweet", "Woody"], "flavors": ["Berry", "Citrus", "Fruity", "Pine", "Sour", "Sweet", "Woody"], "relieves": ["Berry", "Citrus", "Fruity", "Pine", "Sour", "Sweet", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Queso": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/queso", "img": "https://media.allbud.com/resized/350x242/media/images/strain/queso/TSktkmty/20210119_203626jpg.jpg?t=6b2cb07bbbe75cbd09b30f3fa5c43cbd4e979b23ed2c5d103dcbbaa76d76504e", "name": "Queso", "description": "Queso, also known as “Kiss,” is an indica dominant hybrid (65% indica/35% sativa) strain created through a cross of the heavy Cheese X Afghani strains. Pretty much anyone can tell you “queso” is Spanish for cheese – and you're going to get a lot of cheesy flavor with this tasty little guy. Queso has a creamy buttery cheese flavor that takes a spicy dank turn on exhale that can leave you coughing. The smell, or should I say stench, is pretty overpowering, filling any room with pungent rotting cheese and sour skunk seconds after you open your jug. This stench is made worse as you break apart each tiny minty green nug and smoke it. The Queso high creeps up on you a few minutes after you finish coughing up a lung, suddenly taking hold of your mind with slightly stoney euphoria. You'll feel lifted in both mind and body, before your body gets pulled back down to Earth with a buzzy body high. This high won't cause you to become couch-locked, but you will start to get pretty sleepy as it begins to fade. Paired with its moderate 13-16% average THC level, these effects make Queso an excellent choice for treating chronic anxiety or stress, insomnia, fatigue, and depression.", "effects": ["Body High", "Euphoria", "Sleepy", "Uplifting"], "aromas": ["Cheese", "Dank", "Floral", "Pungent", "Skunky", "Spicy"], "flavors": ["Cheesy", "Creamy", "Dank", "Skunky", "Spicy"], "relieves": ["Cheesy", "Creamy", "Dank", "Skunky", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Queso Fuertes": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/queso-fuertes", "img": "https://media.allbud.com/resized/350x242/media/images/strain/queso-fuertes/SnnEB8Ka/42-cjpg.jpg?t=a2d686d7257304126c7dfe7e4d15cf99787c59a1da953efdb944ce62513a5149", "name": "Queso Fuertes", "description": "Queso Fuertes is a sativa dominant hybrid strain (70% sativa/30% indica) created through crossing the potent Exodus Cheese X Sin City Kush strains. Famous for its super delicious flavor and lifted yet relaxing high, Queso Fuertes is the perfect choice for any sativa lover. Like its name suggests, Queso Fuertes packs a super cheesy taste that's accented by a sour exhale and hints of spicy herbs. The aroma is very similar, with a spicy pungent cheesy overtone that intensifies the more that you toke. The Queso Fuertes high is on the brighter side of things, with energizing and lifted effects that will stimulate both mind and body. You'll feel a soaring happiness hit you almost as soon as you exhale, filling your mind with an expansive euphoria that pushes out any negative thoughts immediately. A light physical tingle comes next, creeping into your body slowly before fully taking hold and leaving you feeling physically relaxed although not sedated in the slightest. In combination with its high 15-18% average THC level, these effects give Queso Fuertes an edge in treating conditions such as depression, chronic stress, nausea or appetite loss, chronic fatigue and chronic pain. Queso Fuertes buds have long pepper-shaped blue-green nugs with vivid orange hairs and a coating of tiny milky white crystal trichomes.", "effects": ["Body High", "Euphoria", "Happy", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Cheese", "Earthy", "Flowery", "Pungent", "Sour", "Spicy"], "flavors": ["Flowery", "Sour", "Spicy", "Sweet"], "relieves": ["Flowery", "Sour", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Quick One": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/quick-one", "img": "https://media.allbud.com/resized/350x242/media/images/strain/quick-one/PYTGdZO2/northern-lights-12jpg.jpg?t=dba50788125ee2c092c2854db4ebed79f5f4a3315e3a878353f09f1486fcc22c", "name": "Quick One", "description": "Quick One, also known as “The Quick One,” is an indica dominant hybrid strain (60% indica/10% sativa/30% ruderalis) strain created through crossing the infamous Northern Lights X William's Wonder X Mexican Ruderalis strains. Named for its insanely fast grow, Quick One is the perfect choice for the patient who wants a mellow high to help them kick back when they're feeling the effects of life's daily stresses. The Quick One high comes on with a slow build, lifting you gently into a state of happy euphoria and mental calm. This relaxing effect will soon spread throughout the rest of your body leaving you totally at ease and physically couch-locked. This combination can quickly turn sedative, leaving you dozing off before you know it. Thanks to these effects and its moderate 10-15% average THC level, Quick One is often said to be perfect for treating those suffering from conditions such as chronic stress, depression, chronic pain, insomnia and chronic fatigue. This bud has a spicy and woody flavor with a lightly earthy exhale. The aroma is very similar, with an earthy pungent overtone that turns heavy and skunky as the nugs are broken apart and burned away. Quick One buds have grape-shaped forest green nugs with dusty undertones, light amber hairs and a coating of thick and frosty matching crystal trichomes.", "effects": ["Body High", "Calming", "Cerebral", "Euphoria", "Relaxing", "Sleepy"], "aromas": ["Earthy", "Pungent", "Skunky", "Spicy"], "flavors": ["Herbal", "Skunky", "Spicy", "Woody"], "relieves": ["Herbal", "Skunky", "Spicy", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Quicksilver": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/quicksilver", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Quicksilver", "description": "Quicksilver, also known as “Quick Silver,” is a slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the potent Super Silver Haze X Mimosa strains. Named for the iconic X-Men character, Quicksilver packs a super quick-hitting high that will leave you spinning for hours on end. That being said, this bud is often sought out as a hard-hitting wake-and-bake for when you need a little last-minute energy to get you going. You'll be electrified with near instantaneous energy almost as soon as you exhale, getting you up and out of bed or off of the couch in record time. You'll also get a pretty heavy mood boost with this bud, filling you with happiness that will put a smile on your face for hours on end. Combined with its high 23-24% average THC level and 1-2% average CBD level, these bright effects make Quicksilver a great choice for treating a variety of conditions including chronic fatigue, depression or mood swings, chronic stress, headaches and nausea. This bud has a sweet fruity blueberry flavor with hints of sour citrusy grapefruit and spicy skunk to it, too. The aroma is like a charcuterie plate, with creamy cheese, savory herbs and fresh fruits galore. Quicksilver buds have conical minty green nugs with golden undertones, thin orange hairs and frosty, golden-white crystal trichomes.", "effects": ["Cerebral", "Energizing", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Blueberry", "Cheese", "Earthy", "Flowery", "Grapefruit", "Herbal", "Skunky", "Spicy"], "flavors": ["Berry", "Blueberry", "Cheese", "Fruity", "Herbal", "Sage", "Sweet"], "relieves": ["Berry", "Blueberry", "Cheese", "Fruity", "Herbal", "Sage", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}}