{"B-Well Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/b-well-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/b-well-kush/8181/rbhv7moh4ssv6hqctozh.jpg?t=3b18e3c714a726c6eb7408ec59ae13871066339c7c8771922b65876d46932897", "name": "B-Well Kush", "description": "B-Well Kush is a rare indica dominant hybrid strain created through crossing the infamous OG Kush X Pure Kush X Bubba Kush strains. This bud took home 1st Place for Best Indica at the 2012 THC Classic and 2nd Place in 2013. Once you experience its relaxing full-bodied effects and super high 25% average THC level, you'll soon see why. The B-Well Kush high comes on pretty quickly after your first exhale, lifting your mind and leaving you in a state of happy focus. You'll feel an increase in creativity and motivation in this state, with a tendency towards being sociable with anyone and everyone around you. Almost as quickly as this lift starts, it will be stolen away, replaced with a sleepy sense of relaxation and couch-lock. Your body will fall deeper and deeper into sedation, eventually pulling your mind with it into a long peaceful sleep. Thanks to these powerful effects, B-Well Kush is often chosen to treat conditions such as chronic stress or anxiety, depression, mood swings, chronic pain, and fatigue. This bud has a classic spicy herbal citrus flavor and a woody aroma to match. B-Well Kush bud have small dusty green nugs with furry orange hairs and a light frosted coating of tiny milky white crystal trichomes.", "effects": ["Creative", "Focus", "Happy", "Sleepy", "Sociable", "Uplifting"], "aromas": ["Earthy", "Herbal", "Lemon", "Sweet", "Woody"], "flavors": ["Citrus", "Herbal", "Pine", "Spicy"], "relieves": ["Citrus", "Herbal", "Pine", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "B29": {"url": "https://www.allbud.com/marijuana-strains/hybrid/b29", "img": "https://media.allbud.com/resized/350x242/media/images/strain/b29/yKNRhggz/green-crackpng.jpg?t=9d0546a9612de2432f4aa980456c18398b67e1c2e36e8c6e885dfa7a3bbb2725", "name": "B29", "description": "B29 is an evenly balanced hybrid strain (50% indica/50% sativa) created through a cross of the classic Green Crack X Holy Grail Kush strains. Perfect for any hybrid lover, B29 packs a long-lasting high that hits both mind and body with a high level of potency thanks to its super high THC level, which typically bottoms out at about 20% on average. That being said, B29 is not to be underestimated – it can totally knock out even the most experienced of users if they don't mind their dosage. The high starts with a subtle build, sneaking up on the back of the mind before launching through it with a lifted energy and euphoria. As your mind soars higher and higher, a sense of unfocused happiness will wash over you, leaving you dazed and floating through happy visions as your body begins to settle into a deeply relaxing physical stone. With these effects and its high THC level, B29 is said to be perfect for treating migraines or headaches, depression, chronic fatigue, nausea, and chronic stress. This bud has a sweet and sour skunky pine flavor with a heavily dank and pungent aroma to match. B29 buds have elongated super dense olive green nugs with dark amber hairs and a coating of tiny clear crystal trichomes.", "effects": ["Cerebral", "Energizing", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Dank", "Earthy", "Pungent", "Skunky", "Spicy"], "flavors": ["Herbal", "Pine", "Skunky", "Sweet", "Woody"], "relieves": ["Herbal", "Pine", "Skunky", "Sweet", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BABY JESUS OG": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/baby-jesus-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/baby-jesus-og/7852/uwzjejoli8mmziw8qodd.jpg?t=11e72ad23b164298a1d063277ebd9b3a880c98d9085490fb925877eaa6928e61", "name": "BABY JESUS OG", "description": "Baby Jesus OG is a super rare sativa dominant hybrid strain that is said to be a cut of the classic Jesus OG, a Jack's Cleaner X Hell's OG X Space Queen cross. This bud brings on the classic Jesus OG effects but to a slightly lesser level, with a lower THC level that tops out at about 20% on average. Even with the slight decrease in THC level, Baby Jesus OG brings on the energizing lifted effects of its parent, infusing the user with long-lasting energy perfect for a wake-and-bake or an afternoon pick-me-up. You'll feel the energizing effects almost as soon as you exhale, accompanied by a rush of euphoria and focus that fills your mind with creative thought and motivation. As your focus and mental capacity grows, your body will start to relax, erasing any aches and pains without weighing you down in the slightest. These effects can quickly become overwhelming for those who suffer from anxiety or paranoia, so user beware! Thanks to its high THC level and these daytime effects, Baby Jesus OG is said to be perfect for treating chronic fatigue, depression, bipolarity, and migraines or headaches. Baby Jesus OG has a sweet lemony pine flavor and an aroma to match that is slightly spicy and pungent. Baby Jesus OG buds have tiny grape-shaped olive green nugs that are completely coated in tiny dusty white crystal trichomes.", "effects": ["Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Earthy", "Lemon", "Pine", "Sweet", "Woody"], "flavors": ["Berry", "Lemon", "Sweet", "Tangy"], "relieves": ["Berry", "Lemon", "Sweet", "Tangy"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Baby Kay": {"url": "https://www.allbud.com/marijuana-strains/hybrid/baby-kay", "img": "https://media.allbud.com/resized/350x242/media/feature/strain/baby-kay.jpg?t=d341752f6077fd545af4d67a2a4d2f78c6183ea37bbef26d6fb95b3d77712f67", "name": "Baby Kay", "description": "Baby Kay is a super rare evenly balanced hybrid strain (50% indica/50% sativa) created with unknown parentage due to a high level of breeder secrecy about its background. Even with the lack of information about its background, this bud is highly sought after for its super relaxing effects that are perfect for killing any stresses or anxieties that are plaguing your mind. The Baby Kay high starts with a rush of cerebral effects that seem to trickle in before suddenly slamming into your brain. You’ll feel totally lifted and euphoric with a hint of focus and motivation. An influx of creative energy comes next, squashing any remaining negative or racing thoughts. As your mind starts to fade into oblivion, your body will begin to drift away into a state of complete relaxation and calm. You won’t feel sedated in this state, rather you’ll be completely at ease. Thanks to these totally relaxing effects and is moderate 9-14% average THC level, Baby Kay is often recommended for all levels of users suffering from conditions such as chronic stress or anxiety, depression, insomnia, and chronic pain. This bud has a sweet herbal flavor to it with a hint of woodiness upon exhale. The aroma is very earthy and flowery with a rich herbal overtone and a touch of woods. Baby Kay buds have heavy spade-shaped neon green nugs with bright orange hairs and a coating of amber crystal trichomes.", "effects": ["Relaxing", "Uplifting"], "aromas": ["Earthy", "Floral", "Skunky", "Spicy"], "flavors": ["Herbal", "Sweet"], "relieves": ["Herbal", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Baby Stewie": {"url": "https://www.allbud.com/marijuana-strains/hybrid/baby-stewie", "img": "https://media.allbud.com/resized/350x242/media/images/strain/baby-stewie/tHq8dmLI/15186807306791631291339jpg.jpg?t=cf18b19eb46ea9dad29afabae41260254e32f3ef593d42faaad2cfd5239dccf9", "name": "Baby Stewie", "description": "Baby Stewie is an evenly balanced hybrid (50% indica/50% sativa) strain created through a special cross of the infamous OG Kush X Blue Dream. Although this bud has many siblings per say, Baby Stewie is definitely one bud that you should try at least once in your life. The high is very well balanced and uplifting in nature with full-bodied effects that leave you feeling relaxed and completely at ease. It starts with an uplifted mood boost that leaves you feeling happy with a sense of hazy introspection that numbs your mind but still leaves you functional if need be. A body buzz comes next, washing over you with relaxing lazy waves that leave you feeling completely at ease although not weighed down in the slightest. Because of these effects and its insanely powerful 24-26% average THC level, Baby Stewie is a great choice for the experienced patient suffering from conditions such as chronic pain, muscle spasms, depression, and chronic stress or anxiety. This bud has a sweet berry kush aroma with hints of grassy herbs and spices. The flavor is of sweet blueberries with a hint of creamy vanilla and an overtone of fresh herbs and kush. Baby Stewie buds have lumpy long pepper-shaped bright green nugs with surprisingly vibrant blue undertones, clear crystal trichomes, and random clear hairs spattered throughout.", "effects": ["Body High", "Cerebral", "Relaxing", "Uplifting"], "aromas": ["Berry", "Earthy", "Grassy", "Herbal", "Kush", "Spicy"], "flavors": ["Berry", "Blueberry", "Herbal", "Spicy"], "relieves": ["Berry", "Blueberry", "Herbal", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "BackBeat OG": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/backbeat-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/backbeat-og/P7K5S72n/15-cjpg.jpg?t=802618b91a3889407b8634434ccf3c69a688c668a0fec8870c7dfbbcf07481b8", "name": "BackBeat OG", "description": "BackBeat OG, also known as “Backbeat” or “Back Beat OG,” is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the potent Starfighter X Chuckles OG strains. This bud is perfect for when you want your body to relax but still want your mind to stay sharp, with full-bodied effects that will lift the spirits and erase aches and pains in no time flat. The high starts with a slow build of effects, starting with a light tingle in the spine and the limbs that soon spreads throughout the rest of your body in warming waves. Your body will soon begin to settle into a deeply relaxed state that's slightly sedative without causing too much couchlock. As your physical form settles, your mind will begin to lift into a high-flying state of pure happiness that's accompanied by a light boost in energy and creativity. In combination with its super high 25-30% average THC level, these effects make BackBeat OG perfect for treating those suffering from conditions such as depression, chronic fatigue, nausea or appetite loss, cramps or muscle spasms and chronic stress. This bud has a lightly spicy citrusy diesel flavor. The aroma is of pungent earth and diesel with a sharp kick of sour citrus and peppery spices. BackBeat OG buds have small rounded minty green nugs with olive undertones, dark orange hairs and a coating of frosty clear crystal trichomes.", "effects": ["Body High", "Cerebral", "Creative", "Energizing", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Citrus", "Diesel", "Earthy", "Pungent", "Sour", "Spicy"], "flavors": ["Citrus", "Diesel", "Herbal", "Sour", "Spicy"], "relieves": ["Citrus", "Diesel", "Herbal", "Sour", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Badazz Cheese": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/badazz-cheese", "img": "https://media.allbud.com/resized/350x242/media/images/strain/badazz-cheese/iVz9JxXi/big-buddha-cheese-2jpg.jpg?t=816e129a0d333d2871715b96f6471b3915540bee2dfcb2fee6341a296724c17f", "name": "Badazz Cheese", "description": "Badazz Cheese is a rare heavily indica dominant hybrid strain (90% indica/10% sativa) created through crossing the iconic Badazz OG Kush X Big Buddha Cheese strains. If you're a fan of a deliciously cheesy flavor, look no further – Badazz Cheese has everything that you need and so much more. This tasty lady packs a sweet and spicy herbal cheese flavor into each and every toke, with a light mouthful of pine upon exhale, too. The aroma is very similar, with an earthy spicy overtone that's very herbal and kushy. The Badazz Cheese high comes creeping in a few minutes after your first toke, sneaking into your brain before spreading throughout the rest of your body. You'll feel euphoric and lifted mentally while your body fades away into a deep relaxation and sense of calm that lasts for hours and hours on end before taking a sedative and sleepy turn. Thanks to these effects and its high 19-20% average THC level, Badazz Cheese is often chosen to treat those suffering from conditions such as insomnia, chronic pain, inflammation, cramps or muscle spasms and appetite loss or nausea. This bud has small conical fluffy bright neon green nugs with thin orange hairs and a coating of tiny frosty white crystal trichomes.", "effects": ["Body High", "Euphoria", "Happy", "Relaxing"], "aromas": ["Earthy", "Herbal", "Pine", "Spicy", "Woody"], "flavors": ["Herbal", "Spicy", "Woody"], "relieves": ["Herbal", "Spicy", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bad Boy": {"url": "https://www.allbud.com/marijuana-strains/hybrid/bad-boy", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bad-boy/5851/rqgq4jcssctje5dj8nng.jpg?t=4917e22904d37b73551f0b2dec36f9c247f71ae0713492a2d3b481dcb2b0cdaa", "name": "Bad Boy", "description": "Bad Boy is an evenly balanced hybrid (50% indica/50% sativa) strain created through crossing the infamous Gorilla Glue X Mt. Rainier strains. With a name like Bad Boy, you know this bud's going be good. Bad Boy is one bud that has an infamous high for all the right reasons – just a few hits of this troublemaker and you'll find yourself aroused beyond all reason with a heavy dose of energy to back it up. The high starts with a hyper-aware mood boost that leaves you energetic and happy with a building sense of motivation. As this head high builds, a tingly body buzz will wash over you, leaving you completely aroused with a slight pang of hunger. In combination with its high 20-21% average THC level, these effects give Bad Boy an edge in treating conditions such as chronic fatigue, depression, chronic pain, and stress. Bad Boy buds have long pepper-shaped forest green nugs with gold hairs and a light spattering of chunky gold crystal trichomes. The flavor is super spicy and pungent with a chocolate diesel overtone accented by sweet earth and kush. The aroma is very potent with a pungent spicy earth overtone accented by chemicals and diesel and topped with a heavy dose of sharp citrus.", "effects": ["Aroused", "Body High", "Hungry"], "aromas": ["Chemical", "Chocolate", "Citrus", "Diesel", "Earthy", "Pungent"], "flavors": ["Chocolate", "Citrus", "Spicy"], "relieves": ["Chocolate", "Citrus", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Baglung Nepalese": {"url": "https://www.allbud.com/marijuana-strains/sativa/baglung-nepalese", "img": "https://media.allbud.com/resized/350x242/media/images/strain/baglung-nepalese/sSHV6NAI/27jpg.jpg?t=ee37027438846b7eff7f2f13f753fb2a22693e1a2aa440fb5c55cb8caff6c42c", "name": "Baglung Nepalese", "description": "Baglung Nepalese is a 100% pure sativa strain that is a landrace native to the Baglung Nepali regions. Perfect for any lover of high-flying sativas, Baglung Nepalese packs a lifted and euphoric high that will fill the body with energy while helping to relax the mind. It starts almost as soon as you exhale, beginning with a happy boost of the spirits. You’ll feel any bad moods or racing thoughts get washed away almost immediately, replaced with a sense of tranquil happiness and ease. This is accompanied by an energizing physical high that fills your limbs with happy energy that gets you up and moving, no matter how lazy you feel. In combination with its moderate 12-14% average THC level, these effects give Baglung Nepalese an edge in treating conditions such as chronic fatigue, depression, chronic stress or anxiety and headaches or migraines. This bud has a sweet and fruity bubblegum flavor with a sugary strawberry candy exhale. The aroma is very similar, with a fruity overtone that’s accented by sweet and sour candy and berries. Baglung Nepalese buds have fluffy rounded emerald green nugs with pink and purple undertones, vivid pinkish-orange hairs and a coating of pink-tinted white crystal trichomes.", "effects": ["Euphoria", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Berry", "Fruity", "Spicy"], "flavors": ["Berry", "Candy", "Fruity", "Strawberry", "Sweet"], "relieves": ["Berry", "Candy", "Fruity", "Strawberry", "Sweet"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bahia Black Head": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bahia-black-head", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bahia-black-head/3384/edmpczpp0z9gdt5u3aif.jpg?t=6a22123f0d02349d632341a325af6ebcbf0f4dbd6192002905a4b45aee963c01", "name": "Bahia Black Head", "description": "Bahia Black Head is an indica dominant hybrid (70% indica/30% sativa) strain created as a potent cross between the relatively unknown Pure Brazil X KC 606 strains. This dank bud boasts a moderate THC level that ranges from 14-17% and a myriad of both indica and sativa effects. Users describe the Bahia Black Head high as having an immediate uplifting cerebral head high that leaves you euphoric with a sensation that you are floating on air. This is accompanied by a heavy case of the giggles and very social tendencies. The cerebral high fades into a long-lasting body high that leaves you utterly relaxed and completely couch-locked with an overpowering sense of sedation and a slight case of the munchies. Due to these potent effects, Bahia Black Head is said to be an ideal strain for treating patients suffering from conditions such as chronic stress or anxiety, mild to moderate cases of depression, and pain due to injury or illness. This bud has an overpoweringly strong aroma of harsh pungent hash and a strong hashy taste with a hint of earth. Bahia Black Head buds have medium-sized dense spade-shaped dark olive green nugs with dark purple undertones and hairs and a frosty layer of crystal white trichomes.", "effects": ["Cerebral", "Euphoria", "Giggly"], "aromas": ["Hash", "Pungent"], "flavors": ["Hash", "Spicy"], "relieves": ["Hash", "Spicy"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Baker's Delight": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bakers-delight", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bakers-delight/HPZHocmn/bakers-delightjpg.jpg?t=06f971219aac3ad584ceb90d594510bb72ea6b3ffe7cbed72d83935c04fd0beb", "name": "Baker's Delight", "description": "Baker's Delight is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the delicious The Cookies X Sorbet strains. This delicious indica is ideal for any patient who's after a super warming and relaxing high that will help them kick back and get to sleep, almost like a weighted blanket. The high comes on with a slowly building effect, creeping into your body with light tingly and warming waves that wash away any aches or pains, leaving you feeling physically relaxed and calmed from head to toe. As your body settles into this state of tranquility, your mind will sharpen, filling you with a sense of lifted focus and a touch of mental energy. Given these effects and its super high 20-21% average THC level, Baker's Delight is often chosen to treat those suffering from conditions such as depression, chronic stress or anxiety, ADD or ADHD, chronic fatigue and chronic pain. This bud has a mouthwatering sweet and fruity creamy candy flavor with hints of ripe berries and lemon upon exhale. The aroma is very similar, with a sour citrus overtone that's accented by lightly sweet fruits and herbs. Baker's Delight buds have fat and airy rounded blue-green nugs with purple undertones, orange hairs and a coating of matching chunky purple-white crystal trichomes.", "effects": ["Calming", "Focus", "Happy", "Relaxing", "Uplifting"], "aromas": ["Blueberry", "Citrus", "Lemon", "Orange", "Sour"], "flavors": ["Candy", "Citrus", "Creamy", "Fruity", "Sour", "Sweet"], "relieves": ["Candy", "Citrus", "Creamy", "Fruity", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Balance": {"url": "https://www.allbud.com/marijuana-strains/hybrid/balance", "img": "https://media.allbud.com/resized/350x242/media/images/strain/balance/gFRfUfyW/90jpg.jpg?t=6ddb00efbae7b1b75bc50ef4661d28919198c151f23264c92d9571ceb9567463", "name": "Balance", "description": "Balance is an evenly balanced hybrid strain (50% indica/50% sativa) created through an unknown combination of hybrid strains. Named for its super well-balanced high, Balance brings on potent medicinal effects that hit both mind and body and then linger for hours on end. You'll feel lifted with a sense of happiness and calm that permeates your entire being, leaving no additional room for negative thoughts or aches and pains. Your mind will feel lifted while your body relaxes into a state of pure physical relaxation and calm. These effects can turn sleepy at times, so mind your dosage if you have things to get done. In combination with its low 6-7% THC level and super high 15-16% average CBD level, these effects make Balance perfect for treating those suffering from conditions such as inflammation, spasticity, chronic pain, inflammation and chronic stress or PTSD. Balance has a sour citrusy lemon flavor with a lightly earthy exhale. The aroma is of earthy herbs and sour citrus with a spicy touch to it. Balance buds have grape-shaped bright neon green nugs with lots of thin orange hairs and a coating of frosty tiny golden amber crystal trichomes.", "effects": ["Body High", "Calming", "Happy", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Sour", "Spicy"], "flavors": ["Citrus", "Lemon", "Sour", "Spicy"], "relieves": ["Citrus", "Lemon", "Sour", "Spicy"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Bali Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/bali-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/bali-kush/lpYs84fl/bali-kushjpg.jpg?t=e3296a87b89e8d2c3ffb4d3bb92c71fa789a3398812cd57951df4131723ae17c", "name": "Bali Kush", "description": "Bali Kush is a rare indica dominant hybrid strain (70% indica/30% sativa) created through crossing the infamous Black Afghani X Bubba Kush strains. Looking for a vacation from life's daily stresses? You've found it with Bali Kush. This bud packs a super relaxing high that will take you on a calming journey from uplifting start to sedative finish. The high starts with a lifted feeling that fills your mind with an almost giddy, unfocused euphoria, easing away any negative feelings almost instantly. You'll feel a relaxing body high wash over you next, lulling you into a state of physical calm without causing couch lock. This quickly turns sedative, leaving you dozing off into a long and peaceful sleep. With these effects and its high 18-22% average THC level, Bali Kush is said to be perfect for treating conditions such as insomnia, appetite loss, depression, chronic stress, and chronic fatigue. This bud has faded olive green nugs with deep purple undertones, bright amber hairs, and a coating of matching crystal trichomes. As you pull apart each sparkling nugget, aromas of fresh sweet pine and spicy earth are released. The flavor follows the same profile, with a heavily sweet overtone that lingers long after your final toke.", "effects": ["Euphoria", "Happy", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Earthy", "Herbal", "Pine", "Spicy", "Woody"], "flavors": ["Herbal", "Pine", "Spicy", "Sweet", "Woody"], "relieves": ["Herbal", "Pine", "Spicy", "Sweet", "Woody"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Berry Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-berry-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-berry-kush/7889/lfnyn2gvq6dl0bpsemfl.jpg?t=5a6289a39a505136abcb9189c9cc203c7affc29729df01bb97570e19dbb49634", "name": "Banana Berry Kush", "description": "Banana Berry Kush is an indica dominant hybrid strain created through crossing the delicious White Berry X Banana Kush strains. This rare bud has an addictive sweet banana berry flavor and effects that are perfect for any kush lover. The smell of Banana Berry Kush is much like its flavor, although it does have a super pungent kushy skunk overtone that can fill a room with its potent stench. Almost as soon as you exhale, a sense of hazy euphoria will launch your mind into complete happiness, immediately erasing any negative or racing thoughts and leaving you in a state of blissful spaciness. As your mind lifts higher and higher, a moderate body high will slowly wash over you, lulling you into a state of complete relaxation with a touch of couch-lock. These effects are long-lasting and slightly sedative in nature, which can cause some users to fall asleep. In combination with its high 18-19% average THC level, these effects give Banana Berry Kush an edge in treating conditions such as chronic pain, depression, insomnia, and chronic fatigue. Banana Berry Kush buds have fluffy dusty green round nugs with long thin dark orange hairs and a coating of sweet sticky resin.", "effects": ["Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Earthy", "Kush", "Skunky"], "flavors": ["Berry", "Sweet"], "relieves": ["Berry", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Bread": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-bread", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-bread/NFAzC58m/44-cjpg.jpg?t=7ee1a9cff6ced11366a88dd5f45560dce1e27f30a400a392e93c22acddd8bf3d", "name": "Banana Bread", "description": "Banana Bread is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the delicious Purple Kush X Vietnamese Black strains. Named for its super delicious flavor, Banana Bread brings on a taste that is notably like its name – a fresh batch of nutty banana bread! The aroma follows the same profile, although with a notable hint of berry and herbs to it, too. The Banana Bread high is just as delicious as the flavor, with long-lasting effects that are warming and tingly in nature, perfect for killing any physical aches or pains. You'll feel a lifted sense settle in a few minutes after your final toke, filling you with a happy euphoria and easing away negative or racing thoughts. As your mind settles, a light tingle will begin to wash over your physical form, lulling you into an arousing state of pure bliss and calm. In combination with its high 19-23% average THC level, these effects make Banana Bread perfect for treating conditions such as chronic pain, inflammation, depression, chronic stress or anxiety and chronic fatigue. This bud has thick spade-shaped bright neon green nugs with purple leaves, amber undertones and a thick frosty coating of tiny white crystal trichomes.", "effects": ["Aroused", "Body High", "Calming", "Relaxing", "Sociable", "Tingly", "Uplifting"], "aromas": ["Berry", "Earthy", "Fruity", "Herbal", "Spicy"], "flavors": ["Berry", "Fruity", "Nutty", "Sweet"], "relieves": ["Berry", "Fruity", "Nutty", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Bubba Gum": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-bubba-gum", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-bubba-gum/7871/jeulmursv28oy0pzh81h.jpg?t=f7c2e675b56681e433ec998fa5d49f73a413414cabf93cc48c54d3e6491d27ae", "name": "Banana Bubba Gum", "description": "Banana Bubba Gum is a rare indica dominant hybrid strain created through crossing the delicious Banana Kush with the potent Bubba Gum. This hard to find bud brings on the delicious flavors and potent effects, packing a 19-29% average THC level into each tasty little nug. Each delicious inhale brings flavors of sweet bubblegum and fruity kush that linger on you tongue long after you finish toking. The mellow aroma is very fruity and floral in nature, with a light touch of fresh sweet bubblegum that can be detected as the nugs are burned. Almost as soon as you exhale, your mind will be lifted into a state of pure euphoria that erases any negative or racing thoughts and leaves you feeling completely blissful. As these effects grow, you'll be infused with a sense of creativity and focus that won't leave you feeling anxious. Thanks to these relaxing effects and its high THC level, Banana Bubba Gum is said to be perfect for treating insomnia, depression, and chronic stress or anxiety. This bud has round forest green nugs with dark amber hairs and a frosty thick coating of tiny white crystal trichomes.", "effects": ["Creative", "Euphoria", "Happy", "Relaxing"], "aromas": ["Bubble Gum", "Floral", "Fruity"], "flavors": ["Berry", "Bubble Gum", "Sweet"], "relieves": ["Berry", "Bubble Gum", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Cheese": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-cheese", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-cheese/zDJW2OS7/91ccf791-1f0b-4d1c-936a-291ea892114fjpe.jpg?t=fff2006c5608cde69c647b9fd40108fcba88c3ab61e572eaa5ace2dc9eff4ae0", "name": "Banana Cheese", "description": "Banana Cheese is a slightly indica dominant hybrid strain (55% indica/45% sativa) created through crossing the delicious Banana Kush X Cheese strains. When it comes to truly unique flavors, Banana Cheese totally takes the cake. This bad boy brings on tastes of sweet bananas and herbal cheese with a sour and spicy overtone that lingers on the tip of the tongue. The aroma is earthy and pungent with a spicy cheese overtone that intensifies the more that you toke. The Banana Cheese high is certainly as unique as its flavor, with effects that hit both mind and body with a high level of potency and hang on for hours on end. It starts in the head with a potent cerebral melt, filling you with an unfocused stress-free happiness and easing away any negative or racing thoughts. A super strong and incredibly relaxing body high accompanies this cerebral melt, keeping you sedated and couch-locked for hours on end. With these effects and its moderate 13-16% average THC level, Banana Cheese is said to be perfect for treating those suffering from conditions such as mood swings or depression, chronic stress, insomnia and chronic pain. This bud has dense grape-shaped minty green nugs with thick orange hairs and a coating of frosty tiny golden amber crystal trichomes.", "effects": ["Body High", "Cerebral", "Relaxing", "Sleepy"], "aromas": ["Cheese", "Fruity", "Herbal", "Pungent", "Sour", "Spicy"], "flavors": ["Fruity", "Sweet"], "relieves": ["Fruity", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Clips": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-clips", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-clips/ne8952B0/c-14jpg.jpg?t=2197748db49859e2c3ebb98b9e25d904cf37436c1756ef318b597872a132bd20", "name": "Banana Clips", "description": "Banana Clips is an indica dominant hybrid strain (80% indica/20% sativa) created through crossing the classic Strawberry Banana X Grizzly Purple Kush strains. Known for its super delicious flavor and high level of potency, Banana Clips is the perfect bud for any indica lover who appreciates a great taste, too. Like its name suggests, Banana Clips has a sweet banana flavor with accents of fruity bubblegum and flowery spices. The aroma is just as delicious, although with a notable hashy pepper overtone that sweetens the more that you toke. The Banana Clips high isn't quite as bright as the flavor, with relaxing effects that are best-suited for a lazy night spent at home when you don't have much of anything else to do. You'll feel a euphoric boost accented by touches of creativity and a tingly feeling that leaves you feeling giddy and giggly. As your mind lifts to new heights of hazy happiness, a relaxing body high will wash over you, lulling you into a hungry and couch-locked state for hours on end. With these effects and its super high 21% + average THC level, Banana Clips is often said to be perfect for treating conditions such as chronic pain, muscle spasms or cramps, insomnia, chronic stress and depression. This bud has fluffy rounded forest green nugs with sparse thin orange hairs and a coating of frosty tiny milky white crystal trichomes.", "effects": ["Body High", "Cerebral", "Creative", "Giggly", "Hungry", "Tingly"], "aromas": ["Bubble Gum", "Earthy", "Flowery", "Fruity", "Sweet"], "flavors": ["Bubble Gum", "Fruity", "Grape", "Spicy", "Sweet"], "relieves": ["Bubble Gum", "Fruity", "Grape", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Cream": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-cream", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-cream/hSllXWPa/20181229_121021jpg.jpg?t=7e4fbb443db840561c4f943947e6f204ed3205f56729f5ec99db1ffc66630785", "name": "Banana Cream", "description": "Banana Cream is an indica dominant hybrid strain created through crossing the insanely delicious Banana OG X Cookies and Cream strains. This bud is infamous among users for its insanely delicious flavor – it actually tastes like a banana cream pie! The aroma is just as intoxicating, with hints of sweet earth accented by fresh bananas and cream. The high comes on with a creeping effect a few minutes after you toke, filling you with a lifted sense of euphoria that leaves you tingly and giggly. As these effects grow, you'll start to feel a building sense of relaxation that fills both mind and body, lulling you into a slightly sedative state that won't weigh you down if you decide to get up and get moving. These effects in combination with its THC level that is said to be moderately high give Banana Cream an edge in treating conditions such as chronic pain, depression, muscle spasms or tremors, fatigue, and insomnia, among many other conditions. Banana Cream buds have piecey flat neon green nugs with gold undertones and matching crystal trichomes. Each nug is dotted with dark orange hairs coated in sweet sticky resin.", "effects": ["Body High", "Happy", "Relaxing", "Sociable"], "aromas": ["Earthy", "Nutty", "Sweet"], "flavors": ["Creamy", "Fruity", "Sweet"], "relieves": ["Creamy", "Fruity", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Cream Cake": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-cream-cake", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Banana Cream Cake", "description": "Banana Cream Cake is an indica dominant hybrid strain (70% indica/30% sativa) created through crossing the potent Banana Kush X Cheese Cake strains. Named for its super delicious flavor, Banana Cream Cake packs everything any indica lover dreams of and more into each tasty little toke. Like its name suggests, Banana Cream Cake has a super sweet and doughy creamy banana flavor with a lovely sugary exhale. The aroma is very similar, although it does have a touch of spicy earthiness to it, too, that's released as the nugs are burned away. The Banana Cream Cake high hits you almost as soon as you exhale, working its way immediately into your brain with lightning-fast energy and creativity. This quickly turns heady, leaving you hazy, unfocused and pretty happy about it. You'll find yourself fading in and out of giggly episodes, laughing at anything and everything around you. This is accompanied by a lightly stoney body high that keeps your physical form totally relaxed. Combined with its high 21-22% average THC level and 0-1% CBD level, these effects make Banana Cream Cake a great choice for treating chronic pain, depression, nausea or appetite loss, chronic stress or anxiety and chronic fatigue. This bud has thick grape-shaped minty green nugs with sparse thin orange hairs and a coating of tiny, amber-tinted white crystal trichomes.", "effects": ["Energizing", "Giggly", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Creamy", "Earthy", "Spicy", "Sweet"], "flavors": ["Creamy", "Fruity", "Sugary", "Sweet"], "relieves": ["Creamy", "Fruity", "Sugary", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Crush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-crush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-crush/hcdqa87q/03e65408-e095-449e-af3c-f5225188ff10jpe.jpg?t=f8f86e8b1f06e1e20755fc2aa1ddd0cc4e33e9c6e8d4d54fd145f15c4e178845", "name": "Banana Crush", "description": "Banana Crush is a rare slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the infamous Banana Kush X Orange Crush strains. Looking for the ultimate fruity banana flavor? You've totally found it with Banana Crush. This delicious bud packs a super tasty sweet fruity banana flavor with a slightly sour citrusy exhale. The aroma follows the same profile, with a lightly earthy overtone that's accented by sweet tropical fruits and spices. The Banana Crush high is just as delicious as the flavor, with well-balanced and long-lasting effects that are perfect for a lazy night in when you want to eventually get to sleep. You'll feel lifted at the onset of the high with a sense of euphoria and creativity washing over you. A relaxing body high comes next, creeping over you in warming waves with a light tingly effect that quickly turns sedative. Thanks to these effects and its high 22% average THC level, Banana Crush is said to be perfect for treating those suffering from conditions such as chronic pain, Bipolar Disorder, depression, headaches or migraines, insomnia, and chronic stress or PTSD. This bud has tight dense grape-shaped dark olive green nugs with lots of thin amber hairs and a frosty coating of tiny amber crystal trichomes.", "effects": ["Body High", "Creative", "Euphoria", "Happy", "Relaxing", "Sleepy"], "aromas": ["Citrus", "Earthy", "Herbal", "Sour", "Sweet", "Tropical"], "flavors": ["Citrus", "Fruity", "Sour", "Sweet", "Tropical"], "relieves": ["Citrus", "Fruity", "Sour", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Daddy": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-daddy", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-daddy/SvEyt19f/100-cjpg.jpg?t=34d65228aedb89a759cf0065c2804afe4db9194d5992d833bcdc7e39738dcbf3", "name": "Banana Daddy", "description": "Banana Daddy is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the infamous Granddaddy Purple X Banana Hammock strains. Best known for its notable banana flavor and super giddy high, Banana Daddy will have you head over heels after just one toke. Like its name suggests, Banana Daddy packs a sweet banana berry flavor that's accented by a touch of spicy bubblegum and diesel. The aroma takes a heavier turn, with deep diesel and sweet fruity berries all wrapped up with a spicy overtone. The Banana Daddy high hits you almost as soon as you exhale, smacking immediately between the eyes and knocking away any negative or racing thoughts. You'll feel giggly and lifted, unable to focus on much of anything but still able to carry on extended conversations with those around you with ease. With these effects and its super high 25-30% average THC level and 1-3% CBD level, Banana Daddy is often chosen to treat those suffering from conditions such as chronic stress, appetite loss or nausea, chronic fatigue, insomnia and chronic pain. This bud has oversized chunky purplish spade-shaped nugs with dark purple undertones, matching leaves and a coating of purple-tinted white crystal trichomes.", "effects": ["Body High", "Giggly", "Relaxing", "Sleepy", "Sociable", "Uplifting"], "aromas": ["Diesel", "Earthy", "Fruity", "Grape", "Spicy", "Sweet"], "flavors": ["Berry", "Flowery", "Fruity", "Grape", "Sweet"], "relieves": ["Berry", "Flowery", "Fruity", "Grape", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Fig": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-fig", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-fig/28nTLnH8/43jpg.jpg?t=bf89a1fa8d2fe1362614fed10cf0ecfbf69e8c03025b952ca0c082e3ebeb8c3d", "name": "Banana Fig", "description": "Banana Fig is an indica dominant hybrid strain created through crossing the delicious Purple Fig X Banana Split strains. Named for its parentage and its super delicious flavor, Banana Fig is perfect for any indica lover. In fact, it took home the award for Best Indica at the High Times Cannabis Cup in 2017. This bud has a super sweet banana and fig flavor with light touches of sour lemon upon exhale. The aroma is of earthy pine with a sour citrus overtone that's accented by a notable kick of sweet banana. The Banana Fig is just as delicious, with relaxing and lifting effects that boos the spirits while filling you with a sense of comfy happiness. You'll feel a calm wash over your entire being from head to toe, easing aches and pains will gently pushing away negative or racing thoughts. Combined with its super high 22-23% average THC level, Banana Fig is often chosen to treat conditions such as appetite loss or nausea, depression, chronic stress or anxiety, PTSD and chronic pain. This bud has oversized fluffy hand-shaped dusty green nugs with deep purple undertones, thin orange hairs and a coating of sandy amber crystal trichomes.", "effects": ["Calming", "Hungry", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Earthy", "Fruity", "Pine", "Sweet"], "flavors": ["Citrus", "Fruity", "Lemon", "Sour", "Sweet"], "relieves": ["Citrus", "Fruity", "Lemon", "Sour", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Fire Cookies": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-fire-cookies", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-fire-cookies/c43sjU5g/banana-fire-cookiesjpeg.jpg?t=2ba7d0ae731ce05cf76847cc74ae99e0d111724e0ff2e77ff87233af54a118ee", "name": "Banana Fire Cookies", "description": "Banana Fire Cookies is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic Banana Fire OG Kush X Fire Cookies strains. This celebrity child boasts a super heavy high that will have your mind feeling boosted and your body feeling rested in no time at all. You'll feel the cerebral effects hit you first as you're filled with a lifted sense of happy sociability and creativity. You'll find that conversations come easily in this state as you are filled with euphoric thought and artistic inspiration. A soothing body high accompanies this heady state, helping your physical form to stay anchored and relaxed. Thanks to these effects and its super high 20-25% average THC level, Banana Fire Cookies is often chosen to treat those suffering from conditions such as chronic pain, appetite loss or nausea, chronic stress or anxiety and cramps or muscle spasms. This bud has a sweet and fruity banana candy flavor with a nutty cookie exhale. The aroma is very similar, with a heavily banana overtone accented by sweet fruity cherries and a hint of nutty earthiness. Banana Fire Cookies buds have small rounded forest green nugs with thin orange hairs and tiny white crystal trichomes dripping with sweet sticky resin.", "effects": ["Calming", "Creative", "Happy", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Earthy", "Nutty", "Sour", "Sweet", "Tree Fruit"], "flavors": ["Candy", "Cherry", "Fruity", "Sweet", "Tree Fruit"], "relieves": ["Candy", "Cherry", "Fruity", "Sweet", "Tree Fruit"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Fire OG": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-fire-og", "img": "https://dddx9gs6zfr8i.cloudfront.net/static/images/infocard-default-hybrid.6b34d1350a1c.png", "name": "Banana Fire OG", "description": "Banana Fire OG, also known as “Banana Fire” or “Banana Fire OG Kush,” is a slightly indica dominant hybrid strain (65% indica/35% sativa) created through crossing the classic Banana OG X Fire OG BX2 strains. The perfect soothing indica, Banana Fire OG brings on effects that will burn away any aches or pains and leave you fully relaxed from head to toe. The high is definitely a creeper, sneaking up on you about 5-10 minutes after you exhale, lifting your mind and filling you with a sense of pure happiness and ease. Your mind will settle into a lightly unfocused state of calm that is free of any racing thoughts or negative emotions. A relaxing body high comes next, creeping up on you and leaving you feeling fully couch-locked and ready to really relax and get to sleep. In combination with its high 15-23% average THC level, these effects make Banana Fire OG perfect for treating chronic pain, insomnia, depression or mood swings and chronic stress. Banana Fire OG has a spicy and sour sugary citrus candy flavor that tingles on the tongue and opens the sinuses. The aroma is of earthy tropical fruits with a super sour effect that intensifies as the nugs are burned away. Banana Fire OG buds have fat dense popcorn-shaped emerald green nugs with blue undertones, reddish-orange hairs and a coating of tiny frosty white crystal trichomes.", "effects": ["Euphoria", "Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Fruity", "Sweet", "Tropical"], "flavors": ["Citrus", "Sour", "Sugary", "Sweet", "Tropical"], "relieves": ["Citrus", "Sour", "Sugary", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Frost Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-frost", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-frost/5852/rpzy0skmgaazxzwmmkvc.jpg?t=58cbde2bfc793b736533fb0224a31d114b5e64d9898f5106cf627e862bf566da", "name": "Banana Frost Kush", "description": "Banana Frost Kush is a mellow indica-dominant hybrid (75% indica/25% sativa) that boasts a THC level ranging from 12-15% on average. This dank bud has unknown genetics, as its breeders mysteriously keep it a secret. However, many cannabis critics believe that it is a phenotype of the infamous Banana OG Kush strain and, perhaps, a little mix of the popular Jack Frost strain. Banana Frost Kush has a slight pleasant banana aroma and flavor that is often compared to smoking a dried sugar coated banana peel. When smoking this bud, patients describe the high as a mellow introspective one that gives you a full-body stoned feeling and intense couch lock. This stoned feeling is often accompanied by a mellow buzz, typical of a sativa and sativa-dominant hybrid strain. The high is very potent, lasting 2-3 hours on average, and is very balanced, making it ideal for steady pain relief. Because of this, Banana Frost Kush is often used to treat chronic pain and muscle spasms, as it relaxes the entire body. This bud has fluffy, light minty green nugs that are very dense and completely frosted in glittering white crystals and dripping in sweet, syrupy resin.", "effects": ["Body High", "Relaxing", "Sleepy"], "aromas": ["Banana", "Fruity", "Sweet"], "flavors": ["Fruity", "Nutty", "Sugary", "Sweet"], "relieves": ["Fruity", "Nutty", "Sugary", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana God": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-god", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-god/E4Lns3uy/banana-godjpg.jpg?t=41fa8d95897cb7f03866bcc01e83d8b7b47819f411fa33091cfc668815117654", "name": "Banana God", "description": "Banana God is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the delicious Banana Kush X God's Gift strains. If you're a fan of either of its parent strains, Banana God is going to be right up your alley. This bud packs a super delicious banana flavor with a long-lasting high that will leave you totally kicked back and at ease for hours on end. You'll feel a light lift at the onset of the high as well as an influx of sociability that has you chatting with anyone and everyone around you. As your mind lifts, your body will settle into a deep physical relaxation that won't cause sedation, but rather will leave you totally calm. With these effects and its high 17-23% average THC level, Banana God is often chosen to treat those suffering from conditions such as mood swings, chronic stress, depression, chronic fatigue, ADD or ADHD, and chronic pain. Banana God buds have a sweet tropical pineapple flavor with a hint of sour citrus and fresh banana. The aroma is very herbal and tropical with a banana citrus overtone that's accented by earthy pine and spices. Banana God buds have piecey rounded light green nugs with thin long orange hairs and a coating of frosty tiny bright white crystal trichomes.", "effects": ["Creative", "Focus", "Relaxing", "Sociable"], "aromas": ["Citrus", "Herbal", "Pine", "Sour", "Sweet", "Tropical"], "flavors": ["Citrus", "Pine", "Sour", "Sweet", "Tropical"], "relieves": ["Citrus", "Pine", "Sour", "Sweet", "Tropical"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Hammock": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-hammock", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-hammock/4FbVumzb/15886303668364942753844647178931jpg.jpg?t=0ad92e937171feae32b2733f26c78e638e92e6641ba0fe3376bedba01783d2d3", "name": "Banana Hammock", "description": "Banana Hammock, also known as “Banana Hammock R1,” is a rare indica dominant hybrid strain created through crossing the infamous Grape God X Mandarin Sunset strains. Funny name aside, Banana Hammock is a patient favorite thanks to its super delicious flavor and happy effects. This bud has as sweet and sugary honey taste with accents of tropical fruits and sour lime. The aroma is just as delightful, following the same profile with added touches of fresh earth. The Banana Hammock settles in soon after your final toke, hitting the mind first before spreading its tingly sense of calm throughout the body. You'll feel lifted and relaxed with a sense of euphoria that immediately erases any negative or racing thoughts. A soothing body high comes next, settling you into a state of pure physical calm and ease. With these effects and its super high 22-27% average THC level, Banana Hammock is often recommended for experienced patients suffering from conditions such as insomnia, chronic stress or anxiety and depression or mood swings. This bud has super thick elongated pepper-shaped deep olive green nugs with rich purple undertones, bright orange hairs and a coating of thick and chunky frosty white crystal trichomes.", "effects": ["Body High", "Calming", "Euphoria", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Diesel", "Earthy", "Fruity", "Sour"], "flavors": ["Grape", "Honey", "Sugary", "Sweet", "Tropical"], "relieves": ["Grape", "Honey", "Sugary", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Haze": {"url": "https://www.allbud.com/marijuana-strains/sativa/banana-haze", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-haze/KKKisqJL/16547172227817693144674987391558jpg.jpg?t=efca6ccffe16bc0d1d68150b51bee6d20da1563d3836fad4da4de8f03ed47972", "name": "Banana Haze", "description": "Banana Haze is a rare 100% pure sativa strain created through crossing the infamous Super Silver Haze X Banana strains. This delicious celebrity child packs a mouthwatering flavor and a super hazy high into each and every toke, making it perfect for any sativa lover who appreciates a good haze. The high starts with a subtle lift in the back of the mind, filling you with a sense of happiness and ease that immediately ushers out any negative or racing thoughts. A subtle tingle comes next, filling the back of your head before spreading its reach throughout your entire body, leaving you feeling amped up and energized although totally relaxed physically. With these full-bodied effects and its high 20-22% average THC level, Banana Haze is said to be the perfect choice for treating those with inflammation, chronic pain, gastrointestinal disorders, and appetite loss. This bud has a super sweet and fruity flavor with a touch of haze and an overpowering mouthful of banana. The aroma is of earthy bananas and spicy haze with a light pungency to it, too. Banana Haze buds have small and dense cone-shaped bright neon green nugs with sparse orange hairs and a thick coating of frosty bright white crystal trichomes.", "effects": ["Body High", "Energizing", "Hungry", "Relaxing", "Tingly", "Uplifting"], "aromas": ["Earthy", "Fruity", "Herbal", "Spicy", "Sweet"], "flavors": ["Fruity", "Herbal", "Spicy", "Sweet"], "relieves": ["Fruity", "Herbal", "Spicy", "Sweet"], "type": "Sativa", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Kola": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/banana-kola", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-kola/7Z95B8An/banana-kolajpg.jpg?t=6dc209666a7091b22d59d0b74672d9a9f166ef07dddc6335d78bdc7555c82e7d", "name": "Banana Kola", "description": "Banana Kola is a super rare sativa dominant hybrid strain created through a powerful cross of (Kandahar Province Landrace Afghani X Takhar Province Landrace Afghani) X Cherry Kola. When it comes to delicious banana flavors, nothing beats Banana Kola. This bud has a mouthwatering taste of rich bananas and sweet cherries with a fruity spicy overtone that has a touch of herbs upon exhale. The aroma is of fresh fruity earth and spices with a notable punch of ripe banana and berries. The Banana Kola high is just as delicious as the flavor, with lifted and clear-headed effects that are perfect for those days when you need a little extra oomph to get you up off the couch and fully moving. You'll feel lifted with a sense of clarity and euphoria that doesn't cause anxiety or paranoia in the slightest. Thanks to these effects and its high 22-23% average THC level, Banana Kola is often chosen to treat those suffering from conditions such as depression, chronic stress, migraines or headaches, chronic fatigue, and mood swings. This bud has super sticky dense and lumpy popcorn-shaped forest green nugs with bright yellow-green undertones, vibrant orange hairs, and a coating of sparkling golden crystal trichomes.", "effects": ["Cerebral", "Euphoria", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Cherry", "Earthy", "Fruity", "Herbal", "Pungent"], "flavors": ["Cherry", "Fruity", "Herbal", "Spicy", "Sweet"], "relieves": ["Cherry", "Fruity", "Herbal", "Spicy", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana MAC": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-mac", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-mac/l0Jc8EOk/20211116_202812jpg.jpg?t=07a6e2fd647bdde40ceba191e9f0fe28734c0918b1b90792f0a0862f4a910039", "name": "Banana MAC", "description": "Banana MAC, also known as “BananaMiracle Alien Cookies,” is a slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the delicious Banana Kush X Miracle Alien Cookies (MAC) strains. When it comes to flavor, this bud's name says it all. Banana MAC packs a sweet nutty banana cookie flavor with a rich tropical nutty exhale. The aroma is just as delicious, with a sweet banana overtone that's accented by nutty herbs and spices. The Banana MAC high isn't quite as bright as the flavor, with relaxing effects that are best suited for an evening spent at home rather than out and about. You'll feel the high build slowly, filling you with a growing happiness that slowly pushes out any negative or racing thoughts with ease. As your mind reaches new heights of happy creativity, a sense of calm will spread throughout your physical form, anchoring you to the couch and leaving you fully immovable for hours on end. With these long-lasting effects and its high 22-26% average THC level, Banana MAC is often chosen to treat those suffering from conditions such as insomnia, mood swings, depression, chronic stress, nausea or appetite loss and chronic pain. This bud has spade-shaped long blueish-green nugs with dark leaves, yellow-orange hairs and a coating of frosty tiny golden amber crystal trichomes.", "effects": ["Calming", "Happy", "Hungry", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Citrus", "Earthy", "Nutty", "Pineapple", "Sour", "Tropical"], "flavors": ["Citrus", "Fruity", "Pineapple", "Sour", "Sweet", "Tropical"], "relieves": ["Citrus", "Fruity", "Pineapple", "Sour", "Sweet", "Tropical"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Milkshake OG": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-milkshake-og", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-milkshake-og/Pi9G8LG5/strawbeey-diseljpeg.jpg?t=90232283dd28b5375f8a3ad90ef088df2535a7f4e31532e94e3e9450798aad66", "name": "Banana Milkshake OG", "description": "Banana Milkshake OG, also known as “Banana Milkshake OG Kush,” is an evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the delicious [(Banana OG X Cherry Pie) X Strawberry Diesel] X Predator OG strains. When it comes to the flavor of this lovely lady, the name says it all. Banana Milkshake OG packs a sweet and fruity banana berry flavor with a creamy vanilla cherry exhale. The aroma is very similar, with an intoxicating creamy banana overtone accented by fresh berries, earthy woods and sugary vanilla. The Banana Milkshake OG high is one for the ages, with a unique combination of energizing cerebral effects and sedative physical effects. Your mind will feel activated from start to finish with this bud, filled with a sense of creative energy and focus that gets your mental gears turning in no time at all. While your mind clears, your body will settle into a heavy and hazy state of sedation that's filled with deep relaxation and an eventual case of couchlock. Thanks to these effects and its high 20% + average THC level, Banana Milkshake OG is often chosen to treat those patients who are suffering from conditions such as chronic pain, inflammation, depression or mood swings and chronic stress. This bud has dense and tight spade-shaped olive green nugs with deep purple undertones, dark orange hairs and tiny amber crystal trichomes.", "effects": ["Body High", "Calming", "Creative", "Energizing", "Giggly", "Happy", "Relaxing", "Uplifting"], "aromas": ["Cherry", "Creamy", "Earthy", "Pine", "Strawberry", "Sweet", "Vanilla", "Woody"], "flavors": ["Berry", "Cherry", "Creamy", "Fruity", "Sweet", "Vanilla", "Woody"], "relieves": ["Berry", "Cherry", "Creamy", "Fruity", "Sweet", "Vanilla", "Woody"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Mochi": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-mochi", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-mochi/tAol7TLj/92-cjpg.jpg?t=f829611e5b9ace6ab4c77e2a9d344afa2b3286f0791ebe93eb8311ffbf5ab23c", "name": "Banana Mochi", "description": "Banana Mochi is a rare slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the delicious Banana Kush X Mochi strains. Love a great banana flavor in your buds? This strain is made for you - Banana Mochi packs a super sweet and slightly nutty banana flavor with hints of berries to it, too. The aroma is just as delicious, with a slightly sour earthy effect that's released as the nugs are broken apart and burned away. The Banana Mochi high has a creeping effect, slowly building before taking you by surprise. You'll feel a light tingle in the back of the head and neck that soon spreads throughout the rest of your mind, leaving you feeling undeniably euphoric with a high-flying effect. You'll feel an influx of creativity come next, lending itself well to conversation with those around you. A deeply relaxing physical high comes next, dropping you into a state of pure sedation that can leave you dozing before you know it. With these effects and its super high 22%+ average THC level, Banana Mochi is often chosen to treat conditions such as chronic pain, depression, insomnia, chronic stress and nausea or appetite loss. Banana Mochi buds have fat small rounded forest green nugs with yellow-orange hairs and a coating of tiny blue-green white tinted crystal trichomes.", "effects": ["Creative", "Euphoria", "Hungry", "Relaxing", "Sleepy", "Tingly"], "aromas": ["Berry", "Earthy", "Nutty", "Sour", "Spicy", "Sweet"], "flavors": ["Berry", "Fruity", "Nutty", "Sweet"], "relieves": ["Berry", "Fruity", "Nutty", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Pie": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-pie", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-pie/CWg6bJL1/15601447422712074678312798285641jpg.jpg?t=5424895b2828f92e87c4e31b9e145a0b55bf4a806f6fed96a58b95fa1b3c57f0", "name": "Banana Pie", "description": "Banana Pie is a rare indica dominant hybrid strain (75% indica/25% sativa) created through crossing the classic Banana Kush X Cherry Pie strains. When it comes to the flavor department, this bud takes the cake (or pie). Banana Pie packs a sweet cherry berry flavor with hints of fresh bananas and nuttiness upon exhale. The aroma is much like a spicy banana muffin, with hints of pungent earth and spices as the nugs are burned. The Banana Pie high is very lifted and relaxing in nature, perfect for those nights when you just want to kick back with friends and not have a care in the world. The high starts with a euphoric lift that fills your mind with a sense of happiness and an eagerness to engage in conversation with those around you. You'll feel totally relaxed throughout the duration of the high and slightly giggly at times. With these effects and its high 14-26% average THC level, Banana Pie is said to be perfect for treating conditions such as depression, chronic stress, migraines or headaches, chronic fatigue, and nausea or appetite loss. This bud has fluffy airy bright neon green nugs with dark amber hairs and coating of frosty golden amber crystal trichomes.", "effects": ["Euphoria", "Giggly", "Relaxing", "Sociable", "Uplifting"], "aromas": ["Berry", "Earthy", "Fruity", "Herbal", "Pungent", "Spicy"], "flavors": ["Berry", "Cherry", "Fruity", "Herbal", "Spicy", "Sweet"], "relieves": ["Berry", "Cherry", "Fruity", "Herbal", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Pineapple Express": {"url": "https://www.allbud.com/marijuana-strains/hybrid/banana-pineapple-express", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-pineapple-express/Mnq34cec/20190409_124231jpg.jpg?t=319cf9d72b1dbbd36080969257e4ed5549cd1271ba20ca0b46c0439ae845d4e4", "name": "Banana Pineapple Express", "description": "Banana Pineapple Express is a rare evenly balanced hybrid strain (50% indica/50% sativa) created through crossing the classic Banana OG X Pineapple Express strains. When it comes to the flavor department, this bud has it all – rich tropical fruits, sweet bananas and berries, heavy pungent pine, you name it. The aroma follows a pungent earthy overtone, with fresh spicy berries and sweet herbs and tropical fruits dancing through it. The Banana Pineapple Express high is just as addictive as this flavor, with long-lasting cerebral effects that are perfect for when you need a little lift but don't have too much to get done. You'll feel lifted with an influx of creativity throughout the duration of the high, giving you the edge that you need to knock out any artistic undertakings. This is accompanied by a deeply relaxing body high that won't cause sedation but rather will keep you physically pain-free as your mind expands. Thanks to these effects and its high 22-26% average THC level, Banana Pineapple Express is said to be perfect for treating conditions such as depression, appetite loss, arthritis, and muscle spasms or cramps. This bud has oversized airy bright neon green nugs with yellow amber hairs and a coating of golden amber crystal trichomes.", "effects": ["Body High", "Cerebral", "Creative", "Relaxing", "Uplifting"], "aromas": ["Berry", "Blueberry", "Earthy", "Herbal", "Pungent", "Spicy", "Sweet"], "flavors": ["Berry", "Fruity", "Herbal", "Pine", "Sweet"], "relieves": ["Berry", "Fruity", "Herbal", "Pine", "Sweet"], "type": "Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Purp": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-purp", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-purp/xO6ygssW/16213590717324897400743364959491jpg.jpg?t=95969845044d76adde921036f5b8ddd9cbc4c4d8c9c10a99204582a2faf94550", "name": "Banana Purp", "description": "Banana Purp is a rare indica dominant hybrid created through a cross of the delicious Banana Kush X Granddaddy Purple strains. This bud brings on the delicious purple flavors and effects, blending them with kush and a touch of banana for a truly delicious high. Banana Purp has a fresh spicy kush taste with hints of grape and berry. The aroma is very dank and earthy with a musky grape overtone accented by sweet banana and other tree fruits. Like its Granddaddy Purple parent, Banana Purp has dark forest green nugs with rich purple undertones and a coating of frosty whit crystal trichomes that look slightly lavender in the right light. The Banana Purp high is very relaxing and lifted in nature, filling both mind and body with happy effects. You'll feel a euphoric onset a few minutes after toking that creeps up and takes hold, launching your mind into hazy spacey bliss. As this effect builds, a slightly sedative sleepy effect will wash over your body, lulling you into a slightly couch-locked state that's totally relaxing. Thanks to these effects and its moderate THC level, Banana Purp is said to be perfect for trating conditions such as chronic pain, depression, chronic stress or anxiety, and muscle spasms or inflammation.", "effects": ["Happy", "Relaxing", "Sleepy", "Uplifting"], "aromas": ["Berry", "Dank", "Earthy"], "flavors": ["Fruity", "Spicy", "Sweet"], "relieves": ["Fruity", "Spicy", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Split": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/banana-split", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-split/nPJ44tcj/20201006_215242jpg.jpg?t=950ef7006a324d5306615f4618436c133074b7d1b992a8a5bc93c75791ffadbf", "name": "Banana Split", "description": "Banana Split is a slightly sativa dominant hybrid strain (60% sativa/40% indica) created through crossing the infamous Tangie X Banana Sherbet strains. If you're after an insanely delicious flavor and a long-lasting high, you've found it with Banana Split. This lovely lady packs a super delicious sweet fruity cherries and cream flavor into each and every high-powered toke. The aroma follows the same profile, with a lightly tropical overtone that's accented by sour citrus and heavy cream. The Banana Split high is just as delectable as the flavor, with effects that are perfect for a lazy day when you need to get up and moving but don't have much of anything to really accomplish. It starts with a subtle lift, boosting your mood and leaving you feeling totally euphoric with a sense of cerebral energy and motivation. This is accompanied by a deeply relaxing body high that fills your entire being with a sense of calm without causing sedation or sleepiness in the slightest. Thanks to these effects and its high 22-25% average THC level, Banana Split is said to be perfect for treating conditions such as chronic stress, depression, chronic pain, inflammation, and chronic fatigue. This bud has oversized grape-shaped olive green nugs with bright yellow-orange hairs and a coating of amber crystal trichomes.", "effects": ["Energizing", "Euphoria", "Happy", "Relaxing", "Uplifting"], "aromas": ["Cherry", "Earthy", "Lemon", "Sour", "Spicy", "Tropical"], "flavors": ["Citrus", "Creamy", "Fruity", "Sour", "Sweet", "Tropical"], "relieves": ["Citrus", "Creamy", "Fruity", "Sour", "Sweet", "Tropical"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Split Kush": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-split-kush", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-split-kush/MKRrV8se/20180101_143202jpg.jpg?t=fe0d0916f52b0428a25c8ecf799b865d655fa1e155f5923aad914b69cf093012", "name": "Banana Split Kush", "description": "Banana Split Kush is an indica dominant hybrid strain created through crossing the classic OG Kush with the delicious Banana strain. With a super heavy average THC level that typically hits about 25% and sedative full-bodied effects, Banana Split Kush is one tasty treat that is sure to please any indica lover. The Banana Split Kush high comes on quickly with a building sense of relaxation. You'll feel it first in the back of your neck and head before it spreads throughout the rest of your body in warming waves. This state quickly becomes sedative and soon drops you into a state of sleepy couch-lock. Hunger often comes soon after, so make sure you have some snacks within reach! Thanks to these effects and its powerful THC level, Banana Split Kush is said to be perfect for treating conditions such as chronic pain, appetite loss, insomnia, and depression. Banana Split Kush buds have a sweet flavor of bananas and kush with an aroma of pungent fruit accented by a super dank effect that's released as the nugs are burned. Banana Split Kush buds have leafy dusty green nugs with clear hairs and a coating of tiny clear crystal trichomes.", "effects": ["Hungry", "Relaxing", "Sleepy"], "aromas": ["Dank", "Fruity", "Pungent"], "flavors": ["Fruity", "Herbal", "Sweet"], "relieves": ["Fruity", "Herbal", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Tangie": {"url": "https://www.allbud.com/marijuana-strains/indica-dominant-hybrid/banana-tangie", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-tangie/5RQSFzPL/banana-tangiejpg.jpg?t=ed564ad0217e27cd36b34264e6e09c5432801f1aa2acba8d06e77b570e1ec4f9", "name": "Banana Tangie", "description": "Banana Tangie, also known as “Banangie,” si a rare slightly indica dominant hybrid strain (60% indica/40% sativa) created through crossing the infamous Banana Kush X Tangie strains. This bud packs an insanely mouthwatering flavor, with tastes of rich banana and fresh sharp citrus that fill your lungs with each inhale. The aroma is earthy and tropical with a sour lemony effect that's accented by fresh banana and dank. The Banana Tangie high is just as delicious as the flavor, with lifting effects that are perfect for a lazy day spent doing not much of anything at all. The high comes on with a rushing effect that builds in the back of your head, pushing out any negative or racing thoughts and replacing them with pure happiness and motivation. You'll feel a light increase in energy that soon turns relaxing, leaving you physically at ease and slightly couch-locked at times. With these potent effects and its high 22% average THC level, Banana Tangie is often chosen to treat conditions such as chronic fatigue, depression, migraines or headaches, and chronic stress. This bud has fluffy grape-shaped forest green nugs with thin twisty orange hairs and a coating of golden amber crystal trichomes.", "effects": ["Cerebral", "Energizing", "Relaxing", "Uplifting"], "aromas": ["Citrus", "Earthy", "Herbal", "Pungent", "Sour"], "flavors": ["Citrus", "Fruity", "Skunky", "Sweet"], "relieves": ["Citrus", "Fruity", "Skunky", "Sweet"], "type": "Indica Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}, "Banana Treat": {"url": "https://www.allbud.com/marijuana-strains/sativa-dominant-hybrid/banana-treat", "img": "https://media.allbud.com/resized/350x242/media/images/strain/banana-treat/5853/ijrqfqgkjxsj9sc6ozga.jpg?t=63d303580e0846e07bc491c7b05f9ff5a308bda0dfe1e5346132fea623d90b42", "name": "Banana Treat", "description": "Banana Treat is an extremely rare sativa dominant hybrid strain created through crossing the infamous Banana Kush X Dutch Treat strains. If you love a sweet flavored bud and even sweeter head-heavy effects, Banana Treat is one anytime-of-the-day dessert you won't want to skimp on! Banana Treat is said to have a sweet fruity flavor accented by rich caramel and fresh banana with just a touch of earth. The aroma is very earthy with a hint of sweet kush and fruits with just a drizzle of candy and caramel. Banana Treat buds have long bright neon green nugs with fiery orange hairs and a coating of chunky oversized golden-hued crystal trichomes. The Banana Treat high is just as amazing as its taste with uplifted and energetic effects that are perfect for fueling your daytime adventures and giving a happy mood boost on a day you're feeling down. The high starts with a euphoric lift that leaves you feeling motivated and uplifted with a slight influx of energy. These effects won't overwhelm you but will rather leave you feeling calm and completely at ease, ready for anything that comes your way. With these effects and its high 16-18% average THC level, Banana Treat is said to be ideal for treating conditions such as fatigue, depression, irritability, and migraines or headaches.", "effects": ["Body High", "Cerebral", "Motivation", "Uplifting"], "aromas": ["Banana", "Earthy", "Kush", "Pungent", "Sweet"], "flavors": ["Caramel", "Citrus", "Fruity", "Sweet"], "relieves": ["Caramel", "Citrus", "Fruity", "Sweet"], "type": "Sativa Dominant Hybrid", "children": [], "parents": [], "aliases": [], "terpenes": []}}